
const D=[{cp:"特斯拉",z:"",c:"其他",sp:""},{cp:"Artificial intelligence",z:"人工智慧",c:"其他",sp:"tech"},{cp:"Electrical engineering",z:"電子工程",c:"其他",sp:""},{cp:"資訊 科技",z:"",c:"其他",sp:""},{cp:"Startups",z:"新創公司",c:"其他",sp:"young"},{cp:"Automation",z:"自動化 技術 -機器人",c:"其他",sp:""},{cp:"軟體開發",z:"",c:"其他",sp:""},{cp:"Personal finance",z:"投資理財",c:"其他",sp:""},{cp:"Stock market",z:"股票",c:"其他",sp:""},{cp:"Real estate",z:"房地產",c:"其他",sp:"re"},{cp:"科技",z:"",c:"其他",sp:""},{cp:"Machine learning",z:"機器學習",c:"其他",sp:"tech"},{cp:"電玩遊戲",z:"",c:"其他",sp:""},{cp:"Credit card",z:"信用卡",c:"其他",sp:""},{cp:"Big data",z:"大數據",c:"其他",sp:"tech"},{cp:"Electric vehicle",z:"電動車",c:"其他",sp:""},{cp:"Quality of life",z:"生活品質",c:"其他",sp:""},{cp:"資產 管理",z:"",c:"其他",sp:""},{cp:"質感設計",z:"",c:"其他",sp:""},{cp:"Commuting",z:"通勤",c:"其他",sp:""},{cp:"Luxury",z:"精品 店",c:"其他",sp:"rich"},{cp:"智慧 型 手錶",z:"",c:"其他",sp:""},{cp:"星巴克",z:"",c:"其他",sp:""},{cp:"航空",z:"",c:"其他",sp:""},{cp:"度假",z:"",c:"其他",sp:""},{cp:"Travel",z:"旅遊",c:"其他",sp:""},{cp:"國際飛行常客",z:"",c:"其他",sp:""},{cp:"L V",z:"",c:"其他",sp:""},{cp:"凡賽斯",z:"",c:"其他",sp:""},{cp:"Investment",z:"投資",c:"其他",sp:""},{cp:"免稅商店",z:"",c:"其他",sp:""},{cp:"Business decision maker",z:"商業決策者",c:"其他",sp:""},{cp:"自由工作者",z:"",c:"其他",sp:""},{cp:"Small business",z:"小型企業主",c:"其他",sp:""},{cp:"綜合企業",z:"",c:"其他",sp:""},{cp:"中型企業",z:"",c:"其他",sp:""},{cp:"商店管理員",z:"",c:"其他",sp:""},{cp:"Business management",z:"企業管理",c:"其他",sp:""},{cp:"Online advertising",z:"網路廣告",c:"其他",sp:""},{cp:"Digital marketing",z:"數位行銷",c:"其他",sp:""},{cp:"Social media marketing",z:"社群媒體行銷",c:"其他",sp:"young"},{cp:"Marketing",z:"行銷",c:"其他",sp:""},{cp:"促銷",z:"",c:"其他",sp:""},{cp:"Affiliate marketing",z:"聯盟行銷",c:"其他",sp:""},{cp:"Business",z:"商業",c:"其他",sp:""},{cp:"Loan",z:"貸款",c:"其他",sp:""},{cp:"資金",z:"",c:"其他",sp:""},{cp:"Leasing",z:"租賃",c:"其他",sp:""},{cp:"智慧科技",z:"",c:"其他",sp:""},{cp:"Electronics",z:"電子產品",c:"其他",sp:""},{cp:"中小企業經營",z:"",c:"其他",sp:""},{cp:"Brand management",z:"品牌管理",c:"其他",sp:""},{cp:"顧客關係管理",z:"",c:"其他",sp:""},{cp:"Human resource management",z:"人力資源管理",c:"其他",sp:""},{cp:"Asset management",z:"資產管理",c:"其他",sp:"rich"},{cp:"Business model",z:"商業模式",c:"其他",sp:""},{cp:"111 人力銀行",z:"",c:"其他",sp:""},{cp:"徵才",z:"",c:"其他",sp:""},{cp:"培訓和開發",z:"",c:"其他",sp:""},{cp:"Real estate investing",z:"房地產投資",c:"其他",sp:"re"},{cp:"新聞媒 體",z:"",c:"其他",sp:""},{cp:"Luxury vehicle",z:"豪華轎車",c:"其他",sp:"rich"},{cp:"Wearable technology",z:"穿戴式科技",c:"其他",sp:""},{cp:"醫學院",z:"",c:"其他",sp:""},{cp:"Health care",z:"健康照護與醫療服務",c:"其他",sp:""},{cp:"健康和保健創作者",z:"",c:"其他",sp:""},{cp:"保健內容",z:"",c:"其他",sp:""},{cp:"Parenting",z:"親子教育",c:"其他",sp:""},{cp:"蒙特梭利教育法",z:"",c:"其他",sp:""},{cp:"Sports car",z:"跑車",c:"其他",sp:""},{cp:"國民健保署",z:"",c:"其他",sp:""},{cp:"Fitness",z:"健身和保健",c:"其他",sp:""},{cp:"律師",z:"",c:"其他",sp:""},{cp:"律師事務所",z:"",c:"其他",sp:""},{cp:"律師資格考試",z:"",c:"其他",sp:""},{cp:"法律",z:"",c:"其他",sp:""},{cp:"法律與秩序",z:"",c:"其他",sp:""},{cp:"法律服務",z:"",c:"其他",sp:""},{cp:"法官",z:"",c:"其他",sp:""},{cp:"法學家",z:"",c:"其他",sp:""},{cp:"法學院",z:"",c:"其他",sp:""},{cp:"民法",z:"",c:"其他",sp:""},{cp:"司法機構",z:"",c:"其他",sp:""},{cp:"Education",z:"教育",c:"其他",sp:""},{cp:"親子",z:"",c:"其他",sp:""},{cp:"西裝",z:"",c:"其他",sp:""},{cp:"Distance education",z:"遠距教學",c:"其他",sp:""},{cp:"Vocational education",z:"職業教育",c:"其他",sp:""},{cp:"學校",z:"",c:"其他",sp:""},{cp:"大專院校",z:"",c:"其他",sp:""},{cp:"私立學校",z:"",c:"其他",sp:""},{cp:"書籍",z:"",c:"其他",sp:""},{cp:"誠品書店",z:"",c:"其他",sp:""},{cp:"文具",z:"",c:"其他",sp:""},{cp:"暑假",z:"",c:"其他",sp:""},{cp:"Art",z:"藝術和音樂",c:"其他",sp:""},{cp:"House",z:"房屋",c:"其他",sp:""},{cp:"都市計畫",z:"",c:"其他",sp:""},{cp:"Passive income",z:"被動收入",c:"其他",sp:""},{cp:"Return on investment",z:"投資報酬率",c:"其他",sp:""},{cp:"Exchange-traded fund",z:"指數股票型基金",c:"其他",sp:""},{cp:"證券交易所",z:"",c:"其他",sp:""},{cp:"股市指數期貨",z:"",c:"其他",sp:""},{cp:"財產",z:"",c:"其他",sp:""},{cp:"財產保險",z:"",c:"其他",sp:""},{cp:"動產",z:"",c:"其他",sp:""},{cp:"Youtube",z:"",c:"其他",sp:"young"},{cp:"Online banking",z:"網路銀行",c:"其他",sp:""},{cp:"交通",z:"",c:"其他",sp:""},{cp:"Public transport",z:"公共運輸",c:"其他",sp:""},{cp:"White-collar worker",z:"上班族",c:"其他",sp:""},{cp:"行動商務",z:"",c:"其他",sp:""},{cp:"百貨公司",z:"",c:"其他",sp:""},{cp:"Online shopping",z:"網路購物",c:"其他",sp:""},{cp:"購物中心",z:"",c:"其他",sp:""},{cp:"Mobile payment",z:"行動支付",c:"其他",sp:""},{cp:"機場",z:"",c:"其他",sp:""},{cp:"Uber",z:"",c:"其他",sp:""},{cp:"經常旅行的用戶",z:"",c:"其他",sp:""},{cp:"Food",z:"美食",c:"其他",sp:""},{cp:"Cooking",z:"烹飪",c:"其他",sp:""},{cp:"輪班工作制",z:"",c:"其他",sp:""},{cp:"折扣商店",z:"",c:"其他",sp:""},{cp:"暢貨中心",z:"",c:"其他",sp:""},{cp:"Popular culture",z:"流行文化",c:"其他",sp:""},{cp:"流行音樂",z:"",c:"其他",sp:""},{cp:"股 票",z:"",c:"其他",sp:""},{cp:"Social media",z:"社群媒體",c:"其他",sp:"young"},{cp:"instagram",z:"",c:"其他",sp:"young"},{cp:"f acebook",z:"",c:"其他",sp:""},{cp:"foodpanda",z:"",c:"其他",sp:""},{cp:"ubereats",z:"",c:"其他",sp:""},{cp:"Spotify",z:"",c:"其他",sp:"young"},{cp:"夜生活",z:"",c:"其他",sp:""},{cp:"Beauty",z:"美容",c:"其他",sp:""},{cp:"服飾",z:"",c:"其他",sp:""},{cp:"零售業",z:"",c:"其他",sp:""},{cp:"電信業",z:"",c:"其他",sp:""},{cp:"顧客服務",z:"",c:"其他",sp:""},{cp:"Home improvement",z:"居家裝修",c:"其他",sp:""},{cp:"Household",z:"家庭",c:"其他",sp:""},{cp:"Gardening",z:"園藝",c:"其他",sp:""},{cp:"家樂福",z:"",c:"其他",sp:""},{cp:"大潤發",z:"",c:"其他",sp:""},{cp:"美髮產品",z:"",c:"其他",sp:""},{cp:"Yoga",z:"瑜珈",c:"其他",sp:""},{cp:"netflix",z:"",c:"其他",sp:"young"},{cp:"y outube",z:"",c:"其他",sp:""},{cp:"食譜",z:"",c:"其他",sp:""},{cp:"超市",z:"",c:"其他",sp:""},{cp:"量販店",z:"",c:"其他",sp:""},{cp:"優惠",z:"",c:"其他",sp:""},{cp:"幼兒照護",z:"",c:"其他",sp:""},{cp:"日常",z:"",c:"其他",sp:""},{cp:"天氣預報",z:"",c:"其他",sp:""},{cp:"Handicraft",z:"手工藝",c:"其他",sp:""},{cp:"Pension",z:"退休金",c:"其他",sp:"civil"},{cp:"Retirement Insurance Benefits",z:"退休保險",c:"其他",sp:""},{cp:"轎車",z:"",c:"其他",sp:""},{cp:"消防局",z:"",c:"其他",sp:""},{cp:"柔道",z:"",c:"其他",sp:""},{cp:"跆拳道",z:"",c:"其他",sp:""},{cp:"Camping",z:"露營",c:"其他",sp:""},{cp:"Cycling",z:"自行車",c:"其他",sp:""},{cp:"Hiking",z:"登山",c:"其他",sp:""},{cp:"News media",z:"新聞媒體",c:"其他",sp:""},{cp:"政治和社會議題",z:"",c:"其他",sp:""},{cp:"軍人節",z:"",c:"其他",sp:""},{cp:"休閒活動",z:"",c:"其他",sp:""},{cp:"政府",z:"",c:"其他",sp:""},{cp:"地方政府",z:"",c:"其他",sp:""},{cp:"戶外休閒活動",z:"",c:"其他",sp:""},{cp:"退伍軍人節",z:"",c:"其他",sp:""},{cp:"591房屋交易網",z:"",c:"其他",sp:""},{cp:"Current events",z:"時事",c:"其他",sp:""},{cp:"國家安全",z:"",c:"其他",sp:""},{cp:"Cybersecurity",z:"資訊安全",c:"其他",sp:"tech"},{cp:"社區議題",z:"",c:"其他",sp:""},{cp:"媽媽寶寶-懷孕",z:"",c:"其他",sp:""},{cp:"生產",z:"",c:"其他",sp:""},{cp:"團購",z:"",c:"其他",sp:""},{cp:"Laptop",z:"筆記型電腦",c:"其他",sp:""},{cp:"手錶",z:"",c:"其他",sp:""},{cp:"智慧型手表",z:"",c:"其他",sp:""},{cp:"Information technology",z:"資訊科技",c:"其他",sp:""},{cp:"Financial market",z:"金融市場",c:"其他",sp:""},{cp:"貿易",z:"",c:"其他",sp:""},{cp:"國際貿易",z:"",c:"其他",sp:""},{cp:"報關員",z:"",c:"其他",sp:""},{cp:"Entrepreneurship",z:"企業家",c:"其他",sp:""},{cp:"Collectibles",z:"收藏",c:"其他",sp:"rich"},{cp:"古董",z:"",c:"其他",sp:""},{cp:"商會",z:"",c:"其他",sp:""},{cp:"Accounting",z:"會計系統",c:"其他",sp:""},{cp:"愾濟學",z:"",c:"其他",sp:""},{cp:"財務會計",z:"",c:"其他",sp:""},{cp:"Insurance",z:"保險",c:"其他",sp:""},{cp:"Banking",z:"銀行業",c:"其他",sp:""},{cp:"財經",z:"",c:"其他",sp:""},{cp:"飲料",z:"",c:"其他",sp:""},{cp:"facebook",z:"",c:"其他",sp:""},{cp:"youtube",z:"",c:"其他",sp:"young"},{cp:"便利商店",z:"",c:"其他",sp:""},{cp:"特賣促銷",z:"",c:"其他",sp:""},{cp:"特賣情報粉絲團",z:"",c:"其他",sp:""},{cp:"Motorcycle",z:"摩托車",c:"其他",sp:""},{cp:"Fashion",z:"時尚",c:"其他",sp:""},{cp:"Design",z:"設計",c:"其他",sp:""},{cp:"平面設計",z:"",c:"其他",sp:""},{cp:"美學",z:"",c:"其他",sp:""},{cp:"視覺藝術",z:"",c:"其他",sp:""},{cp:"現代藝術",z:"",c:"其他",sp:""},{cp:"Art exhibitions",z:"藝術展覽",c:"其他",sp:"civil"},{cp:"展覽館",z:"",c:"其他",sp:""},{cp:"創意",z:"",c:"其他",sp:""},{cp:"Interior design",z:"室內設計",c:"其他",sp:""},{cp:"品牌",z:"",c:"其他",sp:""},{cp:"Coffee",z:"咖啡廳",c:"其他",sp:""},{cp:"機械加工",z:"",c:"其他",sp:""},{cp:"金屬加工",z:"",c:"其他",sp:""},{cp:"Manufacturing",z:"製造業",c:"其他",sp:""},{cp:"工廠",z:"",c:"其他",sp:""},{cp:"Industrial engineering",z:"工業工程",c:"其他",sp:""},{cp:"機械工程",z:"",c:"其他",sp:""},{cp:"輪班制",z:"",c:"其他",sp:""},{cp:"優惠券",z:"",c:"其他",sp:""},{cp:"技術員",z:"",c:"其他",sp:""},{cp:"Automobile",z:"汽車",c:"其他",sp:""},{cp:"改裝車",z:"",c:"其他",sp:""},{cp:"保單",z:"",c:"其他",sp:""},{cp:"一般保險",z:"",c:"其他",sp:""},{cp:"銀行帳戶",z:"",c:"其他",sp:""},{cp:"House painters and decorators",z:"房屋油漆工和裝修師",c:"其他",sp:""},{cp:"金融服務",z:"",c:"其他",sp:""},{cp:"財務顧問",z:"",c:"其他",sp:""},{cp:"Foreign exchange market",z:"外匯市場",c:"其他",sp:""},{cp:"風險評估",z:"",c:"其他",sp:""},{cp:"風險投資",z:"",c:"其他",sp:""},{cp:"酒精飲品",z:"",c:"其他",sp:""},{cp:"管理",z:"",c:"其他",sp:""},{cp:"Senior management",z:"高階管理人員",c:"其他",sp:""},{cp:"Golf",z:"高爾夫",c:"其他",sp:"rich"},{cp:"俱樂部",z:"",c:"其他",sp:""},{cp:"古馳",z:"",c:"其他",sp:""},{cp:"愛馬仕",z:"",c:"其他",sp:""},{cp:"路易威登",z:"",c:"其他",sp:""},{cp:"學術研討會",z:"",c:"其他",sp:""},{cp:"研究",z:"",c:"其他",sp:""},{cp:"實驗室",z:"",c:"其他",sp:""},{cp:"Higher education",z:"高等教育",c:"其他",sp:""},{cp:"賣書",z:"",c:"其他",sp:""},{cp:"小學",z:"",c:"其他",sp:""},{cp:"廚房",z:"",c:"家居",sp:""},{cp:"閱讀",z:"",c:"娛樂",sp:""},{cp:"Gardening",z:"園藝",c:"旅遊生活",sp:""},{cp:"Parenting",z:"親子教育",c:"教育",sp:""},{cp:"Home improvement",z:"居家裝修",c:"家居",sp:""},{cp:"Early childhood education",z:"幼兒教育",c:"教育",sp:""},{cp:"Education",z:"教育",c:"社會",sp:""},{cp:"大自然",z:"",c:"科技",sp:""},{cp:"Cycling",z:"自行車",c:"健康運動",sp:""},{cp:"書籍",z:"",c:"娛樂",sp:""},{cp:"Household",z:"家庭",c:"社會",sp:""},{cp:"Real estate",z:"房地產",c:"科技",sp:"re"},{cp:"Cooking",z:"烹飪",c:"美食",sp:""},{cp:"Passive income",z:"被動收入",c:"商業",sp:""},{cp:"Real estate investing",z:"房地產投資",c:"金融",sp:"re"},{cp:"Wealth",z:"財富",c:"金融",sp:""},{cp:"Real estate",z:"不動產",c:"房地產興趣",sp:"re"},{cp:"公司",z:"",c:"其他",sp:""},{cp:"收入",z:"",c:"商業",sp:""},{cp:"Entrepreneurship",z:"企業家",c:"商業",sp:""},{cp:"Business",z:"商業",c:"商業",sp:""},{cp:"獨資企業",z:"",c:"商業",sp:""},{cp:"Franchising",z:"加盟連鎖",c:"商業",sp:""},{cp:"Startups",z:"新創公司",c:"商業",sp:"young"},{cp:"居家事業",z:"",c:"商業",sp:""},{cp:"加工出口工廠",z:"",c:"其他",sp:""},{cp:"Manufacturing",z:"製造業",c:"科技",sp:""},{cp:"Food industry",z:"食品產業",c:"其他",sp:""},{cp:"Textile industry",z:"紡織工業",c:"其他",sp:""},{cp:"Investment",z:"投資",c:"商業",sp:""},{cp:"Return on investment",z:"投資報酬率",c:"金融",sp:""},{cp:"批發",z:"",c:"商業",sp:""},{cp:"News media",z:"新聞媒體",c:"娛樂",sp:""},{cp:"Current events",z:"時事",c:"社會",sp:""},{cp:"Online shopping",z:"網路購物",c:"商業",sp:""},{cp:"Personal finance",z:"個人理財",c:"金融",sp:""},{cp:"Condominium",z:"公寓大樓",c:"房地產興趣",sp:"re"},{cp:"金融服務",z:"",c:"商業",sp:""},{cp:"金錢",z:"",c:"金融",sp:""},{cp:"促銷",z:"",c:"商業",sp:""},{cp:"政府",z:"",c:"社會",sp:""},{cp:"證券",z:"",c:"金融",sp:""},{cp:"Banking",z:"銀行業",c:"金融",sp:""},{cp:"House",z:"房屋",c:"房地產興趣",sp:""},{cp:"假期",z:"",c:"旅遊生活",sp:""},{cp:"國際觀光振興機構",z:"",c:"其他",sp:""},{cp:"住宿加早餐酒店",z:"",c:"其他",sp:""},{cp:"Higher education",z:"高等教育",c:"教育",sp:""},{cp:"航空公司",z:"",c:"其他",sp:""},{cp:"Travel",z:"旅遊",c:"旅遊生活",sp:""},{cp:"輕旅行",z:"",c:"其他",sp:""},{cp:"戶外",z:"",c:"旅遊生活",sp:""},{cp:"Camping",z:"露營",c:"旅遊生活",sp:""},{cp:"運動",z:"",c:"健康運動",sp:""},{cp:"戶外休閒活動",z:"",c:"旅遊生活",sp:""},{cp:"公園",z:"",c:"其他",sp:""},{cp:"休閒",z:"",c:"社會",sp:""},{cp:"Hiking",z:"登山",c:"其他",sp:""},{cp:"Cycling",z:"自行車",c:"交通",sp:""},{cp:"休閒娛樂",z:"",c:"社會",sp:""},{cp:"野餐",z:"",c:"美食",sp:""},{cp:"Handicraft",z:"手工藝",c:"其他",sp:""},{cp:"Handicraft",z:"手工藝",c:"其他",sp:""},{cp:"Trails",z:"營地",c:"旅遊生活",sp:""},{cp:"Independent travel",z:"自助旅行",c:"旅遊生活",sp:""},{cp:"背包",z:"",c:"交通",sp:""},{cp:"Ecotourism",z:"生態旅遊",c:"旅遊生活",sp:""},{cp:"度假",z:"",c:"社會",sp:""},{cp:"Apartment",z:"公寓",c:"房地產興趣",sp:""},{cp:"自釀啤酒",z:"",c:"其他",sp:""},{cp:"住家",z:"",c:"家居",sp:""},{cp:"美術館",z:"",c:"其他",sp:""},{cp:"酒精飲品",z:"",c:"美食",sp:""},{cp:"Beer",z:"啤酒節",c:"其他",sp:""},{cp:"現代藝術",z:"",c:"娛樂",sp:""},{cp:"博物館",z:"",c:"旅遊生活",sp:""},{cp:"農場",z:"",c:"農業自然",sp:""},{cp:"Craft brewing",z:"釀造",c:"美食",sp:""},{cp:"Craft brewing",z:"釀造廠",c:"其他",sp:""},{cp:"植物",z:"",c:"農業自然",sp:""},{cp:"Small and medium enterprises",z:"中小型企業",c:"商業",sp:""},{cp:"Entrepreneurship",z:"創意創業",c:"金融",sp:""},{cp:"Business management",z:"企業管理",c:"商業",sp:""},{cp:"Electronics",z:"電子產品",c:"科技",sp:""},{cp:"Fish farming",z:"養殖漁業",c:"其他",sp:""},{cp:"出口貿易",z:"",c:"其他",sp:""},{cp:"Agriculture",z:"農業",c:"科技",sp:""},{cp:"Small business",z:"小型企業",c:"商業",sp:""},{cp:"高科技",z:"",c:"科技",sp:""},{cp:"Digital marketing",z:"數位行銷",c:"商業",sp:""},{cp:"Social media",z:"社群媒體",c:"科技",sp:"young"},{cp:"Chemical industry",z:"化學工業",c:"其他",sp:""},{cp:"環境工程",z:"",c:"其他",sp:""},{cp:"Industrial engineering",z:"工業工程",c:"科技",sp:""},{cp:"機械工程",z:"",c:"科技",sp:""},{cp:"電機工程",z:"",c:"科技",sp:""},{cp:"工廠",z:"",c:"商業",sp:""},{cp:"金屬加工",z:"",c:"房地產興趣",sp:""},{cp:"電腦工程",z:"",c:"科技",sp:""},{cp:"土木工程",z:"",c:"科技",sp:""},{cp:"建築工程",z:"",c:"其他",sp:""},{cp:"船艇製造和銷售",z:"",c:"交通",sp:""},{cp:"醫學院",z:"",c:"教育",sp:""},{cp:"健康和保健",z:"",c:"時尚美妝",sp:""},{cp:"蒙台梭利教育法",z:"",c:"其他",sp:""},{cp:"Luxury vehicle",z:"豪華轎車",c:"交通",sp:"rich"},{cp:"Mental health",z:"身心健康",c:"健康運動",sp:""},{cp:"除濕機",z:"",c:"其他",sp:""},{cp:"Quality of life",z:"生活品質",c:"健康運動",sp:""},{cp:"空氣凈化器",z:"",c:"其他",sp:""},{cp:"健康教育",z:"",c:"其他",sp:""},{cp:"新家",z:"",c:"其他",sp:""},{cp:"Loan",z:"貸款",c:"金融",sp:""},{cp:"傢俱",z:"",c:"家居",sp:""},{cp:"Mortgage loan",z:"房屋抵押貸款",c:"金融",sp:"re"},{cp:"Information technology",z:"資訊科技",c:"科技",sp:""},{cp:"Credit card",z:"信用卡",c:"金融",sp:""},{cp:"超市",z:"",c:"美食",sp:""},{cp:"量販店",z:"",c:"美食",sp:""},{cp:"學習",z:"",c:"教育",sp:""},{cp:"訓練",z:"",c:"教育",sp:""},{cp:"幼兒照護",z:"",c:"教育",sp:""},{cp:"宜家家居",z:"",c:"商業",sp:""},{cp:"海鮮",z:"",c:"美食",sp:""},{cp:"零售業",z:"",c:"科技",sp:""},{cp:"White-collar worker",z:"上班族",c:"娛樂",sp:""},{cp:"Commuting",z:"通勤",c:"旅遊生活",sp:""},{cp:"Public transport",z:"公共運輸",c:"交通",sp:""},{cp:"本日優惠",z:"",c:"商業",sp:""},{cp:"購物折扣",z:"",c:"商業",sp:""},{cp:"Fashion",z:"時尚配件",c:"時尚美妝",sp:""},{cp:"Automobile",z:"汽車",c:"交通",sp:""},{cp:"AI",z:"",c:"其他",sp:""},{cp:"7-11",z:"",c:"其他",sp:""},{cp:"FamilyMart",z:"",c:"其他",sp:""},{cp:"自僱",z:"",c:"商業",sp:""},{cp:"Asset management",z:"資產管理",c:"金融",sp:"rich"},{cp:"Coffee",z:"咖啡廳",c:"美食",sp:""},{cp:"Badminton",z:"羽球",c:"健康運動",sp:""},{cp:"Netflix",z:"",c:"娛樂",sp:"young"},{cp:"YouTube",z:"",c:"娛樂",sp:"young"},{cp:"經銷",z:"",c:"商業",sp:""},{cp:"直運",z:"",c:"商業",sp:""},{cp:"電子商務",z:"",c:"商業",sp:""},{cp:"Social media marketing",z:"社群媒體行銷",c:"商業",sp:"young"},{cp:"Leasing",z:"租賃",c:"房地產興趣",sp:""},{cp:"Stock market",z:"股票",c:"金融",sp:""},{cp:"樂屋網",z:"",c:"其他",sp:""},{cp:"Travel",z:"旅遊",c:"科技",sp:""},{cp:"休閒活動",z:"",c:"旅遊生活",sp:""},{cp:"新聞播報",z:"",c:"娛樂",sp:""},{cp:"大眾媒體",z:"",c:"娛樂",sp:""},{cp:"財經",z:"",c:"商業",sp:""},{cp:"智慧科技",z:"",c:"科技",sp:""},{cp:"Artificial intelligence",z:"人工智慧",c:"科技",sp:"tech"},{cp:"Big data",z:"大數據",c:"科技",sp:"tech"},{cp:"新興技術",z:"",c:"科技",sp:""},{cp:"飯店",z:"",c:"旅遊生活",sp:""},{cp:"http://booking.com/",z:"",c:"旅遊生活",sp:""},{cp:"http://hotels.com/",z:"",c:"旅遊生活",sp:""},{cp:"Trivago",z:"",c:"其他",sp:""},{cp:"無印良品",z:"",c:"其他",sp:""},{cp:"Workinghouse 生活工場",z:"",c:"其他",sp:""},{cp:"H&M",z:"",c:"時尚美妝",sp:""},{cp:"Zara",z:"",c:"商業",sp:""},{cp:"Uniqlo",z:"",c:"時尚美妝",sp:""},{cp:"日本",z:"",c:"旅遊生活",sp:""},{cp:"日本料理",z:"",c:"美食",sp:""},{cp:"食品加工",z:"",c:"其他",sp:""},{cp:"食品保存",z:"",c:"其他",sp:""},{cp:"全食食品超市",z:"",c:"美食",sp:""},{cp:"Farmers market",z:"農夫市集",c:"美食",sp:""},{cp:"中式料理",z:"",c:"美食",sp:""},{cp:"供應鏈",z:"",c:"其他",sp:""},{cp:"食品",z:"",c:"美食",sp:""},{cp:"醬汁",z:"",c:"其他",sp:""},{cp:"旅行攝影",z:"",c:"娛樂",sp:""},{cp:"數位攝影",z:"",c:"娛樂",sp:""},{cp:"數位相機",z:"",c:"其他",sp:""},{cp:"Marketing",z:"行銷",c:"商業",sp:""},{cp:"廣告",z:"",c:"商業",sp:""},{cp:"內容行銷",z:"",c:"商業",sp:""},{cp:"Design",z:"設計",c:"商業",sp:""},{cp:"平面設計",z:"",c:"娛樂",sp:""},{cp:"Adobe Illustrator",z:"",c:"其他",sp:""},{cp:"Canva",z:"",c:"其他",sp:""},{cp:"Interior design",z:"室內設計",c:"商業",sp:""},{cp:"工具",z:"",c:"科技",sp:""},{cp:"手動工具",z:"",c:"科技",sp:""},{cp:"工具箱",z:"",c:"其他",sp:""},{cp:"鑽孔",z:"",c:"家居",sp:""},{cp:"螺釘旋具",z:"",c:"其他",sp:""},{cp:"電動工具",z:"",c:"家居",sp:""},{cp:"焊接",z:"",c:"其他",sp:""},{cp:"工具機",z:"",c:"家居",sp:""},{cp:"建材",z:"",c:"科技",sp:""},{cp:"成衣",z:"",c:"其他",sp:""},{cp:"紡織品",z:"",c:"其他",sp:""},{cp:"紡織品",z:"",c:"娛樂",sp:""},{cp:"服裝",z:"",c:"時尚美妝",sp:""},{cp:"縫紉機",z:"",c:"其他",sp:""},{cp:"編織",z:"",c:"其他",sp:""},{cp:"縫紉",z:"",c:"娛樂",sp:""},{cp:"紗線",z:"",c:"其他",sp:""},{cp:"刺繡",z:"",c:"其他",sp:""},{cp:"Fashion",z:"時尚設計",c:"商業",sp:""},{cp:"棉花",z:"",c:"娛樂",sp:""},{cp:"T 恤",z:"",c:"時尚美妝",sp:""},{cp:"食譜",z:"",c:"美食",sp:""},{cp:"Organic food",z:"有機食品",c:"美食",sp:""},{cp:"烘焙",z:"",c:"美食",sp:""},{cp:"天然食品",z:"",c:"美食",sp:""},{cp:"廚具",z:"",c:"家居",sp:""},{cp:"Cooking",z:"烹飪和烘焙用具",c:"家居",sp:""},{cp:"現代家具",z:"",c:"家居",sp:""},{cp:"Real estate listing websites",z:"房屋廣告和入口網站",c:"科技",sp:"re"},{cp:"物流",z:"",c:"商業",sp:""},{cp:"Insurance",z:"保險",c:"商業",sp:""},{cp:"保單",z:"",c:"金融",sp:""},{cp:"五金行",z:"",c:"商業",sp:""},{cp:"玩家",z:"",c:"娛樂",sp:""},{cp:"休閒遊戲",z:"",c:"娛樂",sp:""},{cp:"顧客服務",z:"",c:"商業",sp:""},{cp:"Food",z:"美食",c:"美食",sp:""},{cp:"非營利組織",z:"",c:"社會",sp:""},{cp:"捐贈",z:"",c:"社會",sp:""},{cp:"社區議題",z:"",c:"其他",sp:""},{cp:"數位貨幣",z:"",c:"金融",sp:""},{cp:"體育",z:"",c:"其他",sp:""},{cp:"Running",z:"跑步",c:"健康運動",sp:""},{cp:"Foreign exchange market",z:"外匯市場",c:"金融",sp:""},{cp:"Nutritional supplements",z:"維他命和營養補充品",c:"美食",sp:""},{cp:"倉儲業",z:"",c:"科技",sp:""},{cp:"Television",z:"電視節目",c:"娛樂",sp:""},{cp:"自我照護",z:"",c:"健康運動",sp:""},{cp:"牙科學院",z:"",c:"教育",sp:""},{cp:"中台科大",z:"",c:"其他",sp:""},{cp:"勤益科大",z:"",c:"其他",sp:""},{cp:"中國醫",z:"",c:"其他",sp:""},{cp:"研究所教育",z:"",c:"教育",sp:""},{cp:"網絡報紙",z:"",c:"娛樂",sp:""},{cp:"Financial market",z:"金融市場",c:"金融",sp:""},{cp:"Fitness",z:"健身",c:"健康運動",sp:""},{cp:"Golf",z:"高爾夫球",c:"健康運動",sp:"rich"},{cp:"迪卡儂",z:"",c:"其他",sp:""},{cp:"團隊運動",z:"",c:"健康運動",sp:""},{cp:"住家修繕",z:"",c:"其他",sp:""},{cp:"影片分享網站",z:"",c:"其他",sp:""},{cp:"Viral video",z:"爆紅影片",c:"科技",sp:""},{cp:"網路迷因",z:"",c:"娛樂",sp:""},{cp:"建築物",z:"",c:"房地產興趣",sp:""},{cp:"水利產業",z:"",c:"其他",sp:""},{cp:"Automobile",z:"汽車業",c:"科技",sp:""},{cp:"製造生產服務和組織",z:"",c:"商業",sp:""},{cp:"住宅興建",z:"",c:"房地產興趣",sp:""},{cp:"現金",z:"",c:"其他",sp:""},{cp:"Investment",z:"投資者",c:"金融",sp:""},{cp:"股份",z:"",c:"金融",sp:""},{cp:"當沖交易",z:"",c:"金融",sp:""},{cp:"股市指數",z:"",c:"金融",sp:""},{cp:"波段交易",z:"",c:"金融",sp:""},{cp:"Consumer electronics",z:"消費電子產品媒體和內容",c:"科技",sp:"tech"},{cp:"電腦",z:"",c:"科技",sp:""},{cp:"科技",z:"",c:"科技",sp:""},{cp:"Esports",z:"電競電腦",c:"科技",sp:"young"},{cp:"MacBook",z:"",c:"其他",sp:""},{cp:"Apple Watch",z:"",c:"科技",sp:""},{cp:"PlayStation",z:"",c:"娛樂",sp:""},{cp:"任天堂",z:"",c:"娛樂",sp:""},{cp:"iPad",z:"",c:"其他",sp:""},{cp:"虛擬實境",z:"",c:"娛樂",sp:""},{cp:"戴森",z:"",c:"其他",sp:""},{cp:"飛利浦",z:"",c:"其他",sp:""},{cp:"伊萊克斯",z:"",c:"其他",sp:""},{cp:"三星電子",z:"",c:"科技",sp:""},{cp:"MUJI 無印良品",z:"",c:"其他",sp:""},{cp:"居家裝潢零售商",z:"",c:"商業",sp:""},{cp:"求婚",z:"",c:"旅遊生活",sp:""},{cp:"婚禮",z:"",c:"社會",sp:""},{cp:"Booking.com",z:"",c:"旅遊生活",sp:""},{cp:"Hotels.com",z:"",c:"旅遊生活",sp:""},{cp:"星巴克",z:"",c:"美食",sp:""},{cp:"家電",z:"",c:"科技",sp:""},{cp:"儲蓄",z:"",c:"金融",sp:""},{cp:"Real estate",z:"房地產經濟學",c:"金融",sp:"re"},{cp:"Pension",z:"退休金",c:"金融",sp:"civil"},{cp:"Retirement planning",z:"退休規劃",c:"金融",sp:"civil"},{cp:"政治和社會議題",z:"",c:"社會",sp:""},{cp:"本地新聞",z:"",c:"娛樂",sp:""},{cp:"公共安全",z:"",c:"其他",sp:""},{cp:"折扣和折讓",z:"",c:"商業",sp:""},{cp:"Mobile payment",z:"行動支付",c:"金融",sp:""},{cp:"生活用品",z:"",c:"家居",sp:""},{cp:"智慧裝置",z:"",c:"科技",sp:""},{cp:"家務",z:"",c:"家居",sp:""},{cp:"好市多",z:"",c:"商業",sp:""},{cp:"經濟",z:"",c:"金融",sp:""},{cp:"Financial planning",z:"財務規劃",c:"金融",sp:""},{cp:"便利商店",z:"",c:"商業",sp:""},{cp:"貿易",z:"",c:"金融",sp:""},{cp:"Trading strategy",z:"交易策略",c:"金融",sp:""},{cp:"外匯交易信號",z:"",c:"金融",sp:""},{cp:"Stock broker",z:"股票經紀人",c:"金融",sp:""},{cp:"財務顧問",z:"",c:"金融",sp:""},{cp:"建築",z:"",c:"房地產興趣",sp:""},{cp:"Real estate development",z:"房地產開發",c:"房地產興趣",sp:"re"},{cp:"公共廣播",z:"",c:"其他",sp:""},{cp:"儲蓄帳戶",z:"",c:"金融",sp:""},{cp:"報紙",z:"",c:"娛樂",sp:""},{cp:"旅行社和預訂",z:"",c:"旅遊生活",sp:""},{cp:"廣播",z:"",c:"其他",sp:""},{cp:"文化",z:"",c:"社會",sp:""},{cp:"Television",z:"電視台",c:"其他",sp:""},{cp:"圖書館",z:"",c:"其他",sp:""},{cp:"Skin care",z:"保養",c:"其他",sp:""},{cp:"維修和操作",z:"",c:"房地產興趣",sp:""},{cp:"機器",z:"",c:"其他",sp:""},{cp:"臥室家具",z:"",c:"家居",sp:""},{cp:"Zara Home",z:"",c:"商業",sp:""},{cp:"網站設計",z:"",c:"科技",sp:""},{cp:"百貨公司",z:"",c:"商業",sp:""},{cp:"休閒餐廳",z:"",c:"美食",sp:""},{cp:"Beauty",z:"美容",c:"社會",sp:""},{cp:"品質保證",z:"",c:"其他",sp:""},{cp:"有機產品",z:"",c:"美食",sp:""},{cp:"http://iherb.com/",z:"",c:"其他",sp:""},{cp:"亞馬遜公司",z:"",c:"商業",sp:""},{cp:"PayPal",z:"",c:"金融",sp:""},{cp:"休旅車",z:"",c:"交通",sp:""},{cp:"Art exhibitions",z:"藝術展覽",c:"娛樂",sp:"civil"},{cp:"當代美術館",z:"",c:"娛樂",sp:""},{cp:"繪畫",z:"",c:"娛樂",sp:""},{cp:"創意",z:"",c:"社會",sp:""},{cp:"插畫",z:"",c:"其他",sp:""},{cp:"特賣促銷",z:"",c:"商業",sp:""},{cp:"Food service",z:"餐飲業",c:"美食",sp:""},{cp:"購物",z:"",c:"商業",sp:""},{cp:"飲料",z:"",c:"美食",sp:""},{cp:"Popular culture",z:"流行文化",c:"社會",sp:""},{cp:"撞球",z:"",c:"其他",sp:""},{cp:"保齡球",z:"",c:"其他",sp:""},{cp:"飛鏢",z:"",c:"其他",sp:""},{cp:"復古遊戲",z:"",c:"其他",sp:""},{cp:"Lifestyle  brand",z:"Nike 球鞋",c:"其他",sp:""},{cp:"Accounting",z:"會計學",c:"商業",sp:""},{cp:"財務會計",z:"",c:"商業",sp:""},{cp:"Wealth management",z:"財富管理",c:"金融",sp:"rich"},{cp:"Beauty",z:"美容沙龍",c:"時尚美妝",sp:""},{cp:"簡餐館",z:"",c:"美食",sp:""},{cp:"婚姻",z:"",c:"旅遊生活",sp:""},{cp:"起步房",z:"",c:"房地產興趣",sp:""},{cp:"由擁有者出售",z:"",c:"房地產興趣",sp:""},{cp:"家用遊戲機",z:"",c:"其他",sp:""},{cp:"Pet",z:"寵物",c:"農業自然",sp:""},{cp:"Collectibles",z:"收藏",c:"其他",sp:"rich"},{cp:"嗜好",z:"",c:"旅遊生活",sp:""},{cp:"三維模型",z:"",c:"其他",sp:""},{cp:"比例模型",z:"",c:"其他",sp:""},{cp:"投影機",z:"",c:"科技",sp:""},{cp:"樂器",z:"",c:"其他",sp:""},{cp:"音響設備",z:"",c:"其他",sp:""},{cp:"Gardening",z:"園藝",c:"家居",sp:""},{cp:"廚房器具",z:"",c:"美食",sp:""},{cp:"Cookbook",z:"",c:"娛樂",sp:""},{cp:"Coffee",z:"咖啡機",c:"美食",sp:""},{cp:"Food Network 美食頻道",z:"",c:"科技",sp:""},{cp:"護膚保養",z:"",c:"時尚美妝",sp:""},{cp:"花卉",z:"",c:"農業自然",sp:""},{cp:"學校",z:"",c:"教育",sp:""},{cp:"LifeStyle Food",z:"均衡飲食",c:"時尚美妝",sp:""},{cp:"政府機關概念和作法",z:"",c:"社會",sp:""},{cp:"Household",z:"家庭購物",c:"時尚美妝",sp:""},{cp:"淘寶網",z:"",c:"其他",sp:""},{cp:"天貓",z:"",c:"其他",sp:""},{cp:"Online shopping",z:"網路購物網站",c:"科技",sp:""},{cp:"樂天",z:"",c:"其他",sp:""},{cp:"momo購物網",z:"",c:"其他",sp:""},{cp:"Taiwankou",z:"",c:"其他",sp:""},{cp:"T'Ai-Wan",z:"",c:"其他",sp:""},{cp:"運輸",z:"",c:"交通",sp:""},{cp:"優惠券",z:"",c:"商業",sp:""},{cp:"流行音樂",z:"",c:"娛樂",sp:""},{cp:"熱門話題",z:"",c:"其他",sp:""},{cp:"LINE",z:"",c:"其他",sp:""},{cp:"Socializing",z:"社交網路遊戲",c:"其他",sp:""},{cp:"Wearable technology",z:"穿戴式科技",c:"科技",sp:""},{cp:"Internet of things",z:"物聯網",c:"其他",sp:""},{cp:"Business",z:"商業智慧",c:"金融",sp:""},{cp:"排屋",z:"",c:"其他",sp:""},{cp:"Townhouse",z:"連棟住宅",c:"房地產興趣",sp:"re"},{cp:"Tourist attractions",z:"旅遊景點和活動",c:"旅遊生活",sp:""},{cp:"水果",z:"",c:"美食",sp:""},{cp:"蔬菜",z:"",c:"美食",sp:""},{cp:"草本茶",z:"",c:"其他",sp:""},{cp:"Yoga",z:"瑜珈",c:"其他",sp:""},{cp:"釣魚",z:"",c:"旅遊生活",sp:""},{cp:"公園與遊憩",z:"",c:"其他",sp:""},{cp:"肥皂劇",z:"",c:"娛樂",sp:""},{cp:"街頭時尚",z:"",c:"時尚美妝",sp:""},{cp:"趣味",z:"",c:"旅遊生活",sp:""},{cp:"綜藝節目",z:"",c:"娛樂",sp:""},{cp:"真人實境秀",z:"",c:"娛樂",sp:""},{cp:"Music",z:"音樂節",c:"旅遊生活",sp:""},{cp:"幽默",z:"",c:"其他",sp:""},{cp:"首映",z:"",c:"其他",sp:""},{cp:"演唱會",z:"",c:"娛樂",sp:""},{cp:"新浪潮",z:"",c:"其他",sp:""},{cp:"自由潛水",z:"",c:"其他",sp:""},{cp:"水肺潛水",z:"",c:"其他",sp:""},{cp:"浮潛",z:"",c:"其他",sp:""},{cp:"游泳和水上運動裝備",z:"",c:"健康運動",sp:""},{cp:"Diving equipment",z:"",c:"其他",sp:""},{cp:"Garmin Fitness",z:"",c:"其他",sp:""},{cp:"運動服裝",z:"",c:"健康運動",sp:""},{cp:"天氣",z:"",c:"其他",sp:""},{cp:"個人護理",z:"",c:"時尚美妝",sp:""},{cp:"古着",z:"",c:"其他",sp:""},{cp:"復古衣著",z:"",c:"時尚美妝",sp:""},{cp:"底片",z:"",c:"其他",sp:""},{cp:"雜貨店",z:"",c:"美食",sp:""},{cp:"傳統",z:"",c:"其他",sp:""},{cp:"相片",z:"",c:"娛樂",sp:""},{cp:"糕點",z:"",c:"美食",sp:""},{cp:"小吃",z:"",c:"其他",sp:""},{cp:"街機",z:"",c:"其他",sp:""},{cp:"老爺車",z:"",c:"其他",sp:""},{cp:"街邊小吃",z:"",c:"美食",sp:""},{cp:"情感",z:"",c:"健康運動",sp:""},{cp:"在地美食",z:"",c:"美食",sp:""},{cp:"派對",z:"",c:"旅遊生活",sp:""},{cp:"禮物",z:"",c:"社會",sp:""},{cp:"禮品店",z:"",c:"其他",sp:""},{cp:"香水",z:"",c:"時尚美妝",sp:""},{cp:"快樂",z:"",c:"其他",sp:""},{cp:"寵愛自己",z:"",c:"健康運動",sp:""},{cp:"一般工藝部落格和網站",z:"",c:"科技",sp:""},{cp:"氛圍音樂",z:"",c:"其他",sp:""},{cp:"LifeStyle Home",z:"一般生活風格內容",c:"旅遊生活",sp:""},{cp:"酒吧",z:"",c:"其他",sp:""},{cp:"俱樂部與夜生活）",z:"",c:"其他",sp:""},{cp:"跨年日",z:"",c:"其他",sp:""},{cp:"Woodworking",z:"木工",c:"娛樂",sp:""},{cp:"裝飾藝術",z:"",c:"娛樂",sp:""},{cp:"美學",z:"",c:"社會",sp:""},{cp:"百葉簾",z:"",c:"其他",sp:""},{cp:"Luxury",z:"精品",c:"商業",sp:"rich"},{cp:"Private banking",z:"私人銀行服務",c:"其他",sp:"rich"},{cp:"感情狀況：已婚",z:"",c:"其他",sp:""},{cp:"PlayStation VR",z:"",c:"其他",sp:""},{cp:"擴增實境",z:"",c:"其他",sp:""},{cp:"Innovation",z:"創新科技",c:"其他",sp:""},{cp:"Fashion",z:"時尚",c:"娛樂",sp:""},{cp:"綜合娛樂電視頻道",z:"",c:"科技",sp:""},{cp:"ubereat",z:"迷因和社群媒體貼文分享論壇",c:"科技",sp:""},{cp:"Mental health",z:"身心健康",c:"時尚美妝",sp:""},{cp:"保健內容",z:"",c:"時尚美妝",sp:""},{cp:"突發新聞",z:"",c:"娛樂",sp:""},{cp:"體育博彩",z:"",c:"娛樂",sp:""},{cp:"賭場",z:"",c:"娛樂",sp:""},{cp:"吃角子老虎機",z:"",c:"娛樂",sp:""},{cp:"線上撲克",z:"",c:"娛樂",sp:""},{cp:"輪盤",z:"",c:"娛樂",sp:""},{cp:"21 點",z:"",c:"娛樂",sp:""},{cp:"博奕",z:"",c:"娛樂",sp:""},{cp:"彩券",z:"",c:"娛樂",sp:""},{cp:"紙牌遊戲",z:"",c:"娛樂",sp:""},{cp:"博彩公司",z:"",c:"娛樂",sp:""},{cp:"行動博弈",z:"",c:"娛樂",sp:""},{cp:"網路遊戲",z:"",c:"娛樂",sp:""},{cp:"甜點",z:"",c:"美食",sp:""},{cp:"烘培坊",z:"",c:"美食",sp:""},{cp:"娛樂網站",z:"",c:"科技",sp:""},{cp:"First-time home buyer",z:"首次購房者",c:"房地產興趣",sp:"re"},{cp:"美髮產品",z:"",c:"時尚美妝",sp:""},{cp:"護髮",z:"",c:"時尚美妝",sp:""},{cp:"染髮",z:"",c:"時尚美妝",sp:""},{cp:"水療",z:"",c:"時尚美妝",sp:""},{cp:"長髮",z:"",c:"時尚美妝",sp:""},{cp:"Keratin",z:"角蛋白",c:"其他",sp:""},{cp:"指甲彩繪",z:"",c:"時尚美妝",sp:""},{cp:"人造指甲",z:"",c:"時尚美妝",sp:""},{cp:"假睫毛",z:"",c:"時尚美妝",sp:""},{cp:"美甲沙龍",z:"",c:"時尚美妝",sp:""},{cp:"髮型",z:"",c:"時尚美妝",sp:""},{cp:"Pets at Home",z:"",c:"農業自然",sp:""},{cp:"狗狗公園",z:"",c:"旅遊生活",sp:""},{cp:"Pet",z:"寵物保險",c:"其他",sp:""},{cp:"Dog walking",z:"遛狗",c:"其他",sp:""},{cp:"犬隻健康",z:"",c:"農業自然",sp:""},{cp:"獸醫",z:"",c:"其他",sp:""},{cp:"Dog grooming",z:"狗狗美容",c:"農業自然",sp:""},{cp:"狗用玩具",z:"",c:"農業自然",sp:""},{cp:"進口",z:"",c:"商業",sp:""},{cp:"供應鏈管理",z:"",c:"商業",sp:""},{cp:"商用車輛",z:"",c:"其他",sp:""},{cp:"卡車",z:"",c:"交通",sp:""},{cp:"Uber",z:"",c:"商業",sp:""},{cp:"駕駛",z:"",c:"交通",sp:""},{cp:"UberEATS",z:"",c:"其他",sp:""},{cp:"線上訂餐",z:"",c:"美食",sp:""},{cp:"外賣店",z:"",c:"美食",sp:""},{cp:"速食",z:"",c:"美食",sp:""},{cp:"個人發展",z:"",c:"其他",sp:""},{cp:"Vocational education",z:"職業教育",c:"教育",sp:""},{cp:"國際新聞",z:"",c:"娛樂",sp:""},{cp:"Education",z:"教育新聞",c:"教育",sp:""},{cp:"Professional development",z:"專業發展",c:"商業",sp:""},{cp:"兒童",z:"",c:"教育",sp:""},{cp:"幼兒園",z:"",c:"教育",sp:""},{cp:"兒童發展",z:"",c:"教育",sp:""},{cp:"兒童安全座椅",z:"",c:"交通",sp:""},{cp:"幫寶適",z:"",c:"教育",sp:""},{cp:"Huggies 好奇",z:"",c:"教育",sp:""},{cp:"新生兒派對",z:"",c:"教育",sp:""},{cp:"說故事",z:"",c:"社會",sp:""},{cp:"嬌生嬰兒",z:"",c:"時尚美妝",sp:""},{cp:"購物中心",z:"",c:"商業",sp:""},{cp:"三越百貨",z:"",c:"其他",sp:""},{cp:"Window shutter",z:"",c:"其他",sp:""},{cp:"古馳",z:"",c:"時尚美妝",sp:""},{cp:"路易威登",z:"",c:"時尚美妝",sp:""},{cp:"愛馬仕",z:"",c:"時尚美妝",sp:""},{cp:"凡賽斯",z:"",c:"時尚美妝",sp:""},{cp:"寶格麗",z:"",c:"其他",sp:""},{cp:"Cartier",z:"",c:"其他",sp:""},{cp:"勞力士",z:"",c:"時尚美妝",sp:""},{cp:"Sports car",z:"跑車",c:"交通",sp:""},{cp:"Land Rover",z:"",c:"交通",sp:""},{cp:"保時捷",z:"",c:"其他",sp:""},{cp:"賓士",z:"",c:"交通",sp:""},{cp:"Affiliate marketing",z:"聯盟行銷",c:"商業",sp:""},{cp:"資料分析",z:"",c:"金融",sp:""},{cp:"資料視覺化",z:"",c:"科技",sp:""},{cp:"預測分析",z:"",c:"其他",sp:""},{cp:"Business analysis",z:"",c:"其他",sp:""},{cp:"資料庫",z:"",c:"科技",sp:""},{cp:"商學院",z:"",c:"教育",sp:""},{cp:"Cloud computing",z:"雲端運算",c:"科技",sp:"tech"},{cp:"Machine learning",z:"機器學習",c:"科技",sp:"tech"},{cp:"SQL",z:"",c:"其他",sp:""},{cp:"Python",z:"",c:"其他",sp:""},{cp:"Microsoft Excel",z:"",c:"其他",sp:""},{cp:"C++",z:"",c:"其他",sp:""},{cp:"Digital Trends",z:"",c:"娛樂",sp:""},{cp:"電腦安全",z:"",c:"科技",sp:""},{cp:"Cybersecurity",z:"資訊安全",c:"科技",sp:"tech"},{cp:"網路隱私",z:"",c:"其他",sp:""},{cp:"台灣電視劇",z:"",c:"其他",sp:""},{cp:"付費電視",z:"",c:"其他",sp:""},{cp:"影片剪輯軟體",z:"",c:"其他",sp:""},{cp:"剪輯",z:"",c:"其他",sp:""},{cp:"Instagram",z:"",c:"科技",sp:"young"},{cp:"Facebook",z:"",c:"科技",sp:""},{cp:"領導",z:"",c:"社會",sp:""},{cp:"影片製作",z:"",c:"娛樂",sp:""},{cp:"徵才",z:"",c:"商業",sp:""},{cp:"網路名人",z:"",c:"其他",sp:""},{cp:"自我意識",z:"",c:"健康運動",sp:""},{cp:"節慶",z:"",c:"旅遊生活",sp:""},{cp:"自我認知",z:"",c:"健康運動",sp:""},{cp:"Psychology",z:"心理學",c:"科技",sp:""},{cp:"心理",z:"",c:"其他",sp:""},{cp:"機能）",z:"",c:"其他",sp:""},{cp:"生活",z:"",c:"其他",sp:""},{cp:"心理勵志",z:"",c:"健康運動",sp:""},{cp:"運氣",z:"",c:"其他",sp:""},{cp:"冥想",z:"",c:"社會",sp:""},{cp:"占星術",z:"",c:"其他",sp:""},{cp:"獨立式洋房",z:"",c:"房地產興趣",sp:""},{cp:"別墅",z:"",c:"旅遊生活",sp:""},{cp:"首次購屋補助",z:"",c:"房地產興趣",sp:""},{cp:"頂層公寓",z:"",c:"房地產興趣",sp:""},{cp:"Investment club",z:"房地產投資俱樂部",c:"其他",sp:"re"},{cp:"創意房地產投資",z:"",c:"房地產興趣",sp:""},{cp:"Investment club",z:"房地產投資俱樂部",c:"金融",sp:"re"},{cp:"Real estate developer",z:"房地產開發商",c:"房地產興趣",sp:"re"},{cp:"小吃店",z:"",c:"其他",sp:""},{cp:"早午餐",z:"",c:"美食",sp:""},{cp:"飲用水",z:"",c:"美食",sp:""},{cp:"Business model",z:"商業模式",c:"金融",sp:""},{cp:"衛生政策研究",z:"",c:"其他",sp:""},{cp:"轎車",z:"",c:"交通",sp:""},{cp:"配送",z:"",c:"其他",sp:""},{cp:"Medical education",z:"",c:"其他",sp:""},{cp:"學生會",z:"",c:"其他",sp:""},{cp:"Music",z:"音樂廣播",c:"其他",sp:""},{cp:"慢跑",z:"",c:"其他",sp:""},{cp:"Podcast",z:"",c:"娛樂",sp:"young"},{cp:"機器人",z:"",c:"其他",sp:""},{cp:"工程",z:"",c:"科技",sp:""},{cp:"Semiconductor",z:"半導體",c:"其他",sp:""},{cp:"直銷",z:"",c:"其他",sp:""},{cp:"Influencer marketing",z:"網紅行銷",c:"商業",sp:""},{cp:"自行組裝家具",z:"",c:"家居",sp:""},{cp:"自由工作者",z:"",c:"商業",sp:""},{cp:"人力銀行",z:"",c:"商業",sp:""},{cp:"管理",z:"",c:"商業",sp:""},{cp:"餐廳",z:"",c:"美食",sp:""},{cp:"零食",z:"",c:"美食",sp:""},{cp:"辦公室套件",z:"",c:"其他",sp:""},{cp:"Breakfast",z:"早餐",c:"美食",sp:""},{cp:"國姓交流道",z:"",c:"其他",sp:""},{cp:"Cosmetics",z:"化妝品",c:"時尚美妝",sp:""},{cp:"Online banking",z:"網路銀行",c:"金融",sp:""},{cp:"行動應用程式",z:"",c:"科技",sp:""},{cp:"Beer",z:"啤酒",c:"美食",sp:""},{cp:"生物技術",z:"",c:"其他",sp:""},{cp:"生物化學",z:"",c:"其他",sp:""},{cp:"生物學",z:"",c:"科技",sp:""},{cp:"程式語言",z:"",c:"科技",sp:""},{cp:"網站開發",z:"",c:"科技",sp:""},{cp:"軟體開發",z:"",c:"科技",sp:""},{cp:"電腦程式設計",z:"",c:"科技",sp:""},{cp:"跟團旅行",z:"",c:"旅遊生活",sp:""},{cp:"海灘",z:"",c:"旅遊生活",sp:""},{cp:"度假村",z:"",c:"旅遊生活",sp:""},{cp:"遊程承攬業",z:"",c:"其他",sp:""},{cp:"名人",z:"",c:"娛樂",sp:""},{cp:"攜程旅行網",z:"",c:"其他",sp:""},{cp:"自然",z:"",c:"其他",sp:""},{cp:"科學",z:"",c:"其他",sp:""},{cp:"Public administration",z:"市政事務",c:"社會",sp:"civil"},{cp:"餐點",z:"",c:"美食",sp:""},{cp:"Distance education",z:"遠距教學",c:"教育",sp:""},{cp:"證券交易所",z:"",c:"金融",sp:""},{cp:"專業學位",z:"",c:"其他",sp:""},{cp:"博士學位",z:"",c:"其他",sp:""},{cp:"自訂車款",z:"",c:"交通",sp:""},{cp:"洗車",z:"",c:"交通",sp:""},{cp:"零部件市場",z:"",c:"其他",sp:""},{cp:"鍍膜",z:"",c:"其他",sp:""},{cp:"倍耐力",z:"",c:"其他",sp:""},{cp:"電玩遊戲",z:"",c:"娛樂",sp:""},{cp:"手機遊戲",z:"",c:"娛樂",sp:""},{cp:"英雄聯盟",z:"",c:"娛樂",sp:""},{cp:"童裝",z:"",c:"時尚美妝",sp:""},{cp:"Chicco",z:"",c:"其他",sp:""},{cp:"玩具",z:"",c:"教育",sp:""},{cp:"Educational toys",z:"益智玩具",c:"教育",sp:""},{cp:"婚禮網站和部落格",z:"",c:"科技",sp:""},{cp:"嬰兒",z:"",c:"教育",sp:""},{cp:"衛生學",z:"",c:"其他",sp:""},{cp:"能量飲料",z:"",c:"美食",sp:""},{cp:"EToro",z:"",c:"其他",sp:""},{cp:"Exchange-traded fund",z:"指數股票型基金",c:"金融",sp:""},{cp:"納斯達克100指數",z:"",c:"其他",sp:""},{cp:"道瓊斯工業平均指數",z:"",c:"其他",sp:""},{cp:"標準普爾500指數",z:"",c:"其他",sp:""},{cp:"Doctor of Medicine",z:"",c:"其他",sp:""},{cp:"Medical Doctor",z:"",c:"其他",sp:""},{cp:"博雅教育",z:"",c:"其他",sp:""},{cp:"師範教育",z:"",c:"商業",sp:""},{cp:"公共圖書館",z:"",c:"其他",sp:""},{cp:"肌力訓練",z:"",c:"健康運動",sp:""},{cp:"有氧運動",z:"",c:"健康運動",sp:""},{cp:"Protein",z:"蛋白質",c:"科技",sp:""},{cp:"Running",z:"跑步俱樂部",c:"旅遊生活",sp:""},{cp:"運動場所",z:"",c:"健康運動",sp:""},{cp:"WordPress",z:"",c:"其他",sp:""},{cp:"服飾品牌和零售商",z:"",c:"商業",sp:""},{cp:"極簡主義",z:"",c:"其他",sp:""},{cp:"市場趨勢",z:"",c:"金融",sp:""},{cp:"電腦科學",z:"",c:"科技",sp:""},{cp:"Film",z:"電影院",c:"娛樂",sp:""},{cp:"化學工程",z:"",c:"其他",sp:""},{cp:"化學化工新聞",z:"",c:"其他",sp:""},{cp:"Software engineering",z:"軟體工程",c:"科技",sp:"tech"},{cp:"Esports",z:"電競聯盟和競賽",c:"健康運動",sp:"young"},{cp:"直效營銷",z:"",c:"其他",sp:""},{cp:"YCM 永進機械 Yeong Chin Machinery Industries Co.",z:"",c:"其他",sp:""},{cp:"快時尚",z:"",c:"時尚美妝",sp:""},{cp:"Spotify",z:"",c:"娛樂",sp:"young"},{cp:"整建",z:"",c:"房地產興趣",sp:""},{cp:"技術分析",z:"",c:"金融",sp:""},{cp:"護膚品牌",z:"",c:"時尚美妝",sp:""},{cp:"Technology brands",z:"科技品牌",c:"科技",sp:""},{cp:"Video game",z:"遊戲",c:"旅遊生活",sp:"young"},{cp:"暑假",z:"",c:"教育",sp:""},{cp:"草地",z:"",c:"家居",sp:""},{cp:"貓糧",z:"",c:"農業自然",sp:""},{cp:"食品和飲品",z:"",c:"美食",sp:""},{cp:"美甲",z:"",c:"時尚美妝",sp:""},{cp:"足部護理",z:"",c:"時尚美妝",sp:""},{cp:"律師",z:"",c:"其他",sp:""},{cp:"律師事務所",z:"",c:"其他",sp:""},{cp:"公司",z:"",c:"商業",sp:""},{cp:"法律",z:"",c:"其他",sp:""},{cp:"視覺藝術",z:"",c:"娛樂",sp:""},{cp:"Art",z:"藝術和音樂",c:"娛樂",sp:""},{cp:"福斯汽車",z:"",c:"交通",sp:""},{cp:"金屬",z:"",c:"其他",sp:""},{cp:"玻璃",z:"",c:"其他",sp:""},{cp:"奧迪",z:"",c:"交通",sp:""},{cp:"廣告代理商",z:"",c:"商業",sp:""},{cp:"Lead generation",z:"開發潛在顧客",c:"商業",sp:""},{cp:"Google AdWords",z:"",c:"其他",sp:""},{cp:"搜尋引擎行銷",z:"",c:"商業",sp:""},{cp:"工業設計",z:"",c:"其他",sp:""},{cp:"產品設計",z:"",c:"商業",sp:""},{cp:"業務過程",z:"",c:"其他",sp:""},{cp:"炸雞",z:"",c:"美食",sp:""},{cp:"MBA",z:"行動銀行",c:"金融",sp:""},{cp:"麥當勞",z:"",c:"美食",sp:""},{cp:"燒烤",z:"",c:"美食",sp:""},{cp:"居家飾品",z:"",c:"家居",sp:""},{cp:"學生",z:"",c:"教育",sp:""},{cp:"麻將",z:"",c:"其他",sp:""},{cp:"大學畢業年分：2017-2028",z:"",c:"其他",sp:""},{cp:"貓砂",z:"",c:"農業自然",sp:""},{cp:"Java",z:"",c:"其他",sp:""},{cp:"C語言",z:"",c:"其他",sp:""},{cp:"GitHub",z:"",c:"其他",sp:"tech"},{cp:"電腦伺服器",z:"",c:"科技",sp:""},{cp:"Stack Overflow",z:"",c:"其他",sp:"tech"},{cp:"婚禮教堂",z:"",c:"旅遊生活",sp:""},{cp:"婚禮歌手",z:"",c:"其他",sp:""},{cp:"婚宴",z:"",c:"旅遊生活",sp:""},{cp:"喜帖",z:"",c:"旅遊生活",sp:""},{cp:"結婚蛋糕",z:"",c:"旅遊生活",sp:""},{cp:"婚紗攝影",z:"",c:"娛樂",sp:""},{cp:"訂婚戒指",z:"",c:"其他",sp:""},{cp:"戒指",z:"",c:"其他",sp:""},{cp:"婚禮攝影",z:"",c:"旅遊生活",sp:""},{cp:"婚戒",z:"",c:"旅遊生活",sp:""},{cp:"iPhone",z:"",c:"科技",sp:""},{cp:"Language education",z:"語言教育",c:"其他",sp:""},{cp:"政治",z:"",c:"社會",sp:""},{cp:"政策",z:"",c:"其他",sp:""},{cp:"肉類食物",z:"",c:"美食",sp:""},{cp:"網紅創作者",z:"",c:"其他",sp:""},{cp:"Gardening",z:"園藝",c:"農業自然",sp:""},{cp:"農作物",z:"",c:"農業自然",sp:""},{cp:"農村",z:"",c:"其他",sp:""},{cp:"銀行帳戶",z:"",c:"金融",sp:""},{cp:"觀賞植物",z:"",c:"農業自然",sp:""},{cp:"Nutrition",z:"營養素",c:"其他",sp:""},{cp:"退休基金",z:"",c:"金融",sp:""},{cp:"退休年齡",z:"",c:"商業",sp:""},{cp:"眉毛",z:"",c:"其他",sp:""},{cp:"Collagen",z:"膠原蛋白",c:"科技",sp:""},{cp:"法律分支",z:"",c:"社會",sp:""},{cp:"以英語為第二語言",z:"",c:"其他",sp:""},{cp:"外語",z:"",c:"其他",sp:""},{cp:"折扣商店",z:"",c:"商業",sp:""},{cp:"韓國電視劇",z:"",c:"娛樂",sp:""},{cp:"行政服務",z:"",c:"其他",sp:""},{cp:"雅高達",z:"",c:"其他",sp:""},{cp:"Parenting styles",z:"教養方式",c:"教育",sp:""},{cp:"生命",z:"",c:"其他",sp:""},{cp:"物理及社會科學",z:"",c:"其他",sp:""},{cp:"Kitchen appliances",z:"廚房家電",c:"家居",sp:""},{cp:"主題樂園",z:"",c:"旅遊生活",sp:""},{cp:"樂高",z:"",c:"教育",sp:""},{cp:"運動類遊戲",z:"",c:"娛樂",sp:""},{cp:"愛奇藝",z:"",c:"其他",sp:""},{cp:"遊樂場",z:"",c:"其他",sp:""},{cp:"籃球",z:"",c:"健康運動",sp:""},{cp:"工作坊",z:"",c:"商業",sp:""},{cp:"職涯和就業",z:"",c:"商業",sp:""},{cp:"網路雜貨商",z:"",c:"美食",sp:""},{cp:"急凍食品",z:"",c:"其他",sp:""},{cp:"Healthy cooking",z:"食品媒體和內容",c:"美食",sp:""},{cp:"去角質",z:"",c:"時尚美妝",sp:""},{cp:"責任保險",z:"",c:"其他",sp:""},{cp:"零售銀行業務",z:"",c:"金融",sp:""},{cp:"英語",z:"",c:"其他",sp:""},{cp:"影片部落格",z:"",c:"科技",sp:""},{cp:"Instagram 商業檔案管理員",z:"",c:"其他",sp:"young"},{cp:"零售類粉絲專頁管理員",z:"",c:"其他",sp:""},{cp:"商家的粉絲專頁管理員",z:"",c:"其他",sp:""},{cp:"Facebook 粉絲專頁管理員",z:"",c:"其他",sp:""},{cp:"運動類粉絲專頁管理員",z:"",c:"其他",sp:""},{cp:"下午茶",z:"",c:"其他",sp:""},{cp:"速食休閒餐廳",z:"",c:"美食",sp:""},{cp:"品牌",z:"",c:"商業",sp:""},{cp:"網路聊天",z:"",c:"其他",sp:""},{cp:"即時通訊",z:"",c:"其他",sp:""},{cp:"輪班工作制",z:"",c:"商業",sp:""},{cp:"手錶",z:"",c:"時尚美妝",sp:""},{cp:"中學",z:"",c:"教育",sp:""},{cp:"高中",z:"",c:"教育",sp:""},{cp:"母親",z:"",c:"教育",sp:""},{cp:"父親",z:"",c:"教育",sp:""},{cp:"動漫電影",z:"",c:"娛樂",sp:""},{cp:"顧客關係管理",z:"",c:"其他",sp:""},{cp:"Risk management",z:"風險管理",c:"其他",sp:""},{cp:"Project management",z:"專案管理",c:"商業",sp:""},{cp:"餐酒",z:"",c:"其他",sp:""},{cp:"Places",z:"地點",c:"旅遊生活",sp:""},{cp:"文具",z:"",c:"其他",sp:""},{cp:"徵才網站",z:"",c:"商業",sp:""},{cp:"工作",z:"",c:"商業",sp:""},{cp:"存款帳戶",z:"",c:"金融",sp:""},{cp:"儲蓄互助社",z:"",c:"其他",sp:""},{cp:"信用額度",z:"",c:"金融",sp:""},{cp:"美術",z:"",c:"娛樂",sp:""},{cp:"共同基金",z:"",c:"金融",sp:""},{cp:"House",z:"房屋保險",c:"金融",sp:""},{cp:"Gourmet",z:"美食家",c:"美食",sp:"rich"},{cp:"Food",z:"美食與美酒",c:"娛樂",sp:""},{cp:"Wine tasting",z:"品酒",c:"美食",sp:"rich"},{cp:"Team sports",z:"球類運動",c:"健康運動",sp:""},{cp:"NBA 總決賽",z:"",c:"其他",sp:""},{cp:"Apple Music",z:"",c:"其他",sp:""},{cp:"基本英語",z:"",c:"其他",sp:""},{cp:"電動機車",z:"",c:"其他",sp:""},{cp:"Motorcycle",z:"摩托車",c:"交通",sp:""},{cp:"童年",z:"",c:"教育",sp:""},{cp:"機車",z:"",c:"交通",sp:""},{cp:"Laptop",z:"筆記型電腦",c:"科技",sp:""},{cp:"文學",z:"",c:"娛樂",sp:""},{cp:"工程和理工學院",z:"",c:"教育",sp:""},{cp:"理工學院",z:"",c:"其他",sp:""},{cp:"金融分析",z:"",c:"其他",sp:""},{cp:"崇光百貨",z:"",c:"其他",sp:""},{cp:"表演藝術",z:"",c:"娛樂",sp:""},{cp:"網站代管",z:"",c:"科技",sp:""},{cp:"網路儲存",z:"",c:"科技",sp:""},{cp:"獸醫學",z:"",c:"農業自然",sp:""},{cp:"語言",z:"",c:"其他",sp:""},{cp:"信貸",z:"",c:"金融",sp:""},{cp:"畜牧業",z:"",c:"農業自然",sp:""},{cp:"肥料",z:"",c:"農業自然",sp:""},{cp:"農學",z:"",c:"其他",sp:""},{cp:"灌溉",z:"",c:"其他",sp:""},{cp:"一般保險",z:"",c:"金融",sp:""},{cp:"Panasonic",z:"",c:"其他",sp:""},{cp:"犬隻訓練",z:"",c:"農業自然",sp:""},{cp:"貓咪玩具和遊戲",z:"",c:"其他",sp:""},{cp:"舞蹈",z:"",c:"娛樂",sp:""},{cp:"速食餐廳",z:"",c:"美食",sp:""},{cp:"Photography",z:"攝影",c:"娛樂",sp:""},{cp:"嘻哈音樂",z:"",c:"娛樂",sp:""},{cp:"韓國流行音樂",z:"",c:"娛樂",sp:""},{cp:"經濟學",z:"",c:"金融",sp:""},{cp:"註冊會計師",z:"",c:"其他",sp:""},{cp:"私募基金",z:"",c:"其他",sp:""},{cp:"Private equity",z:"私募股權投資",c:"金融",sp:"rich"},{cp:"電腦運算",z:"",c:"其他",sp:""},{cp:"指數基金",z:"",c:"金融",sp:""},{cp:"運動鞋收藏",z:"",c:"其他",sp:""},{cp:"研究所",z:"",c:"教育",sp:""},{cp:"風險投資",z:"",c:"金融",sp:""},{cp:"Angel investing",z:"天使投資人",c:"金融",sp:"rich"},{cp:"Electric vehicle",z:"電動車",c:"交通",sp:""},{cp:"Online advertising",z:"網路廣告",c:"商業",sp:""},{cp:"銷售時點情報系統",z:"",c:"其他",sp:""},{cp:"配電系統",z:"",c:"其他",sp:""},{cp:"佳能企業",z:"",c:"其他",sp:""},{cp:"代工生產",z:"",c:"其他",sp:""},{cp:"BMW",z:"",c:"交通",sp:""},{cp:"特斯拉汽車",z:"",c:"交通",sp:""},{cp:"Automobile",z:"汽車經銷",c:"商業",sp:""},{cp:"改裝高速汽車",z:"",c:"其他",sp:""},{cp:"國際學校",z:"",c:"教育",sp:""},{cp:"游泳",z:"",c:"健康運動",sp:""},{cp:"資料管理",z:"",c:"科技",sp:""},{cp:"賽車",z:"",c:"健康運動",sp:""},{cp:"潛水",z:"",c:"其他",sp:""},{cp:"刺青",z:"",c:"時尚美妝",sp:""},{cp:"Extreme sports",z:"極限運動",c:"健康運動",sp:""},{cp:"文化遺產",z:"",c:"娛樂",sp:""},{cp:"文化歷史",z:"",c:"娛樂",sp:""},{cp:"歷史",z:"",c:"其他",sp:""},{cp:"火鍋",z:"",c:"其他",sp:""},{cp:"漫威娛樂",z:"",c:"娛樂",sp:""},{cp:"暢銷書",z:"",c:"其他",sp:""},{cp:"油電混合車",z:"",c:"交通",sp:""},{cp:"有機農業",z:"",c:"農業自然",sp:""},{cp:"資料安全",z:"",c:"科技",sp:""},{cp:"雕刻",z:"",c:"娛樂",sp:""},{cp:"B2B",z:"",c:"商業",sp:""},{cp:"知識",z:"",c:"其他",sp:""},{cp:"Extracurricular activities",z:"課外活動",c:"其他",sp:""},{cp:"低成本航空公司",z:"",c:"其他",sp:""},{cp:"鍵盤樂器",z:"",c:"其他",sp:""},{cp:"弦樂器",z:"",c:"其他",sp:""},{cp:"古典樂",z:"",c:"娛樂",sp:""},{cp:"當代古典音樂",z:"",c:"其他",sp:""},{cp:"桌球",z:"",c:"其他",sp:""},{cp:"田徑",z:"",c:"其他",sp:""},{cp:"Hot R&B/Hip-Hop Songs",z:"",c:"其他",sp:""},{cp:"培訓和開發",z:"",c:"商業",sp:""},{cp:"Life insurance",z:"人壽保險",c:"金融",sp:"civil"},{cp:"業務",z:"",c:"商業",sp:""},{cp:"電子商務網站",z:"",c:"科技",sp:""},{cp:"運動俱樂部",z:"",c:"旅遊生活",sp:""},{cp:"Tabletop games",z:"桌上遊戲",c:"娛樂",sp:""},{cp:"Live events",z:"現場活動",c:"旅遊生活",sp:""},{cp:"Innovation",z:"創新",c:"商業",sp:""},{cp:"社會政策",z:"",c:"其他",sp:""},{cp:"政治經濟學",z:"",c:"其他",sp:""},{cp:"課程",z:"",c:"教育",sp:""},{cp:"防曬乳",z:"",c:"其他",sp:""},{cp:"育嬰假",z:"",c:"教育",sp:""},{cp:"電信服務",z:"",c:"科技",sp:""},{cp:"韓式料理",z:"",c:"美食",sp:""},{cp:"壽司",z:"",c:"美食",sp:""},{cp:"鮭魚",z:"",c:"其他",sp:""},{cp:"燒牛肉",z:"",c:"其他",sp:""},{cp:"Golf",z:"高爾夫球場",c:"旅遊生活",sp:"rich"},{cp:"教練輔導",z:"",c:"教育",sp:""},{cp:"BMW i",z:"",c:"其他",sp:""},{cp:"特斯拉S型",z:"",c:"其他",sp:""},{cp:"高級訂製時裝",z:"",c:"時尚美妝",sp:""},{cp:"石油",z:"",c:"其他",sp:""},{cp:"香奈兒",z:"",c:"時尚美妝",sp:""},{cp:"公共關係",z:"",c:"其他",sp:""},{cp:"襯衫",z:"",c:"時尚美妝",sp:""},{cp:"類似廣告受眾",z:"",c:"其他",sp:""},{cp:"台灣菜",z:"",c:"其他",sp:""},{cp:"銀行和金融服務",z:"",c:"金融",sp:""},{cp:"保全",z:"",c:"其他",sp:""},{cp:"碩士學位",z:"",c:"教育",sp:""},{cp:"寫作",z:"",c:"娛樂",sp:""},{cp:"黃金",z:"",c:"科技",sp:""},{cp:"LG電子",z:"",c:"其他",sp:""},{cp:"591房屋交易網",z:"",c:"科技",sp:""},{cp:"日立",z:"",c:"其他",sp:""},{cp:"Consumer electronics",z:"消費電子產品零售商",c:"商業",sp:"tech"},{cp:"BMW 5系列",z:"",c:"其他",sp:""},{cp:"梅賽德斯-賓士S級",z:"",c:"其他",sp:""},{cp:"Guess",z:"",c:"時尚美妝",sp:""},{cp:"Apple Pay",z:"",c:"其他",sp:""},{cp:"女性企業家",z:"",c:"商業",sp:""},{cp:"窗戶",z:"",c:"房地產興趣",sp:""},{cp:"Lifestyle",z:"生活風格",c:"旅遊生活",sp:""},{cp:"Household",z:"居家用品零售商",c:"商業",sp:""},{cp:"LifeStyle Home",z:"生",c:"其他",sp:""},{cp:"室內建築",z:"",c:"房地產興趣",sp:""},{cp:"Home renovation",z:"住家翻新",c:"家居",sp:"re"},{cp:"Architecture & Interior Design",z:"",c:"其他",sp:""},{cp:"計程車司機",z:"",c:"其他",sp:""},{cp:"兼職",z:"",c:"商業",sp:""},{cp:"Customer support",z:"客",c:"其他",sp:""},{cp:"出租車",z:"",c:"其他",sp:""},{cp:"棒球",z:"",c:"健康運動",sp:""},{cp:"NBA季後賽",z:"",c:"其他",sp:""},{cp:"Google電子錢包",z:"",c:"其他",sp:""},{cp:"http://geek.com/",z:"",c:"其他",sp:"tech"},{cp:"重量訓練",z:"",c:"健康運動",sp:""},{cp:"雞肉",z:"",c:"美食",sp:""},{cp:"羅技",z:"",c:"其他",sp:""},{cp:"Razer",z:"",c:"其他",sp:""},{cp:"生命科學",z:"",c:"其他",sp:""},{cp:"生命延續",z:"",c:"其他",sp:""},{cp:"法院",z:"",c:"其他",sp:""},{cp:"Bottega Veneta",z:"",c:"其他",sp:""},{cp:"Giorgio Armani Beauty",z:"",c:"其他",sp:""},{cp:"傑尼亞",z:"",c:"其他",sp:""},{cp:"航空旅行",z:"",c:"交通",sp:""},{cp:"航空",z:"",c:"旅遊生活",sp:""},{cp:"行李",z:"",c:"交通",sp:""},{cp:"航空太空工程",z:"",c:"其他",sp:""},{cp:"餐具",z:"",c:"其他",sp:""},{cp:"選擇權",z:"",c:"金融",sp:""},{cp:"MetaTrader 4",z:"",c:"其他",sp:""},{cp:"電子交易",z:"",c:"金融",sp:""},{cp:"福匯",z:"",c:"其他",sp:""},{cp:"私立學校",z:"",c:"教育",sp:""},{cp:"International education",z:"",c:"其他",sp:""},{cp:"自助餐",z:"",c:"其他",sp:""},{cp:"魚油",z:"",c:"其他",sp:""},{cp:"首飾",z:"",c:"時尚美妝",sp:""},{cp:"西裝",z:"",c:"其他",sp:""},{cp:"正式服裝",z:"",c:"時尚美妝",sp:""},{cp:"資訊",z:"",c:"其他",sp:""},{cp:"科技早期採用者",z:"",c:"其他",sp:""},{cp:"研究領域：資訊工程學系",z:"",c:"其他",sp:""},{cp:"威士忌",z:"",c:"美食",sp:""},{cp:"伏特加",z:"",c:"美食",sp:""},{cp:"簿記",z:"",c:"其他",sp:""},{cp:"包裝和標籤",z:"",c:"商業",sp:""},{cp:"Digital media",z:"數位媒體",c:"科技",sp:""},{cp:"政府員工",z:"",c:"社會",sp:""},{cp:"保護服務",z:"",c:"其他",sp:""},{cp:"財政預算案",z:"",c:"其他",sp:""},{cp:"智慧型手錶",z:"",c:"科技",sp:""},{cp:"系統工程",z:"",c:"科技",sp:""},{cp:"生啤酒",z:"",c:"美食",sp:""},{cp:"牛肉",z:"",c:"美食",sp:""},{cp:"股市指數期貨",z:"",c:"金融",sp:""},{cp:"風力發動機",z:"",c:"其他",sp:""},{cp:"求職",z:"",c:"商業",sp:""},{cp:"時間管理",z:"",c:"其他",sp:""},{cp:"餐飲創作者",z:"",c:"其他",sp:""},{cp:"就業博覽會",z:"",c:"其他",sp:""},{cp:"白酒",z:"",c:"美食",sp:""},{cp:"Business incubator",z:"企業孵化器",c:"其他",sp:""},{cp:"產品",z:"",c:"商業",sp:""},{cp:"小工具",z:"",c:"其他",sp:""},{cp:"Priority Pass",z:"機場貴賓室",c:"其他",sp:"rich"},{cp:"病毒營銷",z:"",c:"其他",sp:""},{cp:"蛋糕",z:"",c:"美食",sp:""},{cp:"肖像攝影",z:"",c:"娛樂",sp:""},{cp:"索尼",z:"",c:"其他",sp:""},{cp:"數位單眼相機",z:"",c:"其他",sp:""},{cp:"娛樂周刊",z:"",c:"其他",sp:""},{cp:"戲劇",z:"",c:"娛樂",sp:""},{cp:"鋼琴",z:"",c:"其他",sp:""},{cp:"桌子",z:"",c:"其他",sp:""},{cp:"椅子",z:"",c:"家居",sp:""},{cp:"寢具",z:"",c:"家居",sp:""},{cp:"劇情片",z:"",c:"娛樂",sp:""},{cp:"烤肉",z:"",c:"美食",sp:""},{cp:"訂婚",z:"",c:"旅遊生活",sp:""},{cp:"冰咖啡",z:"",c:"美食",sp:""},{cp:"百威",z:"",c:"其他",sp:""},{cp:"私人公司",z:"",c:"其他",sp:""},{cp:"麵包",z:"",c:"美食",sp:""},{cp:"Parenting",z:"嬰兒副食品",c:"美食",sp:""},{cp:"嬰兒床",z:"",c:"家居",sp:""},{cp:"保濕霜",z:"",c:"時尚美妝",sp:""},{cp:"天然護膚",z:"",c:"時尚美妝",sp:""},{cp:"面膜",z:"",c:"時尚美妝",sp:""},{cp:"MAC 化妝品",z:"",c:"時尚美妝",sp:""},{cp:"屈臣氏個人護理店",z:"",c:"其他",sp:""},{cp:"Pilates",z:"皮拉提斯",c:"健康運動",sp:""},{cp:"肯德基",z:"",c:"美食",sp:""},{cp:"Subway",z:"",c:"美食",sp:""},{cp:"和牛",z:"",c:"其他",sp:""},{cp:"義大利麵",z:"",c:"美食",sp:""},{cp:"廣告行銷活動",z:"",c:"商業",sp:""},{cp:"Human resource management",z:"人力資源管理",c:"商業",sp:""},{cp:"企業級軟體",z:"",c:"其他",sp:""},{cp:"小型商業軟體",z:"",c:"科技",sp:""},{cp:"泰式料理",z:"",c:"其他",sp:""},{cp:"中型企業對企業企業員工",z:"",c:"其他",sp:""},{cp:"三星電子",z:"",c:"其他",sp:""},{cp:"NVIDIA GeForce",z:"",c:"其他",sp:""},{cp:"LifeStyle Food",z:"輕食",c:"其他",sp:""},{cp:"美國銀行",z:"",c:"金融",sp:""},{cp:"Korean pop idol",z:"",c:"其他",sp:""},{cp:"動畫片",z:"",c:"娛樂",sp:""},{cp:"日漫",z:"",c:"娛樂",sp:""},{cp:"航海王",z:"",c:"娛樂",sp:""},{cp:"七龍珠",z:"",c:"其他",sp:""},{cp:"宮崎駿",z:"",c:"其他",sp:""},{cp:"吉卜力工作室",z:"",c:"其他",sp:""},{cp:"漫畫",z:"",c:"其他",sp:""},{cp:"好萊塢",z:"",c:"其他",sp:""},{cp:"索尼影視娛樂",z:"",c:"其他",sp:""},{cp:"Apple TV",z:"",c:"娛樂",sp:""},{cp:"車輛保險",z:"",c:"金融",sp:""},{cp:"二手車",z:"",c:"交通",sp:""},{cp:"氣泡酒",z:"",c:"美食",sp:""},{cp:"門戶網站",z:"",c:"其他",sp:""},{cp:"搜尋引擎最佳化",z:"",c:"科技",sp:""},{cp:"戰略計劃",z:"",c:"其他",sp:""},{cp:"Business development",z:"業務開發",c:"商業",sp:""},{cp:"價格",z:"",c:"其他",sp:""},{cp:"Yves Saint Laurent",z:"",c:"其他",sp:""},{cp:"蘭蔻",z:"",c:"時尚美妝",sp:""},{cp:"雅詩蘭黛公司",z:"",c:"時尚美妝",sp:""},{cp:"康是美",z:"",c:"其他",sp:""},{cp:"水管修繕",z:"",c:"房地產興趣",sp:""},{cp:"結構工程",z:"",c:"其他",sp:""},{cp:"Woodworking",z:"木工",c:"家居",sp:""},{cp:"節奏藍調音樂",z:"",c:"娛樂",sp:""},{cp:"詩詞",z:"",c:"其他",sp:""},{cp:"劇院",z:"",c:"娛樂",sp:""},{cp:"女裝",z:"",c:"時尚美妝",sp:""},{cp:"男裝",z:"",c:"時尚美妝",sp:""},{cp:"冰淇淋",z:"",c:"美食",sp:""},{cp:"鞋類",z:"",c:"時尚美妝",sp:""},{cp:"大型多人線上遊戲",z:"",c:"娛樂",sp:""},{cp:"PlayStation Store",z:"",c:"其他",sp:""},{cp:"漫威漫畫",z:"",c:"娛樂",sp:""},{cp:"美國疾病控制與預防中心",z:"",c:"其他",sp:""},{cp:"滑雪勝地",z:"",c:"其他",sp:""},{cp:"亞瑟士",z:"",c:"其他",sp:""},{cp:"Lexus 汽車",z:"",c:"交通",sp:""},{cp:"優乃克",z:"",c:"其他",sp:""},{cp:"滑雪",z:"",c:"健康運動",sp:""},{cp:"電腦記憶體",z:"",c:"科技",sp:""},{cp:"網球",z:"",c:"健康運動",sp:""},{cp:"美津濃",z:"",c:"其他",sp:""},{cp:"滑雪板",z:"",c:"健康運動",sp:""},{cp:"PlayStation 4",z:"",c:"其他",sp:""},{cp:"New Balance",z:"",c:"時尚美妝",sp:""},{cp:"Twitter",z:"",c:"科技",sp:""},{cp:"GAP",z:"",c:"時尚美妝",sp:""},{cp:"民俗學",z:"",c:"其他",sp:""},{cp:"古蹟",z:"",c:"其他",sp:""},{cp:"Asian American culture",z:"亞洲文化",c:"社會",sp:""},{cp:"初等教育",z:"",c:"教育",sp:""},{cp:"兒童文學",z:"",c:"娛樂",sp:""},{cp:"繪本",z:"",c:"其他",sp:""},{cp:"印刷",z:"",c:"其他",sp:""},{cp:"真空包裝",z:"",c:"其他",sp:""},{cp:"職涯和工作機會",z:"",c:"商業",sp:""},{cp:"全球資訊網",z:"",c:"其他",sp:""},{cp:"動作遊戲",z:"",c:"娛樂",sp:""},{cp:"投 資",z:"",c:"商業",sp:""},{cp:"產品經理",z:"",c:"其他",sp:""},{cp:"Stretching",z:"伸展",c:"健康運動",sp:""},{cp:"Muscle & Fitness",z:"",c:"娛樂",sp:""},{cp:"休旅車營地",z:"",c:"旅遊生活",sp:""},{cp:"運動鞋",z:"",c:"時尚美妝",sp:""},{cp:"帳篷",z:"",c:"旅遊生活",sp:""},{cp:"戶外裝備和服裝",z:"",c:"時尚美妝",sp:""},{cp:"配送訂單",z:"",c:"商業",sp:""},{cp:"電信業",z:"",c:"科技",sp:""},{cp:"外交政策",z:"",c:"其他",sp:""},{cp:"社會變遷",z:"",c:"社會",sp:""},{cp:"空調",z:"",c:"家居",sp:""},{cp:"衝浪",z:"",c:"健康運動",sp:""},{cp:"滑浪風帆",z:"",c:"其他",sp:""},{cp:"風景攝影",z:"",c:"娛樂",sp:""},{cp:"珊瑚",z:"",c:"其他",sp:""},{cp:"GoPro",z:"",c:"其他",sp:""},{cp:"運動相機",z:"",c:"其他",sp:""},{cp:"山脈",z:"",c:"其他",sp:""},{cp:"良知消費",z:"",c:"商業",sp:""},{cp:"Sustainable fashion",z:"永續時尚",c:"時尚美妝",sp:""},{cp:"華語流行音樂",z:"",c:"其他",sp:""},{cp:"Government agency",z:"",c:"其他",sp:"civil"},{cp:"司法科學",z:"",c:"其他",sp:""},{cp:"犯罪學",z:"",c:"其他",sp:""},{cp:"犯罪心理",z:"",c:"其他",sp:""},{cp:"推理小說",z:"",c:"其他",sp:""},{cp:"疑犯追蹤",z:"",c:"其他",sp:""},{cp:"國土安全",z:"",c:"其他",sp:""},{cp:"學校：臺灣警察專科學校",z:"",c:"其他",sp:""},{cp:"中央警察大學",z:"",c:"其他",sp:""},{cp:"數據挖掘",z:"",c:"其他",sp:""},{cp:"能源效率",z:"",c:"科技",sp:""},{cp:"愛迪達",z:"",c:"時尚美妝",sp:""},{cp:"耐吉公司",z:"",c:"時尚美妝",sp:""},{cp:"The North Face",z:"",c:"時尚美妝",sp:""},{cp:"僱傭",z:"",c:"商業",sp:""},{cp:"Semi-truck",z:"聯結車",c:"交通",sp:""},{cp:"幼稚園",z:"",c:"教育",sp:""},{cp:"Health",z:"一般健康",c:"時尚美妝",sp:""},{cp:"Loyalty program",z:"會員集點計畫",c:"其他",sp:""},{cp:"折扣和購物回饋)",z:"",c:"其他",sp:""},{cp:"商務旅遊",z:"",c:"旅遊生活",sp:""},{cp:"親子",z:"",c:"娛樂",sp:""},{cp:"Joie",z:"",c:"其他",sp:""},{cp:"費雪牌",z:"",c:"教育",sp:""},{cp:"奶粉",z:"",c:"美食",sp:""},{cp:"嬰兒車",z:"",c:"教育",sp:""},{cp:"KIND Healthy Snacks",z:"健",c:"其他",sp:""},{cp:"體操",z:"",c:"其他",sp:""},{cp:"能源",z:"",c:"科技",sp:""},{cp:"素食主義",z:"",c:"美食",sp:""},{cp:"材料科學",z:"",c:"其他",sp:""},{cp:"不鏽鋼",z:"",c:"其他",sp:""},{cp:"電力",z:"",c:"其他",sp:""},{cp:"基層工作",z:"",c:"商業",sp:""},{cp:"小學",z:"",c:"教育",sp:""},{cp:"酒莊",z:"",c:"美食",sp:""},{cp:"雞尾酒",z:"",c:"美食",sp:""},{cp:"起司",z:"",c:"美食",sp:""},{cp:"FineDiningLovers",z:"",c:"其他",sp:""},{cp:"百達翡麗",z:"",c:"時尚美妝",sp:""},{cp:"遊艇",z:"",c:"交通",sp:""},{cp:"保時捷卡宴",z:"",c:"其他",sp:""},{cp:"奢華度假村",z:"",c:"旅遊生活",sp:""},{cp:"遊艇俱樂部",z:"",c:"旅遊生活",sp:""},{cp:"比爾·蓋茨",z:"",c:"其他",sp:""},{cp:"席夢思",z:"",c:"其他",sp:""},{cp:"Tax law",z:"",c:"其他",sp:""},{cp:"Collectibles",z:"收藏品",c:"其他",sp:"rich"},{cp:"拍賣",z:"",c:"其他",sp:""},{cp:"Lunch box",z:"",c:"其他",sp:""},{cp:"Physical security",z:"保",c:"其他",sp:"tech"},{cp:"TechRadar",z:"全",c:"其他",sp:"tech"},{cp:"Airbnb",z:"",c:"旅遊生活",sp:""},{cp:"Smart home automation",z:"家庭自動化",c:"科技",sp:""},{cp:"Geek.com",z:"",c:"其他",sp:"tech"},{cp:"Smart Lock",z:"",c:"其他",sp:""},{cp:"Tech news",z:"科技新聞",c:"娛樂",sp:""},{cp:"Open source software",z:"開放原始碼軟體",c:"其他",sp:"tech"},{cp:"Specialty coffee",z:"精品咖啡",c:"美食",sp:""},{cp:"Cashback",z:"現金回饋網站",c:"其他",sp:""},{cp:"車輛銷售網站",z:"",c:"科技",sp:""},{cp:"社區和社會服務",z:"",c:"其他",sp:""},{cp:"市場研究",z:"",c:"其他",sp:""},{cp:"Business leaders",z:"商業領袖",c:"金融",sp:""},{cp:"Tax preparation",z:"報稅服務",c:"其他",sp:"rich"},{cp:"Seed accelerator",z:"創業加速器",c:"其他",sp:""},{cp:"Professional services",z:"專業服務",c:"其他",sp:""},{cp:"High-net-worth individual",z:"高淨值人士",c:"商業",sp:"rich"},{cp:"沙發床",z:"",c:"家居",sp:""},{cp:"淋浴間",z:"",c:"家居",sp:""},{cp:"House painters and decorators",z:"房屋油漆工和裝修師",c:"家居",sp:""},{cp:"顏色",z:"",c:"其他",sp:""},{cp:"照明",z:"",c:"科技",sp:""},{cp:"首爾",z:"",c:"其他",sp:""},{cp:"韓國燒酒",z:"",c:"其他",sp:""},{cp:"鮪魚",z:"",c:"其他",sp:""},{cp:"Yoga",z:"瑜珈褲",c:"健康運動",sp:""},{cp:"Lululemon Athletica",z:"",c:"時尚美妝",sp:""},{cp:"美妝新聞",z:"",c:"其他",sp:""},{cp:"內容和教學",z:"",c:"時尚美妝",sp:""},{cp:"美妝店",z:"",c:"商業",sp:""},{cp:"植村秀",z:"",c:"其他",sp:""},{cp:"歐舒丹",z:"",c:"其他",sp:""},{cp:"伊索",z:"",c:"其他",sp:""},{cp:"Diptyque",z:"",c:"其他",sp:""},{cp:"Lifestyle brand",z:"",c:"其他",sp:""},{cp:"24 小時健身房",z:"",c:"健康運動",sp:""},{cp:"動畫和漫畫",z:"",c:"娛樂",sp:""},{cp:"個人電腦",z:"",c:"科技",sp:""},{cp:"打掃",z:"",c:"家居",sp:""},{cp:"使用 Facebook 的管道：所有行動裝置",z:"",c:"科技",sp:""},{cp:"露臺",z:"",c:"其他",sp:""},{cp:"Recreational fishing",z:"休閒釣魚",c:"其他",sp:""},{cp:"Hoka One One",z:"",c:"其他",sp:""},{cp:"蘋果零售店",z:"",c:"其他",sp:""},{cp:"Convenience food",z:"即時食品",c:"其他",sp:""},{cp:"Gadget & Gear",z:"涵蓋各種電子產品",c:"其他",sp:"tech"},{cp:"職涯發展",z:"",c:"商業",sp:""},{cp:"Compensation and benefits",z:"薪水及福利",c:"其他",sp:""},{cp:"輪胎品牌和商店",z:"",c:"商業",sp:""},{cp:"充電器",z:"",c:"其他",sp:""},{cp:"電池",z:"",c:"其他",sp:""},{cp:"製冷",z:"",c:"其他",sp:""},{cp:"二手商品",z:"",c:"其他",sp:""},{cp:"兒童",z:"",c:"娛樂",sp:""},{cp:"托兒所",z:"",c:"教育",sp:""},{cp:"惠普",z:"",c:"其他",sp:""},{cp:"微星科技",z:"",c:"其他",sp:""},{cp:"應用程式軟體",z:"",c:"科技",sp:""},{cp:"Wine",z:"葡萄酒和烈酒",c:"娛樂",sp:""},{cp:"網路應用程序",z:"",c:"其他",sp:""},{cp:"DJI",z:"",c:"其他",sp:""},{cp:"Positive Parenting Solutions",z:"",c:"其他",sp:""},{cp:"Motherhood",z:"育兒雜誌",c:"娛樂",sp:""},{cp:"Investment club",z:"房",c:"教育",sp:"re"},{cp:"Investment club",z:"房",c:"其他",sp:"re"},{cp:"Kids activities",z:"兒童活動",c:"旅遊生活",sp:""},{cp:"Instant camera",z:"即時成像相機",c:"其他",sp:""},{cp:"Dining out",z:"外食",c:"美食",sp:""},{cp:"Google",z:"",c:"其他",sp:""},{cp:"計算機輔助設計",z:"",c:"其他",sp:""},{cp:"The New Age Parents",z:"",c:"其他",sp:""},{cp:"在家教育",z:"",c:"教育",sp:""},{cp:"游泳和水上運動",z:"",c:"健康運動",sp:""},{cp:"賣書",z:"",c:"商業",sp:""},{cp:"對近期活動有興趣",z:"",c:"其他",sp:""},{cp:"部落格",z:"",c:"科技",sp:""},{cp:"歌帝梵巧克力",z:"",c:"其他",sp:""},{cp:"KitchenAid",z:"家",c:"家居",sp:""},{cp:"Home and garden",z:"生活風格和家務內容",c:"家居",sp:""},{cp:"居家和園藝媒體",z:"",c:"家居",sp:""},{cp:"Family travel",z:"家庭桌遊",c:"娛樂",sp:""},{cp:"審計",z:"",c:"其他",sp:""},{cp:"富士膠片",z:"",c:"其他",sp:""},{cp:"索尼α系列",z:"",c:"其他",sp:""},{cp:"佳能EOS系列",z:"",c:"其他",sp:""},{cp:"Gourmet Food Lovers",z:"美食愛好者",c:"其他",sp:"rich"},{cp:"珍珠奶茶",z:"",c:"其他",sp:""},{cp:"Home cooking",z:"在家下廚",c:"美食",sp:""},{cp:"Food",z:"美食",c:"商業",sp:""},{cp:"行政服務",z:"",c:"其他",sp:""},{cp:"Lifestyle content",z:"節儉生活風格內容",c:"商業",sp:""},{cp:"benefit",z:"退伍軍人福利",c:"其他",sp:""},{cp:"Home organization",z:"家務管理和整理",c:"家居",sp:""},{cp:"Educational resources",z:"教育資源",c:"教育",sp:""},{cp:"旋轉式刮鬍刀",z:"",c:"其他",sp:""},{cp:"Motorcycle accessories",z:"摩托車配件",c:"交通",sp:""},{cp:"管理諮詢",z:"",c:"其他",sp:""},{cp:"Enterprise resource planning",z:"企業資源計劃",c:"其他",sp:""},{cp:"Leadership development",z:"領導力發展",c:"其他",sp:""},{cp:"外判",z:"",c:"其他",sp:""},{cp:"Private banking",z:"私人銀行服務",c:"金融",sp:"rich"},{cp:"Co-working",z:"共用工作空間",c:"其他",sp:""},{cp:"Procurement",z:"採購管理",c:"其他",sp:""},{cp:"Business networking",z:"商業社交",c:"其他",sp:""},{cp:"Boutique hotel",z:"精品酒店",c:"其他",sp:"rich"},{cp:"Buy one get one free",z:"買一送一",c:"商業",sp:""},{cp:"Lifestyle Travel",z:"貼近日常",c:"其他",sp:""},{cp:"Women's clothing",z:"女裝品牌",c:"時尚美妝",sp:""},{cp:"Cash on delivery",z:"",c:"其他",sp:""},{cp:"Men's clothing",z:"男裝品牌",c:"時尚美妝",sp:""},{cp:"Consumer electronics",z:"消費電子展",c:"其他",sp:"tech"},{cp:"Movie lovers",z:"電影愛好者",c:"娛樂",sp:""},{cp:"Algorithmic trading",z:"演算法交易",c:"其他",sp:""},{cp:"Top Gear 極速誌",z:"",c:"娛樂",sp:""},{cp:"Electric vehicle conversion",z:"",c:"其他",sp:""},{cp:"Mobile application development",z:"行動應用程式開發",c:"其他",sp:"young"},{cp:"Lifestyle",z:"汽車媒體和內容",c:"交通",sp:""},{cp:"Streaming",z:"音樂和音訊串流",c:"娛樂",sp:"young"},{cp:"自営業",z:"",c:"其他",sp:""},{cp:"Luxury lifestyle",z:"豪奢生活方式",c:"科技",sp:"rich"},{cp:"Agriculture",z:"農業機械",c:"農業自然",sp:""},{cp:"家長：學齡前兒童的家長",z:"",c:"其他",sp:""},{cp:"低年級學童的家長",z:"",c:"其他",sp:""},{cp:"Influencers",z:"美妝網紅",c:"時尚美妝",sp:""},{cp:"BACKPACKING",z:"健行裝備",c:"健康運動",sp:""},{cp:"Trails",z:"登山步道",c:"其他",sp:""},{cp:"公共財政",z:"",c:"其他",sp:""},{cp:"Chinese Culture",z:"中華文化",c:"其他",sp:""},{cp:"Household",z:"家庭",c:"其他",sp:""},{cp:"Travel Deals",z:"旅",c:"其他",sp:""},{cp:"手機配件",z:"",c:"其他",sp:""},{cp:"Financial technology",z:"金融科技",c:"其他",sp:""},{cp:"Men's grooming",z:"男性修容用品",c:"時尚美妝",sp:""},{cp:"Luxury",z:"精品名錶",c:"其他",sp:"rich"},{cp:"租車",z:"",c:"其他",sp:""},{cp:"Frequent flyer programs",z:"飛行常客獎勵計劃",c:"其他",sp:"rich"},{cp:"Philanthropy",z:"慈善和公益",c:"社會",sp:"rich"},{cp:"生產率",z:"",c:"科技",sp:""},{cp:"lending",z:"信貸服務和組織",c:"金融",sp:""},{cp:"Fragrance oil",z:"香",c:"其他",sp:""},{cp:"Quality Foods",z:"優質食品",c:"其他",sp:""},{cp:"HydraFacial",z:"海",c:"其他",sp:""},{cp:"Jo Malone London",z:"",c:"其他",sp:""},{cp:"Acqua di Parma",z:"",c:"其他",sp:""},{cp:"Venture capital financing",z:"創投融資",c:"其他",sp:"rich"},{cp:"Business opportunities",z:"商機",c:"金融",sp:""},{cp:"Food trucks",z:"飲食業",c:"其他",sp:""},{cp:"Music",z:"音樂會和現場演出",c:"娛樂",sp:""},{cp:"Sales management",z:"銷售管理",c:"商業",sp:""},{cp:"口紅",z:"",c:"時尚美妝",sp:""},{cp:"美妝造型媒體",z:"",c:"時尚美妝",sp:""},{cp:"粉底",z:"",c:"時尚美妝",sp:""},{cp:"化妝刷",z:"",c:"時尚美妝",sp:""},{cp:"Fashion & Make Up",z:"",c:"其他",sp:""},{cp:"臉部保養",z:"",c:"時尚美妝",sp:""},{cp:"現金回贈獎勵方案",z:"",c:"金融",sp:""},{cp:"Workwear",z:"工作服",c:"其他",sp:""},{cp:"Commercial property",z:"商用不動產",c:"房地產興趣",sp:"re"},{cp:"Payment service provider",z:"支",c:"其他",sp:""},{cp:"Digital transformation",z:"數位轉型",c:"其他",sp:""},{cp:"Small business",z:"小型企業主",c:"金融",sp:""},{cp:"Craft Beer and Brewing",z:"手工啤酒",c:"其他",sp:"young"},{cp:"Party planning",z:"派對策劃",c:"旅遊生活",sp:""},{cp:"Full English breakfast",z:"英式早餐",c:"其他",sp:""},{cp:"World Gym",z:"",c:"其他",sp:""},{cp:"Contemporary art",z:"當代藝術",c:"娛樂",sp:""},{cp:"Adult education",z:"成人教育",c:"商業",sp:"civil"},{cp:"Digital art",z:"數字藝術",c:"其他",sp:"young"},{cp:"健康的習慣",z:"",c:"旅遊生活",sp:""},{cp:"水果沙拉",z:"",c:"其他",sp:""},{cp:"Live music",z:"現場音樂",c:"科技",sp:""},{cp:"Cultural tourism",z:"文化觀光",c:"其他",sp:"civil"},{cp:"Cultural travel",z:"文化旅遊",c:"其他",sp:""},{cp:"生產率",z:"",c:"其他",sp:""},{cp:"Industrial technology",z:"產業科技",c:"其他",sp:"tech"},{cp:"Fashion Tech",z:"時尚機構",c:"教育",sp:""},{cp:"Office Space",z:"",c:"其他",sp:""},{cp:"Local events",z:"葡萄酒相關內容",c:"美食",sp:""},{cp:"Sap basis",z:"",c:"其他",sp:""},{cp:"Online entertainment",z:"網路娛樂",c:"娛樂",sp:"young"},{cp:"Video on demand",z:"隨選影片",c:"其他",sp:""},{cp:"socializing",z:"社交",c:"其他",sp:""},{cp:"Entertainment News",z:"娛樂新聞",c:"其他",sp:""},{cp:"Happy hour",z:"歡樂時光",c:"美食",sp:""},{cp:"Christmas Holiday",z:"",c:"其他",sp:""},{cp:"批發及零售界功能界別",z:"",c:"其他",sp:""},{cp:"Trade shows",z:"設計貿易展和專業組織",c:"其他",sp:""},{cp:"韓國燒烤",z:"",c:"其他",sp:""},{cp:"日本拉麵",z:"",c:"其他",sp:""},{cp:"Travel Blogger",z:"",c:"其他",sp:""},{cp:"星座",z:"",c:"社會",sp:""},{cp:"書法",z:"",c:"其他",sp:""},{cp:"水晶",z:"",c:"科技",sp:""},{cp:"綜藝電視節目",z:"",c:"娛樂",sp:""},{cp:"Kitchen Design",z:"廚房設計",c:"其他",sp:""},{cp:"浴室",z:"",c:"房地產興趣",sp:""},{cp:"Open house",z:"建築媒體",c:"商業",sp:"re"},{cp:"哈曼卡頓",z:"",c:"其他",sp:""},{cp:"影展",z:"",c:"其他",sp:""},{cp:"Healthy",z:"健康食品",c:"美食",sp:""},{cp:"散步",z:"",c:"旅遊生活",sp:""},{cp:"堅果",z:"",c:"其他",sp:""},{cp:"Celebrity News",z:"名人娛樂新聞",c:"其他",sp:""},{cp:"次文化",z:"",c:"其他",sp:""},{cp:"Award shows",z:"影視獎項",c:"其他",sp:""},{cp:"Auto repair",z:"汽車技師",c:"交通",sp:""},{cp:"Logistics",z:"運輸和物流服務和組織",c:"金融",sp:""},{cp:"HydraFacial",z:"海",c:"娛樂",sp:""},{cp:"Adventure travel",z:"冒險旅遊",c:"旅遊生活",sp:"young"},{cp:"Continuing education",z:"繼續教育",c:"其他",sp:"civil"},{cp:"領英",z:"",c:"其他",sp:""},{cp:"蘇富比",z:"",c:"其他",sp:""},{cp:"Country club",z:"高級俱樂部",c:"其他",sp:"rich"},{cp:"Birdwatching",z:"觀鳥",c:"其他",sp:""},{cp:"結婚紀念日",z:"",c:"旅遊生活",sp:""},{cp:"插花",z:"",c:"其他",sp:""},{cp:"建築風格",z:"",c:"其他",sp:""},{cp:"Gourmet",z:"美食家",c:"其他",sp:"rich"},{cp:"Scandinavian design",z:"北歐風設計",c:"房地產興趣",sp:""},{cp:"Light fixture",z:"燈具",c:"其他",sp:""},{cp:"有軌電車",z:"",c:"其他",sp:""},{cp:"鐵路運輸",z:"",c:"其他",sp:""},{cp:"Music",z:"音樂",c:"娛樂",sp:""},{cp:"語言學校",z:"",c:"其他",sp:""},{cp:"親子天下",z:"",c:"其他",sp:""},{cp:"Design studios",z:"嬰幼兒和孕婦用品店",c:"商業",sp:""},{cp:"抗噪耳機",z:"",c:"其他",sp:""},{cp:"電玩遊戲網路媒體",z:"",c:"娛樂",sp:""},{cp:"Employee Benefit News",z:"",c:"其他",sp:""},{cp:"跨界休旅車",z:"",c:"其他",sp:""},{cp:"Nursing education",z:"護理教育",c:"教育",sp:"civil"},{cp:"清潔",z:"",c:"時尚美妝",sp:""},{cp:"CeraVe Skincare",z:"",c:"其他",sp:""},{cp:"Cetaphil",z:"",c:"其他",sp:""},{cp:"重型設備",z:"",c:"科技",sp:""},{cp:"GPS 導航裝置",z:"",c:"科技",sp:""},{cp:"Multinational corporation",z:"跨國公司",c:"其他",sp:""},{cp:"Google地圖",z:"",c:"其他",sp:""},{cp:"水族飼養",z:"",c:"其他",sp:""},{cp:"設施管理",z:"",c:"其他",sp:""},{cp:"iTunes",z:"",c:"其他",sp:""},{cp:"元旦",z:"",c:"其他",sp:""},{cp:"Gift card",z:"",c:"其他",sp:""},{cp:"門票",z:"",c:"其他",sp:""},{cp:"Family Fresh Meals",z:"",c:"其他",sp:""},{cp:"幼稚園學前班",z:"",c:"教育",sp:""},{cp:"Television production",z:"電影和電視業",c:"娛樂",sp:""},{cp:"航空工程",z:"",c:"其他",sp:""},{cp:"美國聯邦機構",z:"",c:"社會",sp:""},{cp:"日語",z:"",c:"其他",sp:""},{cp:"Luxury",z:"精品",c:"旅遊生活",sp:"rich"},{cp:"科學",z:"",c:"科技",sp:""},{cp:"釣魚",z:"",c:"其他",sp:""},{cp:"狩獵和射擊新聞和內容",z:"",c:"健康運動",sp:""},{cp:"釣竿",z:"",c:"其他",sp:""},{cp:"漁具",z:"",c:"其他",sp:""},{cp:"Nature photography",z:"自然攝影",c:"娛樂",sp:""},{cp:"Outdoor Living",z:"戶",c:"其他",sp:""},{cp:"Rural",z:"農業新聞和內容",c:"農業自然",sp:""},{cp:"Rural",z:"農業服務和組織",c:"科技",sp:""},{cp:"Agriculture",z:"農業科學",c:"其他",sp:""},{cp:"Farm-to-table",z:"農場到餐桌",c:"其他",sp:""},{cp:"農企業",z:"",c:"農業自然",sp:""},{cp:"網路博奕",z:"",c:"娛樂",sp:""},{cp:"百家樂旅遊",z:"",c:"旅遊生活",sp:""},{cp:"再融資",z:"",c:"金融",sp:""},{cp:"俱樂部和夜生活)",z:"",c:"其他",sp:""},{cp:"資格預審",z:"",c:"金融",sp:""},{cp:"賭場遊戲",z:"",c:"娛樂",sp:""},{cp:"雲存儲",z:"",c:"其他",sp:""},{cp:"信息系統安全認證專家",z:"",c:"其他",sp:""},{cp:"Freight transport",z:"運",c:"其他",sp:""},{cp:"Cash and carry",z:"現",c:"其他",sp:""},{cp:"Terrace",z:"露台",c:"家居",sp:""},{cp:"室內盆栽",z:"",c:"農業自然",sp:""},{cp:"多肉植物",z:"",c:"其他",sp:""},{cp:"網路電視",z:"",c:"娛樂",sp:""},{cp:"植物園",z:"",c:"其他",sp:""},{cp:"計算與數學",z:"",c:"其他",sp:""},{cp:"Information technology",z:"資訊科技和技術服務 +教育資源",c:"教育",sp:""},{cp:"書籍出版社",z:"",c:"其他",sp:""},{cp:"數據",z:"",c:"其他",sp:""},{cp:"本田CR-V",z:"",c:"其他",sp:""},{cp:"凈水器",z:"",c:"其他",sp:""},{cp:"酒店管理學",z:"",c:"其他",sp:""},{cp:"商務艙",z:"",c:"旅遊生活",sp:""},{cp:"建築服務和組織",z:"",c:"科技",sp:""},{cp:"西裝襯衫",z:"",c:"時尚美妝",sp:""},{cp:"簡單生活",z:"",c:"其他",sp:""},{cp:"Sustainable tourism",z:"",c:"旅遊生活",sp:""},{cp:"Sustainable architecture",z:"永續建築",c:"房地產興趣",sp:""},{cp:"綠色建築",z:"",c:"其他",sp:""},{cp:"度假屋",z:"",c:"旅遊生活",sp:""},{cp:"Rural",z:"農家樂",c:"其他",sp:""},{cp:"居家風格和類型",z:"",c:"房地產興趣",sp:""},{cp:"Backpacking",z:"背包旅行",c:"其他",sp:""},{cp:"Weekend Getaway",z:"周末小旅行",c:"其他",sp:""},{cp:"神話",z:"",c:"其他",sp:""},{cp:"巴黎世家",z:"",c:"時尚美妝",sp:""},{cp:"Miu Miu",z:"",c:"其他",sp:""},{cp:"三宅一生",z:"",c:"其他",sp:""},{cp:"Prada",z:"",c:"時尚美妝",sp:""},{cp:"Toyota Alphard",z:"",c:"其他",sp:""},{cp:"亞曼尼",z:"",c:"時尚美妝",sp:""},{cp:"克里斯汀·迪奧",z:"",c:"其他",sp:""},{cp:"Perfume",z:"",c:"其他",sp:""},{cp:"Travel the World",z:"",c:"其他",sp:""},{cp:"Visa Cash",z:"",c:"其他",sp:""},{cp:"Forever 21",z:"",c:"時尚美妝",sp:""},{cp:"31冰淇淋",z:"",c:"其他",sp:""},{cp:"哈根達斯",z:"",c:"其他",sp:""},{cp:"Prefabricated home",z:"組合屋",c:"其他",sp:""},{cp:"Sustainable architecture",z:"永續建築",c:"其他",sp:""},{cp:"自然環境",z:"",c:"科技",sp:""},{cp:"BACK",z:"健康食品品牌",c:"美食",sp:""},{cp:"Pet Care",z:"",c:"其他",sp:""},{cp:"兒童電視動畫",z:"",c:"娛樂",sp:""},{cp:"HVAC",z:"暖通空調",c:"家居",sp:""},{cp:"釣魚裝備和服裝",z:"",c:"健康運動",sp:""},{cp:"廚櫃",z:"",c:"家居",sp:""},{cp:"肉排",z:"",c:"美食",sp:""},{cp:"義大利料理",z:"",c:"美食",sp:""},{cp:"Design",z:"設計師服飾",c:"時尚美妝",sp:""},{cp:"迪士尼樂園",z:"",c:"其他",sp:""},{cp:"Google Flights",z:"",c:"其他",sp:""},{cp:"長榮航空",z:"",c:"其他",sp:""},{cp:"墨鏡",z:"",c:"其他",sp:""},{cp:"Collectibles",z:"收藏用玩具",c:"教育",sp:"rich"},{cp:"托福",z:"",c:"其他",sp:""},{cp:"多益",z:"",c:"其他",sp:""},{cp:"Online learning",z:"教育技術學",c:"教育",sp:""},{cp:"家長教師聯誼會",z:"",c:"教育",sp:""},{cp:"橄欖油",z:"",c:"其他",sp:""},{cp:"有氧運動",z:"",c:"其他",sp:""},{cp:"電動牙刷",z:"",c:"健康運動",sp:""},{cp:"音響設備品牌和零售商",z:"",c:"商業",sp:""},{cp:"牛奶",z:"",c:"美食",sp:""},{cp:"Food ingredients",z:"食材",c:"美食",sp:""},{cp:"洗髮精",z:"",c:"時尚美妝",sp:""},{cp:"熨斗",z:"",c:"其他",sp:""},{cp:"物業管理",z:"",c:"房地產興趣",sp:""},{cp:"壁球",z:"",c:"其他",sp:""},{cp:"副總經理",z:"",c:"其他",sp:""},{cp:"創辦人",z:"",c:"其他",sp:""},{cp:"總監",z:"",c:"其他",sp:""},{cp:"董事長",z:"",c:"其他",sp:""},{cp:"家長：家長",z:"",c:"其他",sp:""},{cp:"嬰幼兒家長",z:"",c:"其他",sp:""},{cp:"學齡前兒童的家長",z:"",c:"其他",sp:""},{cp:"青少年學童的家長",z:"",c:"其他",sp:""},{cp:"可樂",z:"",c:"其他",sp:""},{cp:"乳製品",z:"",c:"美食",sp:""},{cp:"卡拉OK",z:"",c:"其他",sp:""},{cp:"漁業",z:"",c:"房地產興趣",sp:""},{cp:"tea leaf",z:"茶葉品牌",c:"美食",sp:""},{cp:"QuickBooks",z:"",c:"其他",sp:""},{cp:"捷安特",z:"",c:"其他",sp:""},{cp:"短片",z:"",c:"其他",sp:""},{cp:"Facebook 付款用戶",z:"",c:"其他",sp:""},{cp:"陶瓷器",z:"",c:"其他",sp:""},{cp:"陶器",z:"",c:"其他",sp:""},{cp:"翻譯",z:"",c:"其他",sp:""},{cp:"Marketing",z:"行銷 API 開發人員",c:"其他",sp:""},{cp:"祖父母",z:"",c:"其他",sp:""},{cp:"軍事",z:"",c:"社會",sp:""},{cp:"地板",z:"",c:"其他",sp:""},{cp:"Weekend Getaway",z:"周末小旅行",c:"旅遊生活",sp:""},{cp:"PC Gamer",z:"",c:"其他",sp:""},{cp:"歌唱",z:"",c:"娛樂",sp:""},{cp:"攀岩",z:"",c:"健康運動",sp:""},{cp:"拼圖",z:"",c:"其他",sp:""},{cp:"攀石",z:"",c:"其他",sp:""},{cp:"電腦遊戲",z:"",c:"娛樂",sp:""},{cp:"災害管理",z:"",c:"其他",sp:""},{cp:"金融經濟學",z:"",c:"其他",sp:""},{cp:"純素營養",z:"",c:"美食",sp:""},{cp:"全價值營養",z:"",c:"其他",sp:""},{cp:"膽固醇",z:"",c:"科技",sp:""},{cp:"發電",z:"",c:"其他",sp:""},{cp:"田地",z:"",c:"農業自然",sp:""},{cp:"溫室",z:"",c:"其他",sp:""},{cp:"土壤",z:"",c:"其他",sp:""},{cp:"景觀設計",z:"",c:"家居",sp:""},{cp:"Sustainable agriculture",z:"永續農業",c:"農業自然",sp:""},{cp:"Interior design",z:"室內設計雜誌",c:"娛樂",sp:""},{cp:"Adobe InDesign",z:"",c:"其他",sp:""},{cp:"Boutique",z:"女性精品服飾零售商",c:"商業",sp:""},{cp:"天文學",z:"",c:"其他",sp:""},{cp:"自己動手做",z:"",c:"其他",sp:""},{cp:"折扣卡",z:"",c:"其他",sp:""},{cp:"礦物和採礦)",z:"",c:"其他",sp:""},{cp:"舞廳",z:"",c:"娛樂",sp:""},{cp:"酒館",z:"",c:"其他",sp:""},{cp:"電子音樂",z:"",c:"娛樂",sp:""},{cp:"夜店",z:"",c:"其他",sp:""},{cp:"建築業",z:"",c:"科技",sp:""},{cp:"挖土機",z:"",c:"其他",sp:""},{cp:"推理小說",z:"",c:"娛樂",sp:""},{cp:"Spring cleaning",z:"大掃除",c:"家居",sp:""},{cp:"運輸與搬運",z:"",c:"其他",sp:""},{cp:"平鋪磚瓦",z:"",c:"其他",sp:""},{cp:"地板",z:"",c:"科技",sp:""},{cp:"壁紙",z:"",c:"其他",sp:""},{cp:"武術",z:"",c:"健康運動",sp:""},{cp:"綜合格鬥",z:"",c:"其他",sp:""},{cp:"Automobile",z:"汽車行照和法規",c:"社會",sp:""},{cp:"學徒",z:"",c:"其他",sp:""},{cp:"超級馬利奧系列",z:"",c:"其他",sp:""},{cp:"薩爾達傳說",z:"",c:"其他",sp:""},{cp:"PHP",z:"",c:"其他",sp:""},{cp:"馬拉松",z:"",c:"其他",sp:""},{cp:"玩命關頭",z:"",c:"其他",sp:""},{cp:"Garden furniture",z:"庭院家具",c:"家居",sp:""},{cp:"日式旅館",z:"",c:"其他",sp:""},{cp:"度假屋出租",z:"",c:"旅遊生活",sp:""},{cp:"婚紗",z:"",c:"旅遊生活",sp:""},{cp:"油電混合動力車",z:"",c:"交通",sp:""},{cp:"改裝車",z:"",c:"交通",sp:""},{cp:"小提琴",z:"",c:"其他",sp:""},{cp:"道路運輸",z:"",c:"其他",sp:""},{cp:"Hospitality industry",z:"餐旅業",c:"美食",sp:""},{cp:"生物可分解塑膠",z:"",c:"其他",sp:""},{cp:"紀念物保存",z:"",c:"其他",sp:""},{cp:"電子郵件行銷",z:"",c:"商業",sp:""},{cp:"Supplier",z:"鞋類媒體和內容",c:"其他",sp:""},{cp:"美國運通",z:"",c:"其他",sp:""},{cp:"寶石",z:"",c:"科技",sp:""},{cp:"裝飾風藝術",z:"",c:"其他",sp:""},{cp:"Kitchen appliances",z:"家電品牌和零售商",c:"商業",sp:""},{cp:"分子生物學",z:"",c:"其他",sp:""},{cp:"供應",z:"",c:"金融",sp:""},{cp:"曼秀雷敦",z:"",c:"其他",sp:""},{cp:"DHC",z:"",c:"其他",sp:""},{cp:"Nutrition",z:"人體營養",c:"科技",sp:""},{cp:"區經理",z:"",c:"其他",sp:""},{cp:"業務",z:"",c:"其他",sp:""},{cp:"Account manager",z:"",c:"其他",sp:""},{cp:"駕駛執照",z:"",c:"其他",sp:""},{cp:"Forklift",z:"叉車",c:"其他",sp:""},{cp:"衛星導航系統",z:"",c:"其他",sp:""},{cp:"美國貨運業",z:"",c:"交通",sp:""},{cp:"亞洲教育",z:"",c:"教育",sp:""},{cp:"Skyscanner",z:"",c:"其他",sp:""},{cp:"Microsoft Office",z:"",c:"其他",sp:""},{cp:"Beauty Dior",z:"",c:"其他",sp:""},{cp:"動機",z:"",c:"健康運動",sp:""},{cp:"Early Learning Centre",z:"早教中心",c:"其他",sp:""},{cp:"Wangkaolou",z:"",c:"其他",sp:""},{cp:"Electrical wiring",z:"電",c:"其他",sp:""},{cp:"風冷",z:"",c:"其他",sp:""},{cp:"中央處理器",z:"",c:"科技",sp:""},{cp:"微軟",z:"",c:"其他",sp:""},{cp:"英特爾",z:"",c:"其他",sp:""},{cp:"甲骨文公司",z:"",c:"其他",sp:""},{cp:"Tesla",z:"",c:"娛樂",sp:""},{cp:"AMD Radeon",z:"",c:"其他",sp:""},{cp:"Commercial fishing",z:"商業捕魚",c:"其他",sp:""},{cp:"延繩捕魚",z:"",c:"其他",sp:""},{cp:"職涯",z:"",c:"商業",sp:""},{cp:"不與家人同住",z:"",c:"其他",sp:""},{cp:"民俗音樂",z:"",c:"其他",sp:""},{cp:"油畫",z:"",c:"其他",sp:""},{cp:"纖維",z:"",c:"其他",sp:""},{cp:"葡萄園",z:"",c:"其他",sp:""},{cp:"遊輪",z:"",c:"旅遊生活",sp:""},{cp:"都會車",z:"",c:"交通",sp:""},{cp:"前菜",z:"",c:"其他",sp:""},{cp:"新聞學",z:"",c:"娛樂",sp:""},{cp:"立法機構",z:"",c:"其他",sp:""},{cp:"車隊管理",z:"",c:"其他",sp:""},{cp:"光學",z:"",c:"科技",sp:""},{cp:"New Home",z:"",c:"其他",sp:""},{cp:"社會科學",z:"",c:"其他",sp:""},{cp:"人際關係",z:"",c:"社會",sp:""},{cp:"Science communication",z:"科技傳播學",c:"其他",sp:"tech"},{cp:"聯合國兒童基金會",z:"",c:"其他",sp:""},{cp:"質量控制",z:"",c:"其他",sp:""},{cp:"Food storage",z:"",c:"其他",sp:""},{cp:"水泥",z:"",c:"其他",sp:""},{cp:"混凝土",z:"",c:"科技",sp:""},{cp:"RV Travel",z:"露營車旅遊",c:"其他",sp:""},{cp:"National parks",z:"國家公園",c:"旅遊生活",sp:"civil"},{cp:"機油",z:"",c:"其他",sp:""},{cp:"發動機",z:"",c:"其他",sp:""},{cp:"Pilates",z:"健身器材和服裝",c:"時尚美妝",sp:""},{cp:"活動管理",z:"",c:"旅遊生活",sp:""},{cp:"健力",z:"",c:"健康運動",sp:""},{cp:"壺鈴",z:"",c:"其他",sp:""},{cp:"電腦配件",z:"",c:"科技",sp:""},{cp:"金屬蕊",z:"",c:"其他",sp:""},{cp:"硬體",z:"",c:"其他",sp:""},{cp:"手機",z:"",c:"科技",sp:""},{cp:"東京都",z:"",c:"其他",sp:""},{cp:"通訊裝置",z:"",c:"其他",sp:""},{cp:"曾經互動的消費者",z:"",c:"其他",sp:""},{cp:"晚餐",z:"",c:"美食",sp:""},{cp:"太陽能光電",z:"",c:"科技",sp:""},{cp:"光伏陣列",z:"",c:"其他",sp:""},{cp:"水處理",z:"",c:"其他",sp:""},{cp:"輸電系統",z:"",c:"其他",sp:""},{cp:"水質",z:"",c:"其他",sp:""},{cp:"環境科技",z:"",c:"其他",sp:""},{cp:"Huatan",z:"",c:"其他",sp:""},{cp:"無線通訊",z:"",c:"科技",sp:""},{cp:"通信工程",z:"",c:"其他",sp:""},{cp:"無線區域網",z:"",c:"其他",sp:""},{cp:"藍牙",z:"",c:"其他",sp:""},{cp:"網際網路服務供應商",z:"",c:"其他",sp:""},{cp:"寬頻",z:"",c:"其他",sp:""},{cp:"光導纖維",z:"",c:"其他",sp:""},{cp:"機器人學",z:"",c:"其他",sp:""},{cp:"西門子公司",z:"",c:"其他",sp:""},{cp:"應用科學",z:"",c:"其他",sp:""},{cp:"英文系",z:"",c:"其他",sp:""},{cp:"國際關係學",z:"",c:"其他",sp:""},{cp:"公平貿易",z:"",c:"其他",sp:""},{cp:"Business English",z:"",c:"其他",sp:""},{cp:"Software development",z:"基於組件的軟體工程",c:"其他",sp:"tech"},{cp:"IT諮詢",z:"",c:"其他",sp:""},{cp:"International business",z:"國際商務",c:"其他",sp:""},{cp:"電光源",z:"",c:"其他",sp:""},{cp:"物理學",z:"",c:"其他",sp:""},{cp:"不與家人同住",z:"",c:"娛樂",sp:""},{cp:"Scientific",z:"科學媒體和內容",c:"科技",sp:""},{cp:"Google開發人員",z:"",c:"其他",sp:""},{cp:"外語",z:"",c:"科技",sp:""},{cp:"砌體結構",z:"",c:"其他",sp:""},{cp:"Home decor",z:"居家裝飾",c:"家居",sp:""},{cp:"營建管理",z:"",c:"其他",sp:""},{cp:"Marketing automation",z:"行銷自動化",c:"其他",sp:""},{cp:"數碼印刷",z:"",c:"其他",sp:""},{cp:"隨選列印",z:"",c:"其他",sp:""},{cp:"幼童",z:"",c:"教育",sp:""},{cp:"發展心理學",z:"",c:"健康運動",sp:""},{cp:"鑽石",z:"",c:"科技",sp:""},{cp:"珍珠",z:"",c:"其他",sp:""},{cp:"Gardening",z:"園藝工具",c:"家居",sp:""},{cp:"開花植物",z:"",c:"農業自然",sp:""},{cp:"透鏡",z:"",c:"其他",sp:""},{cp:"鏡頭",z:"",c:"其他",sp:""},{cp:"眼鏡",z:"",c:"其他",sp:""},{cp:"Nissan 汽車",z:"",c:"交通",sp:""},{cp:"法式料理",z:"",c:"美食",sp:""},{cp:"米其林",z:"",c:"其他",sp:""},{cp:"騎機車",z:"",c:"交通",sp:""},{cp:"東草屯交流道",z:"",c:"其他",sp:""},{cp:"林業",z:"",c:"其他",sp:""},{cp:"土地主",z:"",c:"其他",sp:""},{cp:"建築與工程",z:"",c:"商業",sp:""},{cp:"市場調查",z:"",c:"其他",sp:""},{cp:"行政服務",z:"",c:"金融",sp:""},{cp:"中彰大橋",z:"",c:"其他",sp:""},{cp:"豐田汽車",z:"",c:"交通",sp:""},{cp:"鉤針編織",z:"",c:"其他",sp:""},{cp:"絲綢",z:"",c:"其他",sp:""},{cp:"新聞雜誌",z:"",c:"娛樂",sp:""},{cp:"大創百貨",z:"",c:"其他",sp:""},{cp:"政治學",z:"",c:"其他",sp:""},{cp:"市場",z:"",c:"金融",sp:""},{cp:"實習醫生",z:"",c:"其他",sp:""},{cp:"家長：嬰幼兒家長",z:"",c:"其他",sp:""},{cp:"居家裝潢構想",z:"",c:"家居",sp:""},{cp:"室內裝潢品牌和零售商",z:"",c:"商業",sp:""},{cp:"體育新聞和內容",z:"",c:"健康運動",sp:""},{cp:"富時100指數",z:"",c:"其他",sp:""},{cp:"iOS",z:"",c:"其他",sp:""},{cp:"行動裝置",z:"",c:"科技",sp:""},{cp:"策略管理",z:"",c:"商業",sp:""},{cp:"Foreign company",z:"通貨",c:"其他",sp:""},{cp:"桑拿",z:"",c:"其他",sp:""},{cp:"益生菌",z:"",c:"美食",sp:""},{cp:"永久彩妝",z:"",c:"時尚美妝",sp:""},{cp:"Tourism in Japan",z:"",c:"其他",sp:""},{cp:"Self-guided tour",z:"",c:"其他",sp:""},{cp:"本田汽車",z:"",c:"交通",sp:""},{cp:"行政服務",z:"",c:"旅遊生活",sp:""},{cp:"建築與採石",z:"",c:"金融",sp:""},{cp:"Homei",z:"",c:"其他",sp:""},{cp:"Peitou",z:"",c:"其他",sp:""},{cp:"數學",z:"",c:"其他",sp:""},{cp:"航空器",z:"",c:"其他",sp:""},{cp:"Adobe Photoshop",z:"",c:"科技",sp:""},{cp:"圖像編輯",z:"",c:"其他",sp:""},{cp:"多功能休旅車",z:"",c:"交通",sp:""},{cp:"美術史",z:"",c:"其他",sp:""},{cp:"賽車",z:"",c:"健康運動",sp:""},{cp:"拖掛式房車",z:"",c:"其他",sp:""},{cp:"La mer",z:"",c:"其他",sp:""},{cp:"克蘭詩",z:"",c:"時尚美妝",sp:""},{cp:"萬寶龍",z:"",c:"其他",sp:""},{cp:"Netflix",z:"",c:"其他",sp:"young"},{cp:"家用車",z:"",c:"交通",sp:""},{cp:"化學",z:"",c:"其他",sp:""},{cp:"太極拳",z:"",c:"其他",sp:""},{cp:"Sustainable",z:"永續能源",c:"科技",sp:""},{cp:"素食料理",z:"",c:"美食",sp:""},{cp:"家長：父母",z:"",c:"其他",sp:""},{cp:"最近搬家",z:"",c:"其他",sp:""},{cp:"Working parent",z:"工作父母",c:"教育",sp:""},{cp:"優格",z:"",c:"美食",sp:""},{cp:"智慧型電視",z:"",c:"其他",sp:""},{cp:"硬碟",z:"",c:"科技",sp:""},{cp:"防毒軟體",z:"",c:"其他",sp:""},{cp:"house work",z:"做家事",c:"教育",sp:""},{cp:"電子競技",z:"",c:"娛樂",sp:""},{cp:"Home office",z:"居家辦公家具",c:"家居",sp:""},{cp:"Project management software",z:"專",c:"其他",sp:""},{cp:"影音俱樂部",z:"",c:"其他",sp:""},{cp:"小學和中學教育",z:"",c:"教育",sp:""},{cp:"Trucking",z:"",c:"其他",sp:""},{cp:"待租房屋資訊和內容",z:"",c:"房地產興趣",sp:""},{cp:"Health News",z:"",c:"其他",sp:""},{cp:"National Center for Immunization and Respiratory Diseases",z:"",c:"其他",sp:""},{cp:"Aveda",z:"",c:"其他",sp:""},{cp:"loewe",z:"",c:"其他",sp:""},{cp:"水槽",z:"",c:"家居",sp:""},{cp:"Control system",z:"酒類商品零售商",c:"美食",sp:""},{cp:"Oracle CRM",z:"",c:"其他",sp:""},{cp:"坎城電影節",z:"",c:"其他",sp:""},{cp:"柏林國際電影節",z:"",c:"其他",sp:""},{cp:"金球奬",z:"",c:"其他",sp:""},{cp:"動畫",z:"",c:"娛樂",sp:""},{cp:"太陽能",z:"",c:"科技",sp:""},{cp:"風能",z:"",c:"其他",sp:""},{cp:"固定翼飛機",z:"",c:"其他",sp:""},{cp:"氣象雷達",z:"",c:"其他",sp:""},{cp:"Genetics",z:"遺傳學",c:"其他",sp:""},{cp:"Genetic engineering",z:"基因工程",c:"其他",sp:""},{cp:"Neuroscience",z:"神經科學",c:"其他",sp:""},{cp:"熱量",z:"",c:"其他",sp:""},{cp:"Photography",z:"攝影師",c:"其他",sp:""},{cp:"記憶泡棉",z:"",c:"家居",sp:""},{cp:"5G",z:"",c:"其他",sp:""},{cp:"User experience design",z:"用戶體驗設計",c:"其他",sp:""},{cp:"資料科學",z:"",c:"科技",sp:""},{cp:"Horse training",z:"",c:"其他",sp:""},{cp:"馬術運動",z:"",c:"健康運動",sp:""},{cp:"公路自行車",z:"",c:"健康運動",sp:""},{cp:"http://wix.com/",z:"",c:"其他",sp:""},{cp:"Pinterest",z:"",c:"其他",sp:""},{cp:"Luxury travel",z:"豪華旅遊",c:"旅遊生活",sp:"rich"},{cp:"法國葡萄酒",z:"",c:"其他",sp:""},{cp:"Shenkang",z:"",c:"其他",sp:""},{cp:"Healthy",z:"健康的生活方式",c:"健康運動",sp:""},{cp:"佳士得",z:"",c:"其他",sp:""},{cp:"Art auction",z:"藝術拍賣",c:"其他",sp:"rich"},{cp:"倫敦證券交易所",z:"",c:"金融",sp:""},{cp:"Bilingual education",z:"雙語教育",c:"其他",sp:""},{cp:"滑雪和單板滑雪",z:"",c:"健康運動",sp:""},{cp:"台灣積體電路製造",z:"",c:"其他",sp:""},{cp:"軍功里",z:"",c:"其他",sp:""},{cp:"Education",z:"教育和圖書館",c:"娛樂",sp:""},{cp:"歐洲",z:"",c:"其他",sp:""},{cp:"研究領域：Statistics",z:"",c:"其他",sp:""},{cp:"Minhsiung",z:"",c:"其他",sp:""},{cp:"廂型車",z:"",c:"其他",sp:""},{cp:"軟體",z:"",c:"科技",sp:""},{cp:"Linux",z:"自",c:"其他",sp:"tech"},{cp:"大型多人網路角色扮演遊戲",z:"",c:"娛樂",sp:""},{cp:"Glamping",z:"",c:"其他",sp:""},{cp:"家畜",z:"",c:"農業自然",sp:""},{cp:"Cabinetry",z:"櫥櫃",c:"家居",sp:""},{cp:"牽引機",z:"",c:"交通",sp:""},{cp:"Node.js",z:"",c:"其他",sp:""},{cp:"Tabletop games",z:"桌上遊戲",c:"娛樂",sp:""},{cp:"Scientific",z:"瑜珈教室和教學",c:"健康運動",sp:""},{cp:"Patagonia",z:"",c:"其他",sp:""},{cp:"歐樂B",z:"",c:"其他",sp:""},{cp:"嬌生公司",z:"",c:"時尚美妝",sp:""},{cp:"GNC",z:"",c:"其他",sp:""},{cp:"環境科學",z:"",c:"科技",sp:""},{cp:"主管",z:"",c:"其他",sp:""},{cp:"Shetou",z:"",c:"其他",sp:""},{cp:"R&B/Soul",z:"",c:"其他",sp:""},{cp:"游泳池",z:"",c:"健康運動",sp:""},{cp:"JavaScript",z:"",c:"其他",sp:""},{cp:"C♯",z:"",c:"其他",sp:""},{cp:"Protein shake",z:"蛋白奶昔",c:"其他",sp:""},{cp:"Protein bar",z:"蛋白棒",c:"美食",sp:""},{cp:"攀岩",z:"",c:"其他",sp:""},{cp:"勵志演講人",z:"",c:"其他",sp:""},{cp:"電玩相關內容",z:"",c:"娛樂",sp:""},{cp:"魔物獵人",z:"",c:"娛樂",sp:""},{cp:"俠盜獵車手系列",z:"",c:"其他",sp:""},{cp:"電動自行車",z:"",c:"健康運動",sp:""},{cp:"替代能源",z:"",c:"其他",sp:""},{cp:"可再生能源",z:"",c:"科技",sp:""},{cp:"生態",z:"",c:"科技",sp:""},{cp:"Love Nature",z:"",c:"其他",sp:""},{cp:"紅牛能量飲料",z:"",c:"其他",sp:""},{cp:"Unity",z:"遊戲引擎",c:"其他",sp:"tech"},{cp:"Video game",z:"遊戲設計",c:"其他",sp:"young"},{cp:"虛幻引擎",z:"",c:"其他",sp:""},{cp:"計算機動畫",z:"",c:"其他",sp:""},{cp:"網頁遊戲",z:"",c:"娛樂",sp:""},{cp:"Android Wear",z:"A",c:"其他",sp:"tech"},{cp:"寫生",z:"",c:"其他",sp:""},{cp:"大度橋",z:"",c:"其他",sp:""},{cp:"居家修繕服務和維護",z:"",c:"家居",sp:""},{cp:"使用 Facebook 的管道：Android 裝置",z:"",c:"科技",sp:"tech"},{cp:"Financial planning",z:"財務規劃",c:"其他",sp:""},{cp:"主管級和管理階層工作",z:"",c:"其他",sp:""},{cp:"薪資管理服務",z:"",c:"其他",sp:""},{cp:"Educational resources",z:"教育資源",c:"教育",sp:""},{cp:"Educational resources",z:"教育資源",c:"其他",sp:""},{cp:"商務人士",z:"",c:"其他",sp:""},{cp:"已婚",z:"",c:"其他",sp:""},{cp:"小型雇主",z:"",c:"其他",sp:""},{cp:"Real estate",z:"住宅房地產",c:"商業",sp:"re"},{cp:"新屋",z:"",c:"商業",sp:""},{cp:"新公寓",z:"",c:"商業",sp:""},{cp:"House",z:"房屋",c:"商業",sp:""},{cp:"Apartment",z:"公寓",c:"商業",sp:""},{cp:"婚禮規劃",z:"",c:"其他",sp:""},{cp:"即將結婚",z:"",c:"其他",sp:""},{cp:"剛剛新婚",z:"",c:"其他",sp:""},{cp:"購屋",z:"",c:"其他",sp:""},{cp:"房客",z:"",c:"其他",sp:""},{cp:"電子書",z:"",c:"娛樂",sp:""},{cp:"防蚊液",z:"",c:"其他",sp:""},{cp:"iPhone Lovers",z:"",c:"其他",sp:""},{cp:"Certified Financial Planner",z:"認證理財規劃師",c:"其他",sp:"rich"},{cp:"花旗美邦",z:"",c:"其他",sp:""},{cp:"滙豐",z:"",c:"其他",sp:""},{cp:"瑞銀集團",z:"",c:"其他",sp:""},{cp:"非小說",z:"",c:"娛樂",sp:""},{cp:"創意寫作",z:"",c:"娛樂",sp:""},{cp:"拳擊運動員",z:"",c:"健康運動",sp:""},{cp:"體操項目",z:"",c:"健康運動",sp:""},{cp:"網球選手",z:"",c:"健康運動",sp:""},{cp:"NBA全明星賽",z:"",c:"其他",sp:""},{cp:"美國職棒大聯盟",z:"",c:"其他",sp:""},{cp:"運動科學",z:"",c:"其他",sp:""},{cp:"奧運會項目",z:"",c:"其他",sp:""},{cp:"每日體育報",z:"",c:"其他",sp:""},{cp:"平房",z:"",c:"其他",sp:""},{cp:"Healthy recipes",z:"健康飲食的食譜",c:"美食",sp:""},{cp:"立槳衝浪",z:"",c:"其他",sp:""},{cp:"衝浪裝備和服裝",z:"",c:"健康運動",sp:""},{cp:"夏天",z:"",c:"其他",sp:""},{cp:"中華航空",z:"",c:"其他",sp:""},{cp:"星系",z:"",c:"其他",sp:""},{cp:"太陽系",z:"",c:"其他",sp:""},{cp:"美國國家航空暨太空總署",z:"",c:"其他",sp:""},{cp:"國家地理",z:"",c:"其他",sp:""},{cp:"爬蟲類",z:"",c:"農業自然",sp:""},{cp:"使用 Facebook 的管道：Apple裝置",z:"",c:"科技",sp:""},{cp:"Staycation",z:"宅度假",c:"旅遊生活",sp:""},{cp:"Handicraft",z:"手工藝零售商",c:"商業",sp:""},{cp:"花園建築和裝飾",z:"",c:"家居",sp:""},{cp:"園林設計",z:"",c:"家居",sp:""},{cp:"後院",z:"",c:"家居",sp:""},{cp:"Wine",z:"葡萄酒",c:"美食",sp:""},{cp:"感情狀況：單身",z:"",c:"其他",sp:""},{cp:"小說",z:"",c:"娛樂",sp:""},{cp:"烤肉架",z:"",c:"家居",sp:""},{cp:"自然科學",z:"",c:"其他",sp:""},{cp:"哲學",z:"",c:"其他",sp:""},{cp:"森林生態學",z:"",c:"其他",sp:""},{cp:"夏令營",z:"",c:"其他",sp:""},{cp:"社會",z:"",c:"其他",sp:""},{cp:"Biomedical sciences",z:"",c:"其他",sp:""},{cp:"研究領域：Biomedical engineering",z:"",c:"其他",sp:""},{cp:"MG",z:"",c:"其他",sp:""},{cp:"Lexus NX",z:"",c:"其他",sp:""},{cp:"學校：國防大學",z:"",c:"其他",sp:""},{cp:"Radio station",z:"",c:"其他",sp:""},{cp:"Restaurant management",z:"",c:"其他",sp:""},{cp:"衛生紙",z:"",c:"其他",sp:""},{cp:"員林",z:"",c:"其他",sp:""},{cp:"豬肉",z:"",c:"其他",sp:""},{cp:"汽油",z:"",c:"其他",sp:""},{cp:"石英",z:"",c:"其他",sp:""},{cp:"輪胎",z:"",c:"交通",sp:""},{cp:"掀背車",z:"",c:"交通",sp:""},{cp:"Terrace",z:"露台",c:"其他",sp:""},{cp:"香檳",z:"",c:"美食",sp:""},{cp:"街頭健身",z:"",c:"其他",sp:""},{cp:"Running",z:"跑步機",c:"其他",sp:""},{cp:"JYP娛樂",z:"",c:"其他",sp:""},{cp:"SM娛樂",z:"",c:"其他",sp:""},{cp:"社群和俱樂部類粉絲專頁管理員",z:"",c:"其他",sp:""},{cp:"美妝情報資訊粉絲分享團",z:"",c:"其他",sp:""},{cp:"企劃",z:"",c:"其他",sp:""},{cp:"社會運動",z:"",c:"社會",sp:""},{cp:"MacBook Pro",z:"",c:"其他",sp:""},{cp:"地緣政治學",z:"",c:"其他",sp:""},{cp:"英偉達",z:"",c:"其他",sp:""},{cp:"四輪驅動",z:"",c:"交通",sp:""},{cp:"Road trip",z:"公路旅行",c:"娛樂",sp:""},{cp:"清潔劑",z:"",c:"家居",sp:""},{cp:"力學",z:"",c:"其他",sp:""},{cp:"日本流行文化",z:"",c:"其他",sp:""},{cp:"圖形處理器",z:"",c:"其他",sp:""},{cp:"水淨化",z:"",c:"其他",sp:""},{cp:"爵士樂",z:"",c:"娛樂",sp:""},{cp:"Art",z:"塗鴉藝術家",c:"娛樂",sp:""},{cp:"Music",z:"音樂創作者",c:"其他",sp:""},{cp:"Art school",z:"",c:"其他",sp:""},{cp:"Weekend Trips",z:"",c:"其他",sp:""},{cp:"Consulting",z:"顧問諮詢業",c:"金融",sp:""},{cp:"Art gallery",z:"國家藝廊",c:"其他",sp:""},{cp:"High-end audio",z:"",c:"其他",sp:""},{cp:"現代主義",z:"",c:"其他",sp:""},{cp:"超威半導體",z:"",c:"其他",sp:""},{cp:"摩根大通",z:"",c:"其他",sp:""},{cp:"搬家公司",z:"",c:"其他",sp:""},{cp:"新婚",z:"",c:"社會",sp:""},{cp:"Babyshop",z:"",c:"時尚美妝",sp:""},{cp:"Business leaders",z:"商業領袖",c:"商業",sp:"hidden"},{cp:"Office supplies",z:"辦公室用品",c:"商業",sp:"hidden"},{cp:"Health",z:"一般健康",c:"健康運動",sp:"hidden"},{cp:"Centers for Disease Control and Prevention",z:"美國疾病與預防控制中心",c:"健康運動",sp:"hidden"},{cp:"Award shows",z:"影視獎項",c:"娛樂",sp:"young"},{cp:"Recreational fishing",z:"休閒釣魚",c:"旅遊生活",sp:"hidden"},{cp:"Extreme sports",z:"極限運動",c:"健康運動",sp:"young"},{cp:"Esports leagues and competitions",z:"電競聯盟和競賽",c:"娛樂",sp:"young"},{cp:"Fitness professional",z:"專業健身人士",c:"健康運動",sp:"hidden"},{cp:"Real estate listing websites",z:"房屋廣告和入口網站",c:"房地產興趣",sp:"re"},{cp:"House painters and decorators",z:"房屋油漆工和裝修師",c:"房地產興趣",sp:"re"},{cp:"Real estate web",z:"房地產行銷和培訓",c:"房地產興趣",sp:"re"},{cp:"Viral video",z:"爆紅影片",c:"娛樂",sp:"young"},{cp:"Household",z:"居家用品零售商、家庭",c:"家居",sp:"hidden"},{cp:"LifeStyle Home",z:"生活風格家居",c:"家居",sp:"hidden"},{cp:"Motherhood",z:"育兒雜誌",c:"教育",sp:"hidden"},{cp:"Family travel",z:"家庭桌遊",c:"旅遊生活",sp:"hidden"},{cp:"Kids activities",z:"兒童活動",c:"教育",sp:"hidden"},{cp:"Cultural",z:"交換學生",c:"教育",sp:"hidden"},{cp:"Design studios",z:"嬰幼兒和孕婦用品店",c:"教育",sp:"hidden"},{cp:"Healthy",z:"健康的生活習慣",c:"健康運動",sp:"hidden"},{cp:"Nutritional supplements",z:"維他命和營養補充品",c:"健康運動",sp:"hidden"},{cp:"Nursing",z:"護理教育",c:"教育",sp:"civil"},{cp:"BACK",z:"健康食品品牌",c:"健康運動",sp:"hidden"},{cp:"Nutrition",z:"人體營養",c:"健康運動",sp:"hidden"},{cp:"House work",z:"做家事",c:"家居",sp:"hidden"},{cp:"Protein",z:"蛋白棒、蛋白奶昔、蛋白質",c:"健康運動",sp:"hidden"},{cp:"Healthy recipes",z:"健康飲食的食譜",c:"美食",sp:"hidden"},{cp:"Gazebo",z:"花園建築和裝飾",c:"家居",sp:"hidden"},{cp:"Payment service provider",z:"支付服務商",c:"金融",sp:"hidden"},{cp:"Project management software",z:"專案管理軟體",c:"商業",sp:"tech"},{cp:"Electrical wiring",z:"電氣配線",c:"家居",sp:"hidden"},{cp:"Trade shows",z:"設計貿易展和專業組織",c:"商業",sp:"hidden"},{cp:"Employee engagement",z:"員工敬業度",c:"商業",sp:"hidden"},{cp:"Medical Sales Representative",z:"醫療業務代表",c:"商業",sp:"hidden"},{cp:"Freight transport",z:"運輸和物流服務和組織",c:"商業",sp:"hidden"},{cp:"Work from home",z:"遠距工作",c:"商業",sp:"tech"},{cp:"Customer support",z:"客戶支援",c:"商業",sp:"hidden"},{cp:"Christie's",z:"佳士得、藝術奢侈品拍賣",c:"旅遊生活",sp:"rich"},{cp:"Sotheby's",z:"蘇富比、藝術奢侈品拍賣",c:"旅遊生活",sp:"rich"},{cp:"Fine dining",z:"高級餐飲愛好者",c:"美食",sp:"rich"},{cp:"Boutique",z:"女性精品服飾零售商",c:"時尚美妝",sp:"hidden"},{cp:"Jewelry",z:"客製化禮品或服裝",c:"時尚美妝",sp:"hidden"},{cp:"FineDiningLovers",z:"精緻料理愛好者",c:"美食",sp:"rich"},{cp:"Foodie",z:"美食家",c:"美食",sp:"hidden"},{cp:"KIND Healthy Snacks",z:"健康零食品牌",c:"美食",sp:"hidden"},{cp:"Food trucks",z:"飲食業",c:"美食",sp:"hidden"},{cp:"Tea leaf",z:"茶葉品牌",c:"美食",sp:"hidden"},{cp:"Foodservice",z:"餐飲業",c:"美食",sp:"hidden"},{cp:"LifeStyle Food",z:"輕食、均衡飲食",c:"美食",sp:"hidden"},{cp:"Weekend",z:"男裝品牌、女裝品牌",c:"時尚美妝",sp:"hidden"},{cp:"Collectible",z:"收藏用玩具、集換卡片遊戲",c:"娛樂",sp:"hidden"},{cp:"Fragrance oil",z:"香精油",c:"時尚美妝",sp:"hidden"},{cp:"HydraFacial",z:"海菲秀",c:"時尚美妝",sp:"hidden"},{cp:"Fashion Tech",z:"時尚機構",c:"時尚美妝",sp:"hidden"},{cp:"Video game culture",z:"電子遊戲文化",c:"娛樂",sp:"young"},{cp:"Digital media",z:"數位媒體",c:"娛樂",sp:"hidden"},{cp:"Work from Home",z:"遠距工作",c:"商業",sp:"tech"},{cp:"DeFi",z:"時裝周、時裝秀",c:"時尚美妝",sp:"young"},{cp:"Lifestyle brand",z:"生活風格品牌",c:"旅遊生活",sp:"hidden"},{cp:"Lifestyle Travel",z:"貼近日常、深入在地",c:"旅遊生活",sp:"hidden"},{cp:"Lifestyle content",z:"節儉生活風格",c:"旅遊生活",sp:"hidden"},{cp:"Outdoor living",z:"戶外生活",c:"旅遊生活",sp:"hidden"},{cp:"Hiking equipment",z:"健行和露營裝備",c:"旅遊生活",sp:"hidden"},{cp:"Travel Deals",z:"旅行優惠",c:"旅遊生活",sp:"hidden"},{cp:"Brunch",z:"派對策劃",c:"旅遊生活",sp:"hidden"},{cp:"Happy hour",z:"歡樂時光",c:"旅遊生活",sp:"hidden"},{cp:"Christmas Holiday",z:"聖誕假期",c:"旅遊生活",sp:"hidden"},{cp:"Birdwatching",z:"觀鳥",c:"旅遊生活",sp:"hidden"},{cp:"Tiny House Movement",z:"居家風格和生活類型",c:"家居",sp:"hidden"},{cp:"Skyscanner",z:"機票比價平台",c:"旅遊生活",sp:"hidden"},{cp:"Cheapflights",z:"機票比價平台",c:"旅遊生活",sp:"hidden"},{cp:"Self-guided tour",z:"自助導覽",c:"旅遊生活",sp:"hidden"},{cp:"Chinese Culture",z:"中華文化",c:"社會",sp:"civil"},{cp:"Art gallery",z:"國家藝廊",c:"娛樂",sp:"civil"},{cp:"High-end audio",z:"高端音響",c:"科技",sp:"rich"},{cp:"Weekend Trips",z:"週末旅遊",c:"旅遊生活",sp:"hidden"},{cp:"Investment club",z:"房地產投資俱樂部",c:"房地產興趣",sp:"re"},{cp:"Open house",z:"建築媒體",c:"房地產興趣",sp:"re"},{cp:"Rental listings",z:"待租房屋資訊和內容",c:"房地產興趣",sp:"re"},{cp:"Benefit",z:"退伍軍人福利",c:"社會",sp:"civil"},{cp:"Retirement Insurance Benefits",z:"國民年金、退休保險",c:"金融",sp:"civil"},{cp:"Lending",z:"信貸服務和組織",c:"金融",sp:"hidden"},{cp:"Foreign company",z:"通貨",c:"金融",sp:"hidden"},{cp:"TechRadar",z:"全球科技媒體網站",c:"科技",sp:"tech"},{cp:"Geek.com",z:"美國科技新聞網站",c:"科技",sp:"tech"},{cp:"Physical security",z:"保護人員和財產的安全措施",c:"科技",sp:"tech"},{cp:"Top Gear",z:"極速誌",c:"交通",sp:"hidden"},{cp:"Android Wear",z:"Android智慧手錶作業系統",c:"科技",sp:"tech"},{cp:"Gadget & Gear",z:"電子產品、戶外裝備和配件",c:"科技",sp:"tech"},{cp:"Consumer Electronics Show",z:"消費電子展",c:"科技",sp:"tech"},{cp:"Software development",z:"基於組件的軟體工程",c:"科技",sp:"tech"},{cp:"GameFAQs",z:"電玩遊戲網路媒體",c:"娛樂",sp:"young"},{cp:"Forklift",z:"叉車",c:"交通",sp:"hidden"},{cp:"Family car",z:"家用車",c:"交通",sp:"hidden"},{cp:"Enterprise Rent-A-Car",z:"企業租車",c:"交通",sp:"hidden"},{cp:"Linux",z:"自由和開放原始碼的類Unix作業系統",c:"科技",sp:"tech"},{cp:"Unity",z:"遊戲引擎",c:"科技",sp:"tech"},{cp:"DevOps",z:"開發微運整合",c:"科技",sp:"tech"},{cp:"Longlining",z:"延繩捕魚",c:"農業自然",sp:"hidden"}];
const YOU=[{ta:"30-60 / 公務員 教職",proj:"晴山白里",tags:"廚房::家居||閱讀::娛樂||Gardening::旅遊生活||Parenting::教育||Home improvement::家居||591房屋交易網::其他||Early childhood education::教育||Education::社會||大自然::科技||Cycling::健康運動||書籍::娛樂||Household::社會||Real estate::科技||Cooking::美食||質感設計::其他",loc:"Hong、Wen、International、School、后里運動公園、豐原車站、台中環線、台中市、Taichung",lx:"訊息"},{ta:"35-65 / 開店 投資",proj:"錢連",tags:"Passive income::商業||Real estate investing::金融||Wealth::金融||Real estate::房地產興趣||公司::其他||收入::商業||Entrepreneurship::商業||Business::商業||獨資企業::商業||Franchising::商業||Startups::商業||居家事業::商業",loc:"慈眀高中、環中東路七段、台中市、環中東路三段、台中市、Taichung",lx:"訊息"},{ta:"30-65 / 彰化 國道1沿線 / 工業 置產 / $356、20名單",proj:"新都峰",tags:"加工出口工廠::其他||Manufacturing::科技||Food industry::其他||Textile industry::其他||Investment::商業||Real estate::科技||Return on investment::金融||批發::商業||News media::娛樂||Current events::社會||Online shopping::商業||Personal finance::金融",loc:"南屯工業區、烏日高鐵站、彰化車站、追分車站",lx:"名單"},{ta:"28-60 / 科技工業 賺錢 / $97、58訊息",proj:"大興家園",tags:"Wealth::金融||Investment::商業||收入::商業||Automobile::交通||電子商務::商業||Stock market::金融||Badminton::球拍類運動||酒精飲品::美食||Real estate::科技||House::房地產興趣||591房屋交易網::其他||樂屋網::其他",loc:"",lx:"訊息"},{ta:"30-55 / 教職員 休閒 / $118、16訊息",proj:"大興家園",tags:"書籍::娛樂||廚房::家居||Education::社會||大自然::科技||Household::社會||Cooking::美食||Travel::科技||休閒活動::旅遊生活||假期::旅遊生活||Real estate::科技||591房屋交易網::其他||樂屋網::其他",loc:"",lx:"訊息"},{ta:"30-64 / 高知識  財經",proj:"松恩頌子鳥",tags:"學術研討會::其他||研究::其他||展覽館::其他||Higher education::教育||Education::社會||Investment::商業||新聞播報::娛樂||大眾媒體::娛樂||財經::商業||House::房地產興趣||591房屋交易網::其他",loc:"",lx:"名單"},{ta:"30-60  / 科技新貴 旅遊",proj:"松恩頌子鳥",tags:"智慧科技::科技||Artificial intelligence::科技||Big data::科技||新興技術::科技||Travel::旅遊生活||飯店::旅遊生活||http://booking.com/::旅遊生活||http://hotels.com/::旅遊生活||Trivago::其他||Real estate::科技||House::房地產興趣||免稅商店::其他",loc:"",lx:"名單"},{ta:"35-60 / 清水 神岡 潭子 / 藍領+日用品",proj:"中科峇里島17",tags:"工廠::商業||加工出口工廠::其他||Manufacturing::科技||物流::商業||Insurance::商業||保單::金融||Household::社會||超市::美食||量販店::美食||家樂福::其他||Home improvement::家居||五金行::商業||Real estate::科技||591房屋交易網::其他",loc:"",lx:"訊息"},{ta:"28-55 / 金融+運動",proj:"光華盛璟",tags:"Luxury vehicle::交通||收入::商業||Stock market::金融||金錢::金融||數位貨幣::金融||體育::其他||運動::健康運動||Running::健康運動||Wealth::金融||Foreign exchange market::金融||戶外休閒活動::旅遊生活||House::房地產興趣||591房屋交易網::其他",loc:"竹南科學園區、新竹科學工業園區、竹南獅山親子公園",lx:"訊息"},{ta:"30-55 / 台3 74沿/ 新婚上班族",proj:"大漁樂芙",tags:"求婚::旅遊生活||婚禮::社會||Travel::旅遊生活||Booking.com::旅遊生活||Trivago::其他||Hotels.com::旅遊生活||Coffee::美食||星巴克::美食||宜家家居::商業||家電::科技||591房屋交易網::其他||Real estate listing websites::科技",loc:"",lx:"訊息"},{ta:"65-65 / 教職員+房產興趣",proj:"中科峇里島17",tags:"News media::娛樂||書籍::娛樂||文化::社會||財經::商業||Television::其他||Education::社會||圖書館::其他||House::房地產興趣||Apartment::房地產興趣||Real estate investing::金融||591房屋交易網::其他||Real estate listing websites::科技",loc:"",lx:"訊息"},{ta:"30-60 / 傳產 公務員 / $244、11訊息",proj:"新都峰",tags:"Skin care::其他||維修和操作::房地產興趣||Manufacturing::科技||物流::商業||工廠::商業||機械加工::其他||工具機::家居||批發::商業||機器::其他||經銷::商業||House::房地產興趣||591房屋交易網::其他||White-collar worker::娛樂||Social media::網路媒體",loc:"",lx:"訊息"},{ta:"30-60 / 設計+休閒",proj:"光華盛璟",tags:"Interior design::商業||Design::商業||住家修繕::居家裝修||平面設計::娛樂||網站設計::科技||Fashion::商業||服裝::時尚美妝||休閒娛樂::社會||休閒遊戲::娛樂||Online shopping::商業||百貨公司::商業||House::房地產興趣||Real estate listing websites::科技||Home improvement::家居||休閒餐廳::美食||Beauty::社會||居家事業::商業",loc:"",lx:"訊息"},{ta:"30-60 / 純房產興趣",proj:"大漁樂芙",tags:"House::房地產興趣||Condominium::房地產興趣||起步房::房地產興趣||591房屋交易網::其他||Real estate listing websites::科技||Real estate::金融||Leasing::房地產興趣||由擁有者出售::房地產興趣",loc:"",lx:"訊息"},{ta:"30-55 / 軍公教 / $131、80",proj:"至善人本",tags:"學習::教育||書籍::娛樂||News media::娛樂||學校::教育||社區議題::法律與政府||Household::社會||LifeStyle Food::時尚美妝||健康和保健::時尚美妝||Social media::網路媒體||政府機關概念和作法::社會",loc:"",lx:"訊息"},{ta:"28-60 / 科技質感興趣 / $103、117",proj:"至善人本",tags:"Apple Watch::科技||智慧科技::科技||Wearable technology::科技||新興技術::科技||Internet of things::其他||Business::金融||Online shopping::商業||Fashion::商業||Interior design::商業||現代家具::家居||宜家家居::商業||Current events::社會||Food::美食||排屋::其他||Townhouse::房地產興趣",loc:"",lx:"訊息"},{ta:"28-60 / 北屯太平東區 / 年輕自住 / $131、61訊息",proj:"大興家園",tags:"服裝::時尚美妝||購物中心::商業||Beauty::社會||Fashion::時尚美妝||Cosmetics::時尚美妝||Personal finance::金融||儲蓄::金融||熱門話題::其他||Online banking::金融||Online shopping::商業||淘寶網::其他||momo購物網::其他||Mobile payment::金融||LINE::其他||行動應用程式::科技||流行音樂::娛樂||Beer::美食||UberEATS::其他||運動::健康運動||591房屋交易網::其他||Real estate listing websites::科技",loc:"",lx:"訊息"},{ta:"**30-60 / 中科南屯南區 / 年輕人興趣",proj:"元境大喜",tags:"戶外::旅遊生活||Artificial intelligence::科技||Interior design::商業||White-collar worker::娛樂||程式語言::科技||Information technology::科技||Art exhibitions::娛樂||Parenting::教育||網站開發::科技||Online shopping::商業||航空公司::其他||Investment::商業||軟體開發::科技||餐廳::美食||星巴克::美食||零售業::科技||電腦程式設計::科技||科技::科技||Travel::旅遊生活||Trivago::其他||Booking.com::旅遊生活",loc:"",lx:"名單"},{ta:"28-55 / 神岡豐原中科 / 年輕娛樂",proj:"中科峇里島17",tags:"YCM 永進機械 Yeong Chin Machinery Industries Co.::其他||服裝::時尚美妝||購物中心::商業||Beauty::社會||Fashion::時尚美妝||快時尚::時尚美妝||儲蓄::金融||Personal finance::金融||熱門話題::其他||Online banking::金融||淘寶網::其他||Online shopping::商業||Mobile payment::金融||LINE::其他||行動應用程式::科技||Craft brewing::美食||運動::健康運動||休閒娛樂::社會||Netflix::娛樂||Spotify::娛樂||591房屋交易網::其他",loc:"",lx:"訊息"},{ta:"30-60 / 豐原潭子后里 / 有小孩寵物",proj:"晴山白里",tags:"Parenting::教育||廚房::家居||Interior design::商業||現代家具::家居||家電::科技||Early childhood education::教育||生活用品::家居||運動::健康運動||暑假::教育||草地::家居||任天堂::遊戲機和相關配件||Pet::農業自然||Dog grooming::農業自然||Dog walking::狗狗||犬隻健康::農業自然||貓糧::農業自然",loc:"",lx:"訊息"},{ta:"30-60 / 太平74沿 / 創業 經營 美業",proj:"錢連全联",tags:"居家事業::商業||收入::商業||食品和飲品::美食||指甲彩繪::時尚美妝||美甲::時尚美妝||美甲沙龍::時尚美妝||足部護理::時尚美妝||Keratin::其他||髮型::時尚美妝||自僱::商業||律師::法律和法律服務||自由工作者::商業||律師事務所::法律和法律諮詢服務||零售業::科技||批發::商業||經銷::商業||早午餐::美食||Small business::其他",loc:"",lx:"訊息"},{ta:"35-65 / 太平 大里 74沿 / 開店 投資",proj:"錢連全联",tags:"公司::商業||Personal finance::金融||Business model::金融||Passive income::商業||Startups::商業||Entrepreneurship::商業||獨資企業::商業||Investment::商業||Business::商業||Real estate investing::金融||Wealth::金融||居家事業::商業||Real estate::房地產興趣||收入::商業",loc:"",lx:"訊息"},{ta:"30-60 / 太平大里 / 在地高收入",proj:"錢連鋼骨雙併",tags:"Taiwankou::其他||T'Ai-Wan::其他||醫學院::教育||律師::法律和法律服務||法律::法律和法律服務||科學::期刊||軟體開發::科技||程式語言::科技||Software engineering::科技||電腦科學::科技||網站開發::科技||Fitness::健康運動||Consumer electronics::科技||Household::社會||Business model::金融||轎車::交通||House::房地產興趣||別墅::旅遊生活",loc:"",lx:"訊息"},{ta:"30-60 / 北屯太平 / 年輕娛樂",proj:"AI識別：時尚美妝/科技",tags:"服裝::時尚美妝||Online shopping::商業||Fashion::時尚美妝||Beauty::時尚美妝||髮型::時尚美妝||快時尚::時尚美妝||Mobile payment::金融||MBA::金融||LINE::其他||Netflix::娛樂||流行音樂::娛樂||休閒娛樂::社會||麥當勞::美食||街頭時尚::時尚美妝||運動場所::健康運動||Personal finance::金融||燒烤::美食||Beer::美食||假期::旅遊生活||591房屋交易網::其他",loc:"",lx:""},{ta:"28-55 / 頭份竹南竹北 / 職業+房產",proj:"富廣ONNI",tags:"網路名人::其他||YouTube::娛樂||Social media marketing::商業||Business model::金融||Affiliate marketing::商業||電子商務::商業||自由工作者::商業||自僱::商業||Passive income::商業||直銷::其他||獨資企業::商業||Entrepreneurship::金融||居家事業::商業||591房屋交易網::其他||House::房地產興趣||網紅創作者::其他",loc:"",lx:"1510"},{ta:"27-55 / 中科世貿 / 年輕工程師",proj:"惠田映悅",tags:"Artificial intelligence::科技||Big data::科技||Software engineering::科技||軟體開發::科技||電腦程式設計::科技||Information technology::科技||電腦工程::科技||Machine learning::科技||任天堂::遊戲機和相關配件||Python::程式語言||PlayStation::遊戲機||UberEATS::其他||酒精飲品::美食||Food::美食||市場趨勢::金融||數位貨幣::金融",loc:"",lx:"名單"},{ta:"**27-60/ 西屯中科 /銀行 精算師",proj:"惠田好日子",tags:"財經::商業||Accounting::商業||Personal finance::金融||Financial planning::金融||金融服務::商業||Banking::金融||Entrepreneurship::商業||Investment::商業||財務會計::商業||Business::商業||Wealth management::金融||Small business::其他",loc:"",lx:"名單"},{ta:"28-55 / 鹿港和美福興 / 年輕 育兒 首購 / $199、27訊息",proj:"青成康堤",tags:"生產::其他||Parenting::其他||新生兒派對::教育||Household::社會||White-collar worker::娛樂||LINE::其他||傢俱::家居||Interior design::商業||熱門話題::其他||淘寶網::其他||Online shopping::科技||Popular culture::社會||促銷::商業||婚禮::社會||Beauty::社會||iPhone::科技||Personal finance::金融||591房屋交易網::其他||Real estate::科技",loc:"",lx:"訊息"},{ta:"27-60 / 十期 / 行銷 小資族",proj:"惠田好日子",tags:"Marketing::商業||Digital marketing::商業||折扣商店::商業||綜藝節目::娛樂||傢俱::家居||韓國電視劇::娛樂||Influencer marketing::商業||Online shopping::商業||居家裝潢零售商::商業||廣告::商業||Design::商業||政府::社會||行政服務::其他||宜家家居::商業||雅高達::其他||銀行帳戶::金融||Business model::金融||簡餐館::美食",loc:"",lx:"名單"},{ta:"28-55 / 大里霧峰 / 理財 儲蓄",proj:"大漁樂芙",tags:"儲蓄::金融||儲蓄帳戶::金融||存款帳戶::金融||儲蓄互助社::其他||Financial planning::金融||信用額度::金融||金錢::金融||Passive income::商業||Investment::商業||現金::其他||Stock market::金融||White-collar worker::娛樂||優惠券::商業||折扣和折讓::商業||7-11::其他||便利商店::商業||超市::美食||熱門話題::其他||591房屋交易網::其他",loc:"",lx:"名單"},{ta:"27-55 / 竹科巨城 / 旅遊 年輕工程師",proj:"美麗華山美",tags:"Artificial intelligence::科技||Big data::科技||新興技術::科技||Semiconductor::其他||Internet of things::其他||Business::金融||軟體開發::科技||Software engineering::科技||iPhone::科技||Python::程式語言||GitHub::其他||Food::美食||Travel::旅遊生活||http://booking.com/::旅遊生活||免稅商店::其他||Interior design::商業||Wine tasting::美食||數位貨幣::金融",loc:"",lx:"訊息"},{ta:"30-60 / 竹科竹東 / 研究 高知識",proj:"美麗華山美",tags:"研究所教育::教育||科學::期刊||研究::其他||文學::娛樂||Education::教育||新興技術::科技||實驗室::其他||Investment::商業||財經::商業||新聞播報::娛樂||智慧科技::科技||工程和理工學院::教育||理工學院::其他",loc:"",lx:"訊息"},{ta:"27-55 / 西屯中科水湳 / 會計 金融顧問",proj:"惠田好日子",tags:"金錢::金融||Passive income::商業||Investment::金融||Financial planning::金融||Asset management::金融||經濟學::金融||Accounting::其他||註冊會計師::其他||Private banking::其他||財務顧問::金融||納斯達克100指數::其他||當沖交易::金融||私募基金::其他||Private equity::金融||電腦運算::其他||財經::商業||財務會計::商業||Business::商業||Real estate investing::金融||Wealth management::金融||道瓊斯工業平均指數::其他||證券交易所::金融||股份::金融",loc:"",lx:"名單"},{ta:"28-60 / 大林大埔美 / 藍領 休閒",proj:"中祐雅苑",tags:"儲蓄::金融||White-collar worker::娛樂||超市::美食||配電系統::其他||Personal finance::金融||折扣和折讓::商業||Insurance::商業||技術員::其他||數位相機::相機和相機設備||Food industry::其他||玻璃::其他||Household::社會||佳能企業::其他||代工生產::其他||休閒活動::旅遊生活||Industrial engineering::科技||科技::科技||製造生產服務和組織::商業||Commuting::其他",loc:"",lx:"訊息"},{ta:"30-55 / 清水神岡潭子 / 工業 儲蓄 家居",proj:"中科峇里島17",tags:"工廠::商業||保單::金融||傢俱::家居||Personal finance::金融||技術員::其他||食品::美食||家樂福::其他||家電::科技||Manufacturing::科技||生活用品::家居||機械工程::科技||製造生產服務和組織::商業",loc:"",lx:"訊息"},{ta:"28-55 / 鹿港和美福興 / 藍領 銀行保險 / $203、24訊息",proj:"青成康堤",tags:"保單::金融||Life insurance::金融||業務::商業||零售銀行業務::金融||Investment::金融||Banking::金融||金融服務::商業||證券交易所::金融||股市指數::金融||技術員::其他||Manufacturing::科技||製造生產服務和組織::商業||工廠::商業||Stock broker::金融||配電系統::其他||代工生產::其他||White-collar worker::娛樂||熱門話題::其他",loc:"",lx:"訊息"},{ta:"28-55 / 南區東區太平 / 餐廳 串流媒體",proj:"大漁樂芙",tags:"簡餐館::美食||甜點::美食||在地美食::美食||烘培坊::美食||火鍋::其他||燒烤::美食||韓式料理::美食||Gourmet::美食||壽司::美食||鮭魚::其他||Netflix::娛樂||Spotify::娛樂||Apple Music::其他||YouTube::娛樂||UberEATS::其他||Mobile payment::金融",loc:"",lx:"名單"},{ta:"28-60 / 竹南竹北 / 教育 生活",proj:"富廣ONNI",tags:"Language education::其他||外語::其他||航空公司::其他||Education::社會||工程和理工學院::教育||Travel::旅遊生活||慢跑::跑步||Gardening::家居||超市::美食||生活用品::家居||韓國電視劇::娛樂||Beauty::社會||美學::社會||Business model::金融||Coffee::美食",loc:"",lx:"1510"},{ta:"28-55 / 南區東區太平 / 年輕創業 ",proj:"大漁樂芙",tags:"居家事業::商業||Passive income::商業||自僱::商業||女性企業家::商業||獨資企業::商業||Entrepreneurship::金融||美學::社會||Design::商業||Beauty::社會||Business model::金融||Marketing::商業||Photography::娛樂||Keratin::其他||髮型::時尚美妝||Interior design::商業||零售業::科技||Business::商業||Small business::其他",loc:"",lx:"名單"},{ta:"25-55 / 大台中 /百葉簾 家具",proj:"臻富裕",tags:"Home improvement::家居||Interior design::商業||現代家具::家居||百葉簾::其他||窗戶::房地產興趣||宜家家居::商業||居家飾品::家居||居家裝潢零售商::商業||美學::社會||Lifestyle::旅遊生活||Household::商業||LifeStyle Home::其他||室內建築::房地產興趣||Home renovation::家居||Architecture & Interior Design::其他",loc:"",lx:"訊息"},{ta:"28-55 / 中科西屯 / 工程師興趣",proj:"永尚樾山丘",tags:"軟體開發::科技||Big data::科技||Artificial intelligence::科技||新興技術::科技||智慧科技::科技||Stock market::金融||棒球::健康運動||NBA季後賽::其他||Mobile payment::金融||Google電子錢包::其他||Uber::商業||Information technology::科技||Trivago::其他||http://geek.com/::其他||Travel::科技||GitHub::其他||Fitness::健康運動||重量訓練::健康運動||智慧裝置::科技||雞肉::食品||羅技::其他||Razer::其他",loc:"",lx:"訊息"},{ta:"28-55 / 大林新港 / 家庭主婦",proj:"中祐雅苑",tags:"廚房::家居||廚具::家居||餐具::其他||家電::科技||家務::家居||中式料理::美食||生活用品::家居||Household::社會||Parenting::教育||Personal finance::金融||優惠券::商業||超市::美食||一般保險::金融||591房屋交易網::其他||Financial planning::金融||Home improvement::家居",loc:"",lx:"訊息"},{ta:"28-55 / 十期東區 / 餐廳 串流媒體 / $125、90訊息",proj:"大興家園",tags:"簡餐館::美食||甜點::美食||在地美食::美食||烘培坊::美食||火鍋::其他||燒烤::美食||韓式料理::美食||Gourmet::美食||壽司::美食||鮭魚::其他||Netflix::娛樂||Spotify::娛樂||Apple Music::其他||YouTube::娛樂||UberEATS::其他||Mobile payment::金融||速食休閒餐廳::美食||速食餐廳::美食||自助餐::其他||真人實境秀::娛樂",loc:"",lx:"訊息"},{ta:"28-60 / 伸港鹿港龍井大肚 / 有小孩寵物 / $166、23",proj:"至善人本",tags:"Parenting::教育||廚房::家居||Interior design::商業||現代家具::家居||家電::科技||Early childhood education::教育||生活用品::家居||運動::健康運動||暑假::教育||草地::家居||任天堂::遊戲機和相關配件||Pet::農業自然||Dog grooming::農業自然||犬隻健康::農業自然||Dog walking::狗狗||貓糧::農業自然||排屋::其他||別墅::旅遊生活",loc:"",lx:"訊息"},{ta:"27-55 / 十期 / 行銷設計",proj:"原潮APT",tags:"Marketing::商業||Digital marketing::商業||折扣商店::商業||綜藝節目::娛樂||傢俱::家居||韓國電視劇::娛樂||Influencer marketing::商業||Online shopping::商業||居家裝潢零售商::商業||廣告::商業||Design::商業||政府::社會||平面設計::娛樂||服裝::時尚美妝",loc:"",lx:"名單"},{ta:"28-60 / 伸港鹿港和美 / 零售批發自營 / $92、142",proj:"至善人本",tags:"零售業::科技||批發::商業||經銷::商業||供應鏈::其他||居家事業::商業||Small business::商業||銀行帳戶::金融||貿易::金融||電子商務::商業||Marketing::商業||Social media marketing::商業||Influencer marketing::商業||Business model::金融||Online shopping::商業||Internet of things::其他||排屋::其他||Townhouse::房地產興趣||火鍋::其他||速食休閒餐廳::美食||Apple Watch::科技",loc:"",lx:"訊息"},{ta:"28-60 / 秀水埔鹽福興 / 在地產業",proj:"(傑芳) 維瓦第明日City",tags:"Food industry::其他||包裝和標籤::商業||製造生產服務和組織::商業||機械加工::其他||Electrical engineering::其他||保單::金融||超市::美食||技術員::其他||Automobile::交通||休閒餐廳::美食||Online shopping::商業||Digital media::科技||家電::科技||Home improvement::家居||彩券::娛樂||Cycling::交通",loc:"",lx:"名單"},{ta:"27-55 / 十期 / 財會 公務員",proj:"惠田好日子",tags:"Accounting::其他||政府::社會||Current events::社會||News media::娛樂||傢俱::家居||韓國電視劇::娛樂||壽司::美食||燒牛肉::其他||鮭魚::其他||Interior design::商業||科技::科技||政府員工::社會||保護服務::其他||財務會計::商業||Cloud computing::科技||Private banking::其他||財政預算案::其他||快時尚::時尚美妝||簿記::其他",loc:"",lx:"名單"},{ta:"27-55 / 中科南屯烏日 / 食衣住行",proj:"原潮APT",tags:"住宿加早餐酒店::其他||http://booking.com/::旅遊生活||Food::美食||火鍋::其他||日本料理::美食||牛肉::美食||服裝::時尚美妝||襯衫::時尚美妝||Fashion::時尚美妝||Electric vehicle::交通||BMW::交通||特斯拉汽車::交通||購物中心::商業||配送::商務||UberEATS::其他",loc:"",lx:"名單"},{ta:"28-55 / 南區東區太平 / 網紅行銷 美食",proj:"大漁樂芙",tags:"Social media marketing::商業||Influencer marketing::商業||病毒營銷::其他||Lead generation::商業||Instagram::科技||Online advertising::商業||速食休閒餐廳::美食||烘培坊::美食||鮭魚::其他||Apple Music::其他||YouTube::娛樂||Mobile payment::金融||韓式料理::美食||蛋糕::美食",loc:"",lx:"名單"},{ta:"28-55 / 十期東區 / 餐廳 串流媒體",proj:"原潮APT",tags:"簡餐館::美食||甜點::美食||在地美食::美食||烘培坊::美食||火鍋::其他||燒烤::美食||韓式料理::美食||Gourmet::美食||壽司::美食||鮭魚::其他||Netflix::娛樂||Spotify::娛樂||Apple Music::其他||YouTube::娛樂||UberEATS::其他||Mobile payment::金融",loc:"",lx:"名單"},{ta:"28-60 / 北屯太平東區 / 娛樂購物",proj:"原潮APT",tags:"服裝::時尚美妝||購物中心::商業||Beauty::社會||Fashion::時尚美妝||Cosmetics::時尚美妝||Personal finance::金融||熱門話題::其他||Online banking::金融||Online shopping::商業||淘寶網::其他||Mobile payment::金融||LINE::其他||行動應用程式::科技||韓國電視劇::娛樂||速食休閒餐廳::美食||流行音樂::娛樂||綜藝節目::娛樂||Real estate listing websites::科技||假期::旅遊生活||快時尚::時尚美妝",loc:"",lx:"名單"},{ta:"28-55 / 彰師大+3K / 房地產",proj:"坤辰師大苑",tags:"Real estate::房地產興趣||Real estate investing::金融||Condominium::房地產興趣||Leasing::房地產興趣||591房屋交易網::其他",loc:"",lx:"名單"},{ta:"28-55 / 彰師大+5K / 新婚成家",proj:"坤辰師大苑",tags:"婚禮::社會||婚宴::旅遊生活||訂婚戒指::珠寶||媽媽寶寶-懷孕::其他||生產::其他||Parenting::其他||喜帖::旅遊生活||餐廳::美食",loc:"",lx:"名單"},{ta:"30-60 / 中北部 / 企業管理",proj:"昇祐ONE PLUS",tags:"管理::商業||Brand management::其他||Entrepreneurship::商業||廣告行銷活動::商業||Business management::商業||Human resource management::商業||徵才::商業||徵才網站::商業||Marketing::商業||培訓和開發::商業||資金::其他||Investment::金融||股市指數::金融||Real estate investing::金融",loc:"",lx:"訊息"},{ta:"30-60 / 沙鹿龍井伸港 / 上班族 / 家具設計",proj:"璞邑恆樂",tags:"管理::商業||Manufacturing::科技||Business::商業||傢俱::家居||Interior design::商業||Home improvement::家居||現代家具::家居||宜家家居::商業||政府::社會||Online shopping::商業||Fashion::時尚美妝||排屋::其他||Townhouse::房地產興趣||保單::金融||業務::商業||Commuting::其他||中型企業對企業企業員工::B2B",loc:"",lx:"名單"},{ta:"28-60 / 龍井東海中科 / 科技房產興趣",proj:"璞邑恆樂",tags:"新興技術::科技||AI::其他||三星電子::其他||羅技::其他||NVIDIA GeForce::其他||Fashion::商業||證券::金融||Personal finance::金融||Business::金融||宜家家居::商業||Online shopping::科技||電子商務網站::科技||排屋::其他||Townhouse::房地產興趣||Taiwankou::其他||T'Ai-Wan::其他||591房屋交易網::其他||鮭魚::其他||智慧科技::科技||酒精飲品::美食||電子商務網站  1201 -燒牛肉::科技||LifeStyle Food::其他||旅行社和預訂::旅遊生活",loc:"",lx:"名單"},{ta:"30-60 / 西屯七期 / 精品房產",proj:"門門一合院",tags:"高級訂製時裝::時尚美妝||排屋::其他||Townhouse::房地產興趣||別墅::旅遊生活||Private banking::其他||愛馬仕::時尚美妝||Luxury::商業||路易威登::時尚美妝||Cartier::珠寶商||凡賽斯::時尚美妝",loc:"",lx:"名單"},{ta:"28-60 / 竹科園區 / 親子 / 美食",proj:"富廣ONNI",tags:"Household::社會||Parenting styles::教育||私立學校::教育||基本英語::其他||兒童發展::教育||宮崎駿::其他||樂高::教育||Food::美食||Healthy cooking::美食||早午餐::美食||Cooking::美食||壽司::美食||燒牛肉::其他||鮭魚::其他||Gourmet::美食||氣泡酒::美食",loc:"",lx:"1510"},{ta:"30-65 / 嶺東烏日南區 / 企業主管",proj:"富旺商城",tags:"管理::商業||Business::商業||Small and medium enterprises::商業||戰略計劃::其他||Business model::金融||Social media marketing::商業||Marketing::商業||Influencer marketing::商業||購物中心::商業||Business development::商業||價格::其他||節慶::旅遊生活",loc:"",lx:"名單"},{ta:"27-55 / 西屯南屯 / 登山運動工程師",proj:"原潮APT",tags:"程式語言::科技||滑雪勝地::登山和滑雪勝地||亞瑟士::其他||Badminton::球拍類運動||智慧科技::科技||Lexus 汽車::交通||優乃克::其他||Stock market::金融||滑雪::健康運動||電腦記憶體::科技||Credit card::金融||網球::健康運動||美津濃::其他||滑雪板::健康運動||Electrical engineering::其他||電腦程式設計::科技||科技::科技||PlayStation 4::其他",loc:"",lx:"名單"},{ta:"35-60 / 南區東區大里 / 子女置產 / 潭子北屯太平",proj:"原潮APT",tags:"跟團旅行::旅遊生活||糕點::美食||文化遺產::藝術和文化||民俗學::其他||古蹟::其他||超市::美食||Asian American culture::社會||肥皂劇::娛樂||綜藝節目::娛樂||證券交易所::金融||Real estate::科技||婚禮::社會||公園與遊憩::其他||YouTube::娛樂",loc:"",lx:"名單"},{ta:"30-60 / 東海逢甲太原 / 企業主管 / 靜宜東海西屯北屯",proj:"富旺商城",tags:"Marketing::商業||Business::商業||Small and medium enterprises::商業||Business model::金融||戰略計劃::其他||Social media marketing::商業||購物中心::商業||Influencer marketing::商業||管理::商業||Business incubator::其他||Loyalty program::其他||折扣和購物回饋)::其他||商務旅遊::旅遊生活",loc:"",lx:"名單"},{ta:"28-60 / 林口三井+3K / 房地產",proj:"家悦美(主)",tags:"Real estate::房地產興趣||Real estate investing::金融||Real estate development::房地產興趣||Investment club::俱樂部||創意房地產投資::房地產興趣||591房屋交易網::其他",loc:"",lx:"名單"},{ta:" 27-55 / 林口三井+3K / 新婚成家",proj:"家悦美(副)",tags:"婚宴::旅遊生活||喜帖::旅遊生活||婚紗攝影::娛樂||媽媽寶寶-懷孕::其他||生產::其他||Parenting::其他||戒指::珠寶||結婚蛋糕 1127主粉專 -結婚蛋糕::旅遊生活||兒童文學::娛樂||私立學校::教育||蒙台梭利教育法::其他||婚禮::社會||親子::娛樂",loc:"",lx:"訊息"},{ta:"28-60 / 伸港鹿港龍井大肚 / 科技家庭自住 / $95、108",proj:"至善人本",tags:"生活用品::家居||家務::家居||家電::科技||傢俱::家居||一般保險::金融||House::房地產興趣||591房屋交易網::其他||Interior design::商業||排屋::其他||Townhouse::房地產興趣||iPhone::科技||Internet of things::其他||智慧科技::科技",loc:"",lx:"訊息"},{ta:"28-60 / 林口三井+3K / 附近職業",proj:"家悦美(主)",tags:"新興技術::科技||Semiconductor::其他||Food industry::其他||能源::科技||物流::商業",loc:"",lx:"名單"},{ta:"30-60 / 西屯南屯 / 企業家高奢興趣",proj:"門門一合院",tags:"比爾·蓋茨::其他||Private banking::其他||古馳::時尚美妝||席夢思::其他||路易威登::時尚美妝||私人公司::其他||水療::時尚美妝||Tax law::其他||遊艇::交通||Entrepreneurship::商業||股份::金融||Wealth::金融||Real estate::科技||Investment::金融||Priority Pass::其他||Golf::健康運動||現代藝術::娛樂||手錶::時尚美妝||Collectibles::收藏品||度假::社會||Luxury vehicle::交通||古董::其他||Sports car::交通||拍賣::其他",loc:"",lx:"名單"},{ta:"28-55 / 沙鹿清水 / 公教職員",proj:"華偉知見",tags:"學習::教育||Professional development::商業||書籍::娛樂||News media::娛樂||學校::教育||社區議題::法律與政府||Household::社會||LifeStyle Food::時尚美妝||Fitness::健康運動||Social media::網路媒體||政府機關概念和作法::社會||財政預算案::其他||快時尚::時尚美妝||Education::其他||社區和社會服務::其他",loc:"",lx:"訊息"},{ta:"28-55 / 北區北屯西屯 / 業務媒體餐廳",proj:"大城二月埕",tags:"業務::商業||Apple Watch::科技||Fashion::時尚美妝||Banking::金融||Real estate::科技||Social media marketing::商業||Social media::網路媒體||Insurance::商業||大眾媒體::娛樂||News media::娛樂||個人發展::個人身分||Affiliate marketing::商業||休閒餐廳::美食||星巴克::美食||早午餐::美食||Socializing::其他||Lifestyle brand::其他||Gourmet::美食||Specialty coffee::美食||Business development::商業",loc:"",lx:"名單"},{ta:"30-60 / 台1沿線 / 科技工業",proj:"華偉知見",tags:"工廠::商業||Manufacturing::科技||配電系統::其他||代工生產::其他||能源效率::科技||Semiconductor::其他||NVIDIA GeForce::其他||綜合企業::其他||羅技::其他||Razer::其他||行動應用程式::科技||Semi-truck::交通||材料科學::其他||Tech news::娛樂||儲蓄帳戶::金融||Current events::社會||Technology brands::科技||Internet of things::其他||Gadget & Gear::其他||Professional development::商業||職涯發展::商業||智慧科技::科技||機械工程::科技||Compensation and benefits::其他||輪胎品牌和商店::商業||Craft brewing::美食||充電器::其他||電池::其他||製冷::其他||Automation::其他||駕駛::交通||二手商品::購物和銷售",loc:"",lx:"訊息"},{ta:"27-55 / 中區北區洲際 / 跑咖追星出國2.0",proj:"原潮APT",tags:"網路名人::其他||Music::旅遊生活||Coffee::美食||甜點::美食||Travel::科技||住宿加早餐酒店::其他||免稅商店::其他||蛋糕::美食||韓國流行音樂::娛樂||航空公司::其他||華語流行音樂::其他||Instagram::科技||星巴克::美食||http://booking.com/::旅遊生活||Places::旅遊生活||旅行社和預訂::旅遊生活||休閒餐廳::美食||數位相機::相機和相機設備||肖像攝影::娛樂||購物中心::商業||Instant camera::其他",loc:"",lx:"名單"},{ta:"27-45/ 東區北區洲際 / 小家庭自營商",proj:"原潮APT",tags:"KitchenAid::家居||Personal finance::金融||幼兒照護::教育||Parenting styles::教育||Home improvement::家居||Home and garden::家居||居家和園藝媒體::家居||Family travel::娛樂||Entrepreneurship::金融||電子商務::商業||Startups::商業||顧客關係管理::公關||銷售時點情報系統::其他||Small business::其他",loc:"",lx:"名單"},{ta:"28-55 / 北屯太平 / 藍領 公教職 / (+隱藏興趣) / $163、31訊息",proj:"大興家園",tags:"技術員::其他||White-collar worker::娛樂||工廠::商業||保單::金融||存款帳戶::金融||配電系統::其他||代工生產::其他||Public transport::交通||超市::美食||本日優惠::商業||政府員工::社會||Education::其他||行政服務 1204 +教育資源::普||Lifestyle content::商業||Parenting styles::教育||Professional development::商業||Retirement Insurance Benefits::其他||benefit::軍事||Home organization::家居||師範教育::商業||Educational resources::教育||旋轉式刮鬍刀::其他||Motorcycle accessories::交通||Public administration::社會||Lifestyle::旅遊生活||保護服務::其他",loc:"",lx:"訊息"},{ta:"30-60 / 北區北屯西屯 / 生活面向 / (多隱藏興趣)",proj:"大城二月埕",tags:"零售銀行業務::金融||Podcast::音樂和音訊串流||Online advertising::商業||Buy one get one free::商業||Lifestyle::旅遊生活||Lifestyle Travel::其他||LifeStyle Food::其他||Professional services::其他||Business networking::其他||休閒餐廳::美食||Women's clothing::時尚美妝||Cash on delivery::其他||Men's clothing::時尚美妝||行動應用程式::科技||Consumer electronics::其他||Loyalty program::其他||折扣和購物回饋)::其他||Movie lovers::娛樂||線上訂餐::美食||momo購物網::其他",loc:"",lx:"名單"},{ta:"28-55 / 竹北竹南科 / 科技商務 / (多隱藏興趣)",proj:"八德盛景",tags:"Professional services::其他||LifeStyle Food::其他||Podcast::音樂和音訊串流||Men's clothing::時尚美妝||Women's clothing::時尚美妝||Consumer electronics::科技||Travel Deals::其他||Apple Music::其他||Financial planning::金融||Tech news::娛樂||行動應用程式::科技||Fitness::健康運動||Educational resources::教育||休閒餐廳::美食||生產率 1224 +數位媒體::科技||lending::金融",loc:"",lx:"訊息"},{ta:"28-55 / 南區東區太平 / 餐廳 串流媒體",proj:"大漁樂芙",tags:"簡餐館::美食||甜點::美食||在地美食::美食||烘培坊::美食||火鍋::其他||燒烤::美食||韓式料理::美食||Gourmet::美食||壽司::美食||鮭魚::其他||Netflix::娛樂||Spotify::娛樂||Apple Music::其他||YouTube::娛樂||UberEATS::其他||Mobile payment::金融||LifeStyle Food::其他||Food::食品零售商||LifeStyle Home::旅遊生活",loc:"",lx:"訊息"},{ta:"28-55 / 大林新港 / 傳產家庭 / (多隱藏興趣)",proj:"中祐雅苑",tags:"Manufacturing::科技||代工生產::其他||Agriculture::農業自然||現金回贈獎勵方案::金融||Loyalty program::其他||折扣和購物回饋)::其他||Compensation and benefits::其他||Workwear::其他||Lifestyle::旅遊生活||Parenting styles::教育||Household::關係||Lifestyle content::商業||排屋::其他||別墅::旅遊生活||科技早期採用者::其他",loc:"",lx:"訊息"},{ta:"28-55 / 竹北竹南科 / 教育享樂 / (多隱藏興趣)",proj:"八德盛景",tags:"Travel Deals::其他||LifeStyle Food::其他||Men's clothing::時尚美妝||Women's clothing::時尚美妝||Educational resources::教育||Craft Beer and Brewing::其他||Party planning::特殊場合和活動||早午餐::美食||Full English breakfast::其他||World Gym::其他||Contemporary art::娛樂||Language education::其他||Adult education::商業||Professional development::商業||Digital art::其他||Independent travel::旅遊",loc:"",lx:"訊息"},{ta:"28-55 / 南區中區洲際 / 社交網路娛樂",proj:"大漁樂芙",tags:"Online entertainment::娛樂和媒體||Video on demand::影片串流服務||socializing::其他||Live events::旅遊生活||Entertainment News::其他||Streaming::娛樂||Happy hour::美食||Digital media::科技||Viral video::網路影片||派對::旅遊生活||Lifestyle::旅遊生活||Mobile payment::金融||Credit card::金融||Christmas Holiday::其他",loc:"",lx:"訊息"},{ta:"28-55 / 林口五股 / 教育享樂",proj:"家悦美(副)",tags:"Contemporary art::娛樂||Educational resources::教育||Art exhibitions::娛樂||Craft Beer and Brewing::其他||早午餐::美食||Language education::其他||Women's clothing::時尚美妝||Men's clothing::時尚美妝||Full English breakfast::其他||Professional development::商業||Party planning::特殊場合和活動||Independent travel::旅遊||Specialty coffee::美食||HydraFacial 1223 +Spotify::娛樂||Adventure travel::旅遊生活||Camping::旅遊生活||Craft brewing::美食",loc:"",lx:"名單"},{ta:"30-65 / 西屯南屯 / 有錢興趣 / (多隱藏興趣)",proj:"門門一合院",tags:"Business networking::其他||蘇富比::其他||百達翡麗::時尚美妝||度假村::旅遊生活||Wine tasting::美食||路易威登::時尚美妝||Entrepreneurship::商業||Luxury lifestyle::科技||Philanthropy::社會||Country club::其他||High-net-worth individual::商業||Golf::健康運動||Hiking::爬山||BACKPACKING::健康運動||Trails::旅遊生活||Birdwatching::其他",loc:"",lx:"名單"},{ta:"27-55 / 林口+3K / 醫護族群",proj:"家悦美(主)",tags:"牙科學院::教育||Nursing education::醫學教育||免稅商店::其他||Independent travel::旅遊||一般保險::金融||Higher education::教育||衛生學::其他||生物學::科技||Beauty::社會||清潔::時尚美妝||CeraVe Skincare::其他||Cetaphil::其他||科學::期刊||Uber::商業",loc:"",lx:"訊息"},{ta:"30-60 / 草屯霧峰大里 / 通勤教育戶外",proj:"水琉璃",tags:"Taiwankou::其他||T'Ai-Wan::其他||White-collar worker::娛樂||Educational resources::教育||Parenting styles::教育||Health::時尚美妝||Extracurricular activities::其他||Home organization::家居||速食::美食||Outdoor Living::其他||Camping::旅遊生活||Cycling::健康運動||News media::娛樂||Business::商業||服裝::時尚美妝||Current events::社會||Commuting::其他||戶外休閒活動::旅遊生活||Gardening::旅遊生活",loc:"",lx:"訊息"},{ta:"25-45 / 中科大雅 / 科技工業年輕成家",proj:"中科峇里島17",tags:"Internet of things::其他||共同基金::金融||GitHub::其他||Big data::科技||智慧科技::科技||Semiconductor::其他||航空公司::其他||能量飲料::美食||製造生產服務和組織::商業||Compensation and benefits::其他||Gadget & Gear::其他||LifeStyle Home::其他||Professional development::商業||Stock broker::金融||Video on demand::影片串流服務||婚禮網站和部落格::科技||婚紗攝影::娛樂||婚戒::旅遊生活",loc:"",lx:"訊息"},{ta:"30-60/大台中/出國旅遊",proj:"原潮APT",tags:"免稅商店::其他||航空公司::其他||商務艙::旅遊生活||機場::其他||Priority Pass::其他||Travel the World::其他||Visa Cash::其他||Real estate::科技",loc:"",lx:"名單"},{ta:"35-36/竹北東區湖口/高階主管",proj:"昌禾大苑首席",tags:"T'Ai-Wan::其他||Business model::金融||Entrepreneurship::商業||獨資企業::商業||酒精飲品::美食||產品經理::其他||Luxury vehicle::交通||高級訂製時裝::時尚美妝||經常旅行的用戶::其他||Small business::其他||國際飛行常客::其他||副總經理::其他||創辦人::其他||總監::其他||董事長 0112 +生產率::其他||Business incubator::其他||Business development::商業||Business opportunities::金融",loc:"",lx:"名單"},{ta:"30-65 / 新竹基地5K / 小家庭+房地產",proj:"LUCE VIVA",tags:"傢俱::家居||Parenting::教育||新生兒派對::教育||家電::科技||兒童::教育||Real estate::房地產興趣||家長：家長::子女最大 12 個月||嬰幼兒家長::其他||學齡前兒童的家長::其他||低年級學童的家長::其他||青少年學童的家長 0108 +嬰幼兒和孕婦用品店::其他||Parenting styles::教育||超市::美食||Beer::美食",loc:"",lx:"名單"},{ta:"25-50 / 南區東區 / 吃喝玩樂",proj:"大漁樂芙",tags:"快時尚::時尚美妝||Influencer marketing::商業||火鍋::其他||在地美食::美食||燒烤::美食||Gourmet::美食||酒精飲品::美食||可樂::其他||簡餐館::美食||乳製品::美食||Badminton::球拍類運動||保齡球::其他||卡拉OK::其他||韓國電視劇::娛樂||刺青::時尚美妝||PlayStation::遊戲機||淘寶網::其他||美妝店::商業",loc:"",lx:"名單"},{ta:"28-55 / 大林斗南斗六 / 通勤傳統文化",proj:"中祐雅苑",tags:"排屋::其他||代工生產::其他||Lifestyle content::商業||別墅::旅遊生活||文化遺產::藝術和文化||Tourist attractions::旅遊生活||行動應用程式::科技||Google地圖::其他||五金行::商業||印刷::出版||真空包裝::其他||Real estate::房地產興趣||Commuting::其他||政府員工::社會||漁業 0113 +連棟住宅::房地產興趣||食品加工::其他||配電系統::其他||民俗學::其他||節慶::旅遊生活||tea leaf::美食||Recreational fishing::釣魚",loc:"",lx:"訊息"},{ta:"30-50 / 北屯北區太平 / 3金融1房產",proj:"原潮APT",tags:"金融服務::商業||Insurance::商業||Real estate::科技",loc:"",lx:"名單"},{ta:"30-65 / 北屯太平潭子 / 會計金融休閒",proj:"大城二月埕",tags:"Personal finance::金融||儲蓄::金融||存款帳戶::金融||Financial planning::金融||財務會計::商業||MBA::金融||Accounting::其他||金融服務::商業||Hiking::爬山||Cycling::健康運動||戶外休閒活動::旅遊生活||Camping::旅遊生活||釣魚::旅遊生活||Independent travel::旅遊||漁具::其他||迪卡儂::其他",loc:"",lx:"名單"},{ta:"30-60 / 彰市+8K / 批發商業房產",proj:"(傑芳) 維瓦第明日City",tags:"經銷::商業||零售業::科技||進口::商業||出口貿易::其他||業務::商業||直運::商業||物流::商業||Business::商業||資金::其他||591房屋交易網::其他||Real estate::科技||Electric vehicle::交通||Automobile::交通||Facebook 付款用戶::其他",loc:"",lx:"訊息"},{ta:"30-60 / 基地+5K / 軍公教",proj:"LUCE VIVA",tags:"學習::教育||Online learning::教育||Professional development::商業||政府機關概念和作法::社會||財政預算案::其他||Household::社會||Fitness::健康運動||News media::娛樂||Insurance::商業||Current events::社會||Education::其他||軍事::社會||政府員工::社會||社區和社會服務 0109 擴大::其他",loc:"",lx:"名單"},{ta:"30-60 / 基地+5K / 投資理財房產",proj:"LUCE VIVA",tags:"Credit card::金融||儲蓄::金融||Passive income::商業||Financial planning::金融||Online banking::金融||納斯達克100指數::其他||股市指數::金融||共同基金::金融||一般保險::金融||Real estate::科技||Real estate listing websites::科技||Interior design::商業||地板::其他||Home improvement::家居",loc:"",lx:"名單"},{ta:"35-60 / 中部 / 露營興趣",proj:"自然紅屋",tags:"戶外休閒活動::旅遊生活||Ecotourism::旅遊生活||Nature photography::娛樂||野餐::食品和飲料||Home improvement::家居||Camping::旅遊生活||大自然::科技||Independent travel::旅遊||草地::家居||Lifestyle Travel::其他||Weekend Getaway 0108 +休旅車營地::旅遊生活||Prefabricated home::其他||居家風格和類型::房地產興趣",loc:"",lx:"名單"},{ta:"*28-55 / 地基+5K / 年輕興趣",proj:"坤辰師大苑",tags:"Taiwankou::其他||T'Ai-Wan::其他||White-collar worker::娛樂||PC Gamer::其他||Spotify::娛樂||演唱會::音樂活動||戶外休閒活動::旅遊生活||歌唱::娛樂||Music::旅遊生活||甜點::美食||派對::旅遊生活||網路遊戲::娛樂||野餐::食品和飲料||攀岩::極限運動||Stock market::金融||卡拉OK::其他||Camping::旅遊生活||Netflix::娛樂||拼圖::其他||攀石::其他||Hiking::爬山||Real estate investing::金融||運動類遊戲::娛樂||電腦遊戲::娛樂||Real estate::房地產興趣||電玩遊戲::娛樂||Social media::網路媒體||YouTube::娛樂",loc:"",lx:"名單"},{ta:"28-60 / 和美 沿台19 / 小家庭+上班族 / $322、30名單",proj:"新都峰",tags:"591房屋交易網::其他||Real estate::房地產興趣||Condominium::房地產興趣||金融服務::商業||金錢::金融||促銷::商業||政府::社會||團購::其他||證券::金融||Banking::金融||Education::其他||優惠券::其他",loc:"",lx:"名單"},{ta:"30-64 / 高知識  財經",proj:"松恩頌子鳥",tags:"學術研討會::其他||研究::其他||展覽館::其他||Higher education::教育||Education::社會||Investment::商業||新聞播報::娛樂||大眾媒體::娛樂||財經::商業||House::房地產興趣||591房屋交易網::其他",loc:"",lx:"訊息"},{ta:"30-60  / 科技新貴 旅遊",proj:"松恩頌子鳥",tags:"智慧科技::科技||Artificial intelligence::科技||Big data::科技||新興技術::科技||Travel::旅遊生活||飯店::旅遊生活||Booking.com::旅遊生活||Hotels.com::旅遊生活||Trivago::其他||Real estate::科技||House::房地產興趣||免稅商店::其他",loc:"",lx:"訊息"},{ta:"**30-60 / 林口五股新北 / 金融投資",proj:"家悦美(副)",tags:"T'Ai-Wan::其他||Financial market::金融||金錢::金融||金融經濟學::其他||財經::商業||金融服務::商業||金融分析::其他||Passive income::商業||Investment::金融||Stock market::金融||Real estate::房地產興趣||收入::商業||Return on investment::金融",loc:"",lx:"名單"},{ta:"30-65 / 南投中興草屯霧峰 / 長輩興趣",proj:"寬心璽玥",tags:"天然食品::美食||Rural::農業自然||Educational resources::教育||純素營養::美食||健康的習慣::旅遊生活||Birdwatching::其他||旅行社和預訂::旅遊生活||魚油::其他||全價值營養::其他||膽固醇::科技||中式料理::美食||簡餐館::美食||休閒活動::旅遊生活",loc:"",lx:"訊息"},{ta:"30-60 / 龍潭中壢 / 成家科技業",proj:"君品天玥",tags:"電腦科學::科技||科學::期刊||實驗室::其他||Software engineering::科技||Python::程式語言||GitHub::其他||Tech news::娛樂||Higher education::教育||生物化學::其他||發電::其他||婚宴::旅遊生活||喜帖::旅遊生活||Social media::網路媒體||Influencer marketing::商業||中型企業對企業企業員工::B2B||政府員工::社會||Information technology::其他||軟體開發::科技||電腦工程::科技||數位貨幣::金融||納斯達克100指數::其他||Passive income::商業",loc:"",lx:"名單"},{ta:"28-60 / 基地+6K / 純房產",proj:"LUCE VIVA",tags:"Real estate::科技||Real estate listing websites::科技||First-time home buyer::房地產興趣",loc:"",lx:"名單"},{ta:"28-50 / 東區竹北 / 教育生活相關",proj:"LUCE VIVA",tags:"外語::其他||航空公司::其他||工程和理工學院::教育||Travel::旅遊生活||慢跑::跑步||Gardening::家居||超市::美食||生活用品::家居||韓國電視劇::娛樂||Beauty::社會||美學::社會||Business model::金融||護膚保養::時尚美妝||Coffee::美食",loc:"",lx:"名單"},{ta:"28-55 / 中山松山大安 / 科技商務",proj:"家悦美(副)",tags:"Men's clothing::時尚美妝||Women's clothing::時尚美妝||Podcast::音樂和音訊串流||LifeStyle Food::其他||Professional services::其他||Business development::商業||Apple Music::其他||Full English breakfast::其他||行動應用程式::科技||Fitness::健康運動||Tech news::娛樂||Consumer electronics::科技||生產率::其他||Digital media::科技",loc:"",lx:"名單"},{ta:"25-55 / 北部中彰 / 軟裝整建",proj:"臻富裕",tags:"Home organization::家居||Household::商業||Home and garden::家居||百葉簾::其他||整建::房地產興趣||Home renovation::家居||Spring cleaning::家居||節慶::旅遊生活||傢俱::家居||居家飾品::家居",loc:"",lx:"訊息"},{ta:"28-55 / 彰市和美 /  育兒寵物",proj:"坤辰師大苑",tags:"Parenting::教育||廚房::家居||Interior design::商業||現代家具::家居||Consumer electronics::科技||Early childhood education::教育||生活用品::家居||運動::健康運動||暑假::教育||草地::家居||任天堂::遊戲機和相關配件||Pet::農業自然||貓糧::農業自然",loc:"",lx:"名單"},{ta:"28-55 / 大林新港斗南 / 農企業",proj:"中祐雅苑",tags:"Rural::科技||肥料::農業自然||Agriculture::農業自然||有機農業::農業自然||Farmers market::美食||出口貿易::其他||批發::商業||物流::商業||Gardening::農業自然||天氣預報::其他||政府機關概念和作法::社會||溫室::其他||食品加工::其他||中式料理::美食||食品保存::其他||生物技術::其他||農企業::農業自然",loc:"",lx:"訊息"},{ta:"28-55 / 竹北竹南科 / 程式運動電玩",proj:"八德盛景",tags:"程式語言::科技||Open source software::其他||PHP::其他||Tech news::娛樂||Java::其他||有氧運動::健康運動||Fitness::健康運動||Badminton::球拍類運動||電玩遊戲::娛樂||PlayStation::遊戲機||超級馬利奧系列::其他||薩爾達傳說::其他||電玩遊戲網路媒體::娛樂||Collectibles::教育||馬拉松::跑步||玩命關頭::其他||手機遊戲::娛樂",loc:"",lx:"訊息"},{ta:"35-65 / 中北部 / 退休度假興趣",proj:"自然紅屋",tags:"Prefabricated home::其他||居家風格和類型::房地產興趣||度假屋::旅遊生活||Garden furniture::家居||Rural::其他||日式旅館::其他||度假屋出租::旅遊生活||Retirement planning::金融||Birdwatching::其他||Trails::旅遊生活||水族飼養::其他",loc:"",lx:"名單"},{ta:"28-50 / 東區竹北 / 工程師汽車",proj:"LUCE VIVA",tags:"Software engineering::科技||程式語言::科技||C語言::其他||軟體開發::科技||行動應用程式::科技||Open source software::其他||Electric vehicle::交通||特斯拉汽車::交通||油電混合車::交通||洗車::交通||Automobile::交通||鍍膜::其他||油電混合動力車::交通||改裝車::交通||Camping::旅遊生活||自訂車款::交通",loc:"",lx:"名單"},{ta:"28-55 / 中山 / 商務貿易",proj:"家悦美(副)",tags:"Business development::商業||國際貿易::其他||進口::商業||出口貿易::其他||B2B::商業||Sales management::商業||Procurement::其他||Business::商業||物流::商業||供應鏈::其他||經銷::商業||倉儲業::科技||價格::其他||Logistics::金融||Lead generation::商業||Business opportunities::金融",loc:"",lx:"名單"},{ta:"30-60 / 桃園蘆竹 / 藝術品投資",proj:"家悦美(主)",tags:"Contemporary art::娛樂||Art exhibitions::娛樂||Art::娛樂||Handicraft::工藝品||雕刻::娛樂||寶石::科技||裝飾風藝術::其他||花卉::農業自然||Investment::商業||美國運通::其他||納斯達克100指數::其他||插花::其他||Asset management::金融||Passive income::商業||Collectibles::興趣",loc:"",lx:"訊息"},{ta:"35-65 / 龍潭石門 / 投資證券美股",proj:"君品天玥",tags:"Financial planning::金融||Stock market::金融||Passive income::商業||股份::金融||Investment::金融||Stock broker::金融||Asset management::金融||私募基金::其他||Private equity::金融||Tax preparation::其他||Private banking::其他||納斯達克100指數::其他||道瓊斯工業平均指數::其他||標準普爾500指數::其他",loc:"",lx:"名單"},{ta:"30-65 / 北屯太平潭子 / 換工作搬遷",proj:"大城二月埕",tags:"Business networking::其他||領英::其他||領導::社會||Professional development::商業||職涯::商業||Business leaders::金融||新家::其他||House::房地產興趣||起步房::房地產興趣||White-collar worker::娛樂||Commuting::其他||遠離家鄉 0130 +個人發展::加了之後很穩定||Adult education::商業||在地美食::美食||生產率::其他||不與家人同住::其他",loc:"",lx:"名單"},{ta:"35-65 / 龍潭石門 / 度假休閒品酒",proj:"君品天玥",tags:"Wine tasting::美食||酒莊::美食||Lifestyle Travel::其他||Cultural travel::其他||葡萄園::其他||度假村::旅遊生活||跨界休旅車::其他||住宿加早餐酒店::其他||遊輪::旅遊生活||都會車::交通||別墅::旅遊生活||美國運通::其他||Specialty coffee::美食||前菜::其他||Foreign exchange market::金融",loc:"",lx:"名單"},{ta:"28-55 / 伸港鹿港龍井大肚 / 科技工業賺錢",proj:"至善人本",tags:"Wealth::金融||Investment::商業||收入::商業||Automobile::交通||電子商務::商業||Stock market::金融||Badminton::球拍類運動||酒精飲品::美食||591房屋交易網::其他||排屋::其他||Townhouse::房地產興趣||New Home::其他",loc:"",lx:"訊息"},{ta:"35-65 / 苗桃竹 / 長輩休閒",proj:"自然紅屋",tags:"Rural::其他||度假屋::旅遊生活||水族飼養::其他||Birdwatching::其他||釣魚::旅遊生活||Trails::健行||Woodworking::娛樂||tea leaf::美食||RV Travel::其他||休旅車營地::旅遊生活||National parks::旅遊目的地||雕刻::娛樂||Gardening::旅遊生活||水療::時尚美妝||麻將::其他||Chinese Culture::其他||歷史::歷史",loc:"",lx:"名單"},{ta:"30-50 / 北區 / 業務性質",proj:"LUCE VIVA",tags:"Business development::商業||Life insurance::金融||保單::金融||證券::金融||Credit card::金融||Automobile::科技||Business networking::其他||Marketing::商業||直效營銷::其他||財務顧問::金融||B2B::商業||Lead generation::商業||Trade shows::貿易展",loc:"",lx:"名單"},{ta:"28-55 / 林口 / 外商科技業",proj:"家悦美(副)",tags:"AI::其他||Science communication::其他||Tech news::娛樂||http://geek.com/::其他||Software development::其他||Machine learning::科技||英語::語言||Multinational corporation::其他||IT諮詢::其他||International business::其他||Semiconductor::其他||Internet of things::其他||電光源::其他||Software engineering::科技||物理學::物理學||不與家人同住 0202 +國際新聞::娛樂||Consumer electronics::其他||Scientific::科技||Google開發人員::其他||經常旅行的用戶::其他",loc:"",lx:"名單"},{ta:"28-50 / 伸港鹿港龍井 / 建築生活品質",proj:"至善人本",tags:"建材::科技||結構工程::其他||砌體結構::其他||Sustainable architecture::其他||整建::房地產興趣||News media::娛樂||Open house::商業||Kitchen appliances::商業||Home decor::家居||Lifestyle::旅遊生活||Quality of life::健康運動||Mental health::健康運動||營建管理::其他",loc:"",lx:"訊息"},{ta:"28-55 / 彰市和美 /  零售批發自營",proj:"坤辰師大苑",tags:"零售業::科技||批發::商業||供應鏈::其他||獨資企業::商業||經銷::商業||居家事業::商業||Small business::商業||銀行帳戶::金融||Marketing::商業||貿易::金融||Social media marketing::商業||Influencer marketing::商業||Online shopping::商業||電子商務 0211 +價格::商業||配送::商務||節慶::旅遊生活||淘寶網::其他",loc:"",lx:"名單"},{ta:"28-55 / 彰市和美 /  建築生活品質",proj:"坤辰師大苑",tags:"建材::科技||結構工程::其他||Sustainable architecture::其他||營建管理::其他||砌體結構::其他||整建::房地產興趣||News media::娛樂||Open house::商業||Household::商業||Kitchen appliances::商業||Quality of life::健康運動||Lifestyle::旅遊生活||自我照護::健康運動||Mental health::健康運動",loc:"",lx:"名單"},{ta:"30-60 / 花壇大村 / 汽車貿易業者",proj:"鉅德富地",tags:"批發::商業||Electric vehicle::交通||經銷::商業||出口貿易::其他||二手車::交通||Lexus 汽車::交通||賓士::交通||Automobile::科技||國際貿易::其他||運輸::交通||別墅::旅遊生活||貿易::金融||物流::商業||Nissan 汽車::交通||News media::娛樂||進口::商業",loc:"",lx:"訊息"},{ta:"28-50 / 東區北區 / 年輕買房",proj:"原潮APT",tags:"綜藝電視節目::娛樂||表演藝術::娛樂||演唱會::音樂活動||Live events::旅遊生活||節慶::旅遊生活||派對::旅遊生活||Influencers::時尚美妝||Passive income::商業||低成本航空公司::其他||Stock market::金融||Current events::社會||Real estate::科技||House::房地產興趣||網紅創作者::其他||餐飲創作者::其他",loc:"",lx:"名單"},{ta:"28-55 / 竹南頭份 / 銀行保險業",proj:"八德盛景",tags:"證券::金融||財務會計::商業||Financial planning::金融||金融服務::商業||Foreign exchange market::金融||儲蓄::金融||Business development::商業||Professional services::其他||Personal finance::金融||Life insurance::金融||一般保險::金融||Lead generation::商業||行政服務 0312 +零售銀行業務::金融||Business networking::其他||Investment::金融||Travel::其他",loc:"",lx:"訊息"},{ta:"30-55 / 龍井 / 零售批發自營",proj:"敘uno",tags:"中彰大橋::其他||批發::商業||Small business::商業||居家事業::商業||經銷::商業||供應鏈::其他||銀行帳戶::金融||貿易::金融||電子商務::商業||Marketing::商業||Social media marketing::商業||Influencer marketing::商業||Online shopping::商業||價格::其他||Business model::金融||Lead generation::商業||Food service::美食||Commuting::其他",loc:"",lx:"1510"},{ta:"28-50 / 后里中科 / 科技業家庭",proj:"后麗18",tags:"智慧科技::科技||iPhone::科技||House::金融||Interior design::商業||591房屋交易網::其他||排屋::其他||Townhouse::房地產興趣||家電::科技||傢俱::家居||一般保險::金融||家務::家居||生活用品::家居||Health::時尚美妝||Gourmet::美食||Business::金融||酒精飲品::美食||Consumer electronics::其他",loc:"",lx:"訊息"},{ta:"28-55 / 西屯精科 / 親子教育工業",proj:"佳瓚大讚",tags:"量販店::美食||Parenting::教育||家樂福::其他||Early childhood education::教育||Education::社會||幼兒照護::教育||Manufacturing::科技||婚姻::旅遊生活||代工生產::其他||親子天下::其他||製造生產服務和組織::商業",loc:"",lx:"訊息"},{ta:"30-45 / 西屯西區 / 業務性質",proj:"原潮APT",tags:"Business development::商業||Life insurance::金融||保單::金融||證券::金融||Credit card::金融||Automobile::科技||Business networking::其他||Marketing::商業||直效營銷::其他||財務顧問::金融||B2B::商業||Lead generation::商業||Trade shows::貿易展",loc:"",lx:"名單"},{ta:"30-60 / 桃園蘆竹 / 親子教育",proj:"家悦美(主)",tags:"Parenting styles::教育||Motherhood::娛樂||媽媽寶寶-懷孕::其他||生產::其他||Parenting::其他||新生兒派對::教育||Design studios::商業||在家教育::教育||LifeStyle Home::其他||繪畫::娛樂||Household::社會||運動類遊戲::娛樂||Family travel::娛樂||Language education::其他||家長：嬰幼兒家長::其他||學齡前兒童的家長::其他||低年級學童的家長 0310 +蒙台梭利教育法::其他||兒童發展::教育||樂器::樂器||親子::娛樂",loc:"",lx:"訊息"},{ta:"30-50 / 草屯霧峰大里 / 通勤上班教育",proj:"水琉璃",tags:"Educational resources::教育||Extracurricular activities::其他||News media::娛樂||製造生產服務和組織::商業||Business::商業||Human resource management::商業||Current events::社會||Home organization::家居||Health::時尚美妝||本田汽車::交通||豐田汽車::交通||Commuting::其他",loc:"",lx:"訊息"},{ta:"28-55 / 大肚烏日/  建築生活品質",proj:"坤辰師大苑",tags:"建材::科技||結構工程::其他||Sustainable architecture::其他||營建管理::其他||砌體結構::其他||整建::房地產興趣||News media::娛樂||Open house::商業||Household::商業||Kitchen appliances::商業||Quality of life::健康運動||Lifestyle::旅遊生活||自我照護::健康運動||Mental health::健康運動||土木工程::科技||Risk management::其他||Woodworking::家居",loc:"",lx:"名單"},{ta:"28-55 / 太平大里 /  藍領公教職",proj:"大興家園",tags:"White-collar worker::娛樂||技術員::其他||工廠::商業||保單::金融||存款帳戶::金融||配電系統::其他||代工生產::其他||Public transport::交通||超市::美食||本日優惠::商業||Educational resources::教育||Parenting styles::教育||Lifestyle content::商業||Retirement Insurance Benefits::其他||Professional development::商業||benefit::軍事||Home organization::家居",loc:"",lx:"訊息"},{ta:"30-60/ 中科中清/ 傳產製造食品加工",proj:"原潮APT",tags:"House::房地產興趣||Automobile::交通||Food trucks::其他||591房屋交易網::其他||工程::科技||倉儲業::科技||食品加工::其他||Manufacturing::科技||運輸::交通||零部件市場::其他||物流::商業||Real estate::科技||科技::科技||使用 Facebook 的管道：所有行動裝置::科技||餐飲創作者::其他",loc:"",lx:"名單"},{ta:"35-65 / 中彰投 / 企業主戶外",proj:"自然紅屋",tags:"Business::商業||市場趨勢::金融||Prefabricated home::其他||Open house::商業||居家風格和類型::房地產興趣||RV Travel::其他||Camping::旅遊生活||休旅車營地::旅遊生活||Ecotourism::旅遊生活||Outdoor Living::其他",loc:"",lx:"訊息"},{ta:"35-65 / 桃竹苗 / 鄉村休閒",proj:"自然紅屋",tags:"居家風格和類型::房地產興趣||Ecotourism::旅遊生活||Rural::其他||拖掛式房車::其他||農村::其他||Tourist attractions::旅遊生活||休閒活動::旅遊生活||Household::社會||公園與遊憩::其他||Farm-to-table::其他||Gardening::旅遊生活",loc:"",lx:"訊息"},{ta:"30-55 / 后里豐原 /  零售批發自營",proj:"后麗18",tags:"零售業::科技||批發::商業||經銷::商業||供應鏈::其他||居家事業::商業||Small business::商業||銀行帳戶::金融||貿易::金融||電子商務::商業||Marketing::商業||Social media marketing::商業||Influencer marketing::商業||Online shopping::商業",loc:"",lx:"訊息"},{ta:"30-65 / 南投草屯霧峰 / 休閒園藝 / 南投中興草屯霧峰",proj:"寬心璽玥",tags:"遊程承攬業::其他||跟團旅行::旅遊生活||Gardening::花園和園藝造景||Camping::旅遊生活||休旅車營地::旅遊生活||National parks::旅遊目的地||Chinese Culture::其他||Trails::健行||Lifestyle content::商業||Coffee::美食||LifeStyle Food::時尚美妝||Local events::美食||感情狀況：已婚::其他",loc:"",lx:"訊息"},{ta:"28-55 / 苗栗(市區苑裡) / 居家裝飾設計",proj:"臻富裕",tags:"Home decor::家居||居家裝潢構想::家居||室內裝潢品牌和零售商::商業||百葉簾::其他||現代家具::家居||Lifestyle::旅遊生活||Scandinavian design::房地產興趣||Open house::商業||Interior design::商業||窗戶::房地產興趣||Real estate::科技",loc:"",lx:"訊息"},{ta:"30-60 / 嶺東烏日南區 / 行銷人力管理",proj:"富旺商城",tags:"Marketing::商業||Business opportunities::金融||Social media marketing::商業||購物中心::商業||Sales management::商業||Lead generation::商業||零售業::科技||服裝::時尚美妝||Co-working::其他||Business leaders::金融||Small business::商業||Fashion::娛樂||Human resource management::商業",loc:"",lx:"名單"},{ta:"30-60 / 林口五股新莊 / 金融投資",proj:"家悦美(主)",tags:"Trading strategy::金融||金錢::金融||金融經濟學::其他||財經::商業||金融服務::商業||金融分析::其他||Passive income::商業||Investment::金融||Stock market::金融||Real estate::房地產興趣||收入::商業||Return on investment::金融",loc:"",lx:"名單"},{ta:"30-60 / 草屯南投 / 汽車工業",proj:"水琉璃",tags:"二手車::交通||Automobile::商業||卡車::交通||批發::商業||製造生產服務和組織::商業||建築工程::其他||土木工程::科技||Home improvement::家居||金屬::其他||一般保險::金融||儲蓄::金融||酒精飲品::美食",loc:"",lx:"訊息"},{ta:"30-50 / 北屯潭子 / 自由業",proj:"原潮APT",tags:"Business development::商業||Business networking::其他||Entrepreneurship::金融||Lead generation::商業||個人發展::個人身分||Photography::娛樂||Design::商業||Home office::家居||Project management software::其他||影音俱樂部::其他||MacBook::其他||Canva::其他||生產率::其他||Online banking::金融",loc:"",lx:"名單"},{ta:"30-55 / 北斗田尾 / 公務員教育",proj:"羣昱馥昕2",tags:"Life insurance::金融||Household::社會||Parenting styles::教育||Online learning::教育||政府機關概念和作法::社會||Banking::金融||LifeStyle Food::時尚美妝||社區議題::法律與政府||Fitness::健康運動||News media::娛樂",loc:"",lx:"訊息"},{ta:"28-55 / 台中(北屯豐原) / 家具零售",proj:"臻富裕",tags:"百葉簾::其他||居家裝潢構想::家居||室內裝潢品牌和零售商::商業||宜家家居::商業||Workinghouse 生活工場::其他||大創百貨::其他||家樂福::其他||Online shopping::科技||momo購物網::其他||Home improvement::家居||Home renovation::家居||整建::房地產興趣",loc:"",lx:"訊息"},{ta:"30-55 / 伸港鹿港線西 / 傳產代工家庭",proj:"至善人本",tags:"Shenkang::其他||T'Ai-Wan::其他||批發::商業||出口貿易::其他||排屋::其他||進口::商業||紡織品::其他||Chemical industry::其他||玻璃::其他||生物可分解塑膠::其他||Automobile::科技||居家事業::商業||B2B::商業||Procurement::其他||代工生產::其他||Accounting::商業",loc:"",lx:"訊息"},{ta:"30-55 / 伸港和美 / 五金自營商",proj:"至善人本",tags:"Shenkang::其他||T'Ai-Wan::其他||批發::商業||排屋::其他||代工生產::其他||B2B::商業||五金行::商業||零部件市場::其他||Manufacturing::科技||不鏽鋼::其他||水管修繕::房地產興趣||金屬加工::房地產興趣||建材::科技||Home improvement::家居||Home renovation::家居||傢俱::家居||Small business::其他||改裝車::交通||配電系統::其他||Commuting::其他",loc:"",lx:"訊息"},{ta:"35-55 / 中清洲際 / 老闆高管",proj:"家羽醇華",tags:"佳士得::其他||Art auction::其他||Luxury::旅遊生活||路易威登::時尚美妝||愛馬仕::時尚美妝||Art exhibitions::娛樂||勞力士::時尚美妝||Business leaders::金融||Senior management::其他||保時捷::其他||賓士::交通||管理::商業||Investment::金融||Private banking::其他||Entrepreneurship::商業",loc:"",lx:"訊息"},{ta:"30-60 / 北屯太平潭子 / 餐廳零售業",proj:"大城二月埕",tags:"管理::商業||食品和飲品::美食||Coffee::美食||Cooking::美食||中式料理::美食||韓式料理::美食||日本料理::美食||零售業::科技||Business development::商業||Social media marketing::商業||廚具::家居||節慶::旅遊生活||Instagram 商業檔案管理員::其他||LifeStyle Food::其他||Food::其他",loc:"",lx:"名單"},{ta:"35-55 / 西屯水湳 / 金融投資",proj:"家羽醇華",tags:"金融經濟學::其他||Trading strategy::金融||Passive income::商業||Investment::金融||Asset management::金融||納斯達克100指數::其他||倫敦證券交易所::金融||美國運通::其他||現金::其他||特斯拉汽車::交通||NVIDIA GeForce::其他||Real estate::房地產興趣||黃金::科技",loc:"",lx:"訊息"},{ta:"30-55 / 竹科關埔 / 精品私校教育",proj:"元方學府首席1",tags:"私立學校::教育||國際學校::教育||Bilingual education::其他||樂器::樂器||Art::娛樂||兒童發展::教育||Luxury::商業||Gardening::家居||Luxury vehicle::交通||Terrace::家居||Stock market::金融||High-net-worth individual::商業",loc:"",lx:"名單"},{ta:"30-50 / 大台中 / 金融投資",proj:"原潮APT",tags:"Investment::金融||Trading strategy::金融||Passive income::商業||Foreign exchange market::金融||黃金::科技||石油::其他||Stock market::金融||News media::娛樂||Semiconductor::其他||Luxury::商業||航空公司::其他||Smart home automation::科技||一般保險::金融",loc:"",lx:"名單"},{ta:"30-50 / 鹿港和美 / 零售批發自營",proj:"坤辰師大苑",tags:"Business model::金融||零售業::科技||批發::商業||產品::商業||經銷::商業||供應鏈::其他||居家事業::商業||電子商務::商業||自僱::商業||貿易::金融||Marketing::商業||Online advertising::商業||價格::其他||Accounting::商業||商家的粉絲專頁管理員::其他",loc:"",lx:"名單"},{ta:"**30-60 / 新北三重 / 科技業+旅遊",proj:"家悦美(主)",tags:"House::房地產興趣||Travel::科技||Big data::科技||免稅商店::其他||智慧科技::科技||高科技::科技||新興技術::科技||飯店::旅遊生活||Real estate::科技||Hotels.com::旅遊生活||Trivago::其他||Booking.com::旅遊生活",loc:"",lx:"名單"},{ta:"30-55 / 大埤斗南 / 食品代工",proj:"中祐雅苑",tags:"Townhouse::房地產興趣||自僱::商業||代工生產::其他||製造生產服務和組織::商業||Food industry::其他||食品加工::其他||化學::其他||環境科學::科技||包裝和標籤::商業||急凍食品::其他||飲料::美食||批發::商業||物流::商業||一般保險::金融",loc:"",lx:"訊息"},{ta:"30-60 / 北區東區 / 教育/投資",proj:"元方大景首席",tags:"Education::社會||學習::教育||課程::教育||學校::教育||文學::娛樂||Interior design::商業||電子書::娛樂||Personal finance::金融||Financial planning::金融||Stock market::金融||書籍::娛樂||Real estate investing::金融",loc:"",lx:"名單"},{ta:"30-60 / 東區竹東 / 研究/高知識/綠生活",proj:"元方大景首席",tags:"科學::期刊||Higher education::教育||Education::教育||自然科學::其他||哲學::其他||研究所教育::教育||財經::商業||文學::娛樂||實驗室::其他||新興技術::科技||大眾媒體::娛樂||工程和理工學院::教育||數學::其他||植物園::其他||森林生態學::其他||觀賞植物::農業自然",loc:"",lx:"名單"},{ta:"30-55 / 伸港鹿港線西 / 科技家庭自住",proj:"至善人本",tags:"Shenkang::其他||T'Ai-Wan::其他||生活用品::家居||家務::家居||家電::科技||傢俱::家居||一般保險::金融||House::房地產興趣||591房屋交易網::其他||Interior design::商業||排屋::其他||Townhouse::房地產興趣||iPhone::科技||Internet of things::其他||智慧科技::科技",loc:"",lx:"訊息"},{ta:"(test)30-55/中科水湳中清/房地產/股票",proj:"原潮APT",tags:"Real estate::房地產興趣||591房屋交易網::其他||股市指數期貨::金融||Stock market::金融||Financial planning::金融||證券::金融||Stock broker::金融||Trading strategy::金融",loc:"",lx:"1510"},{ta:"(test)30-55/中科水湳中清/房地產/股票",proj:"原潮APT",tags:"Food service::美食||Restaurant management::其他||Business model::金融||食品保存::其他||飲料::美食||中式料理::美食||Coffee::美食||在地美食::美食||早午餐::美食||輪班工作制::商業",loc:"",lx:"1510"},{ta:"30-60 / 新北三重 / 資訊/金融期貨",proj:"家悦美(主)",tags:"資料管理::科技||資料分析::金融||資料視覺化::科技||Machine learning::科技||防毒軟體::其他||金融經濟學::其他||Investment::金融||Stock market::金融||Passive income::商業||黃金::科技||石油::其他||Semiconductor::其他||Luxury::商業||航空公司::其他||Smart home automation::科技||Trading strategy::金融",loc:"",lx:"名單"},{ta:"30-60 / 林口蘆竹 / 精品/藝術品/投資",proj:"家悦美(主)",tags:"Contemporary art::娛樂||Art exhibitions::娛樂||Art::娛樂||雕刻::娛樂||寶石::科技||裝飾風藝術::其他||花卉::農業自然||美國運通::其他||納斯達克100指數::其他||Investment::金融||插花::其他||Passive income::商業||Collectibles::興趣||石英::其他||黃金::科技||Luxury::商業||Real estate::科技",loc:"",lx:"名單"},{ta:"30-65/南興公園+6/金融投資",proj:"景立方層峰-主",tags:"Investment::金融||Trading strategy::金融||Passive income::商業||Foreign exchange market::金融||黃金::科技||石油::其他||Stock market::金融||News media::娛樂||Semiconductor::其他||Luxury::商業||航空公司::其他||Smart home automation::科技||一般保險::金融",loc:"",lx:"名單"},{ta:"30-60 / 員林埔心 / 軍公教/教育 / (參考後台30-65/員林 永靖/軍公教 重教育家長 )",proj:"坤悅原鄰薈",tags:"歌唱::娛樂||benefit::軍事||表演藝術::娛樂||圖書館::其他||假期::旅遊生活||Online learning::教育||Current events::社會||英語::語言||婚禮::社會||師範教育::商業||政府::社會||YouTube::娛樂||休旅車::交通||掀背車::交通",loc:"",lx:"訊息"},{ta:"30-65/南興公園+6/置產/醫師/高管",proj:"景立方層峰-主",tags:"Small and medium enterprises::商業||Personal finance::金融||金融服務::商業||生物技術::其他||特斯拉汽車::交通||Stock market::金融||Real estate development::房地產興趣||Fitness::健康運動||生物學::科技||書籍::娛樂||醫學院::教育||Real estate::科技||管理::商業",loc:"",lx:"名單"},{ta:"30-65/南興公園+6/政治/置產/科技",proj:"景立方層峰-副",tags:"House::房地產興趣||社會運動::社會||Financial market::金融||Personal finance::金融||Big data::科技||Machine learning::科技||iPad::其他||Passive income::商業||Current events::社會||Stock market::金融||MacBook Pro::其他||Real estate investing::金融||政府機關概念和作法::社會||金融經濟學::其他||政治和社會議題::社會||地緣政治學::其他",loc:"",lx:"名單"},{ta:"35-65 / 青埔竹科 / 金融投資",proj:"新大墨",tags:"金融經濟學::其他||Trading strategy::金融||Investment::金融||Asset management::金融||納斯達克100指數::其他||倫敦證券交易所::金融||美國運通::其他||現金::其他||特斯拉汽車::交通||英偉達::其他||Real estate::房地產興趣||黃金::科技",loc:"",lx:"名單"},{ta:"30-60 / 彰市 / 自營商/醫律/投資",proj:"坤悅原鄰薈",tags:"Interior design::商業||律師事務所::法律和法律諮詢服務||批發::商業||供應鏈::其他||Personal finance::金融||經銷::商業||出口貿易::其他||電子商務::商業||Food industry::其他||生物學::科技||Investment::商業||醫學院::教育||Real estate::科技||居家事業::商業||財產保險::其他||零售業::科技||Small business::其他",loc:"",lx:"名單"},{ta:"30-55/中科水湳中清/科技自營商A",proj:"原潮APT",tags:"Automation::其他||Information technology::科技||591房屋交易網::其他||工程::科技||力學::其他||金屬::其他||Current events::社會||電機工程::科技||高科技::科技||機械工程::科技||Electrical engineering::其他||Consumer electronics::科技||科技::科技||資訊::其他||科技早期採用者::其他",loc:"",lx:"名單"},{ta:"30-55/十期+8/科技新貴/旅遊",proj:"原潮APT",tags:"House::房地產興趣||Big data::科技||圖形處理器::其他||航空公司::其他||高科技::科技||Travel::科技||http://hotels.com/::旅遊生活||http://booking.com/::旅遊生活||Real estate::科技",loc:"",lx:"1510"},{ta:"",proj:"AI識別：商業",tags:"Social media marketing::商業||Influencer marketing::商業||病毒營銷::其他||Lead generation::商業||Instagram::科技||Online advertising::商業||速食休閒餐廳::美食||烘培坊::美食||鮭魚::其他||Apple Music::其他||YouTube::娛樂||Mobile payment::金融||韓式料理::美食||蛋糕::美食",loc:"",lx:"名單"},{ta:"",proj:"AI識別：商業/科技",tags:"Marketing::商業||Digital marketing::商業||折扣商店::商業||綜藝節目::娛樂||傢俱::家居||韓國電視劇::娛樂||Influencer marketing::商業||Online shopping::商業||居家裝潢零售商::商業||廣告::商業||Design::商業||政府::社會||平面設計::娛樂||服裝::時尚美妝",loc:"",lx:"名單"},{ta:"",proj:"AI識別：居家",tags:"Home improvement::家居||Interior design::商業||現代家具::家居||百葉簾::其他||窗戶::房地產興趣||宜家家居::商業||居家飾品::家居||居家裝潢零售商::商業||美學::社會||Lifestyle::旅遊生活||Household::商業||LifeStyle Home::其他||室內建築::房地產興趣||Home renovation::家居||Architecture & Interior Design::其他",loc:"",lx:"訊息"},{ta:"",proj:"AI識別：旅遊/居家",tags:"戶外休閒活動::旅遊生活||Ecotourism::旅遊生活||Nature photography::娛樂||野餐::食品和飲料||Home improvement::家居||Camping::旅遊生活||大自然::科技||Independent travel::旅遊||草地::家居||Lifestyle Travel::其他||Weekend Getaway 0108 +休旅車營地::旅遊生活||Prefabricated home::其他||居家風格和類型::房地產興趣",loc:"",lx:"名單"},{ta:"",proj:"未命名",tags:"Skin care::其他||維修和操作::房地產興趣||Manufacturing::科技||物流::商業||工廠::商業||機械加工::其他||工具機::家居||批發::商業||機器::其他||經銷::商業||House::房地產興趣||591房屋交易網::其他||White-collar worker::娛樂||Social media::網路媒體",loc:"",lx:"訊息"},{ta:"",proj:"AI識別：美食/金融/居家",tags:"加工出口工廠::其他||Manufacturing::科技||Food industry::其他||Textile industry::其他||Investment::商業||Real estate::科技||Return on investment::金融||批發::商業||News media::娛樂||Current events::社會||Online shopping::商業||Personal finance::金融",loc:"南屯工業區、烏日高鐵站、彰化車站、追分車站",lx:"名單"},{ta:"",proj:"AI識別：居家",tags:"591房屋交易網::其他||Real estate::房地產興趣||Condominium::房地產興趣||金融服務::商業||金錢::金融||促銷::商業||政府::社會||團購::其他||證券::金融||Banking::金融||Education::其他||優惠券::其他",loc:"",lx:"名單"},{ta:"",proj:"AI識別：金融",tags:"保單::金融||Life insurance::金融||業務::商業||零售銀行業務::金融||Investment::金融||Banking::金融||金融服務::商業||證券交易所::金融||股市指數::金融||技術員::其他||Manufacturing::科技||製造生產服務和組織::商業||工廠::商業||Stock broker::金融||配電系統::其他||代工生產::其他||White-collar worker::娛樂||熱門話題::其他",loc:"",lx:"訊息"},{ta:"",proj:"AI識別：育兒教育/居家/科技",tags:"生產::其他||Parenting::其他||新生兒派對::教育||Household::社會||White-collar worker::娛樂||LINE::其他||傢俱::家居||Interior design::商業||熱門話題::其他||淘寶網::其他||Online shopping::科技||Popular culture::社會||促銷::商業||婚禮::社會||Beauty::社會||iPhone::科技||Personal finance::金融||591房屋交易網::其他||Real estate::科技",loc:"",lx:"訊息"},{ta:"",proj:"AI識別：育兒教育/居家",tags:"Parenting::教育||廚房::家居||Interior design::商業||現代家具::家居||家電::科技||Early childhood education::教育||生活用品::家居||運動::健康運動||暑假::教育||草地::家居||任天堂::遊戲機和相關配件||Pet::農業自然||Dog grooming::農業自然||犬隻健康::農業自然||Dog walking::狗狗||貓糧::農業自然||排屋::其他||別墅::旅遊生活",loc:"",lx:"訊息"},{ta:"",proj:"AI識別：商業",tags:"居家事業::商業||Passive income::商業||自僱::商業||女性企業家::商業||獨資企業::商業||Entrepreneurship::金融||美學::社會||Design::商業||Beauty::社會||Business model::金融||Marketing::商業||Photography::娛樂||Keratin::其他||髮型::時尚美妝||Interior design::商業||零售業::科技||Business::商業||Small business::其他",loc:"",lx:"名單"},{ta:"",proj:"AI識別：美食",tags:"簡餐館::美食||甜點::美食||在地美食::美食||烘培坊::美食||火鍋::其他||燒烤::美食||韓式料理::美食||Gourmet::美食||壽司::美食||鮭魚::其他||Netflix::娛樂||Spotify::娛樂||Apple Music::其他||YouTube::娛樂||UberEATS::其他||Mobile payment::金融",loc:"",lx:"名單"},{ta:"",proj:"AI識別：金融/商業",tags:"金錢::金融||Passive income::商業||Investment::金融||Financial planning::金融||Asset management::金融||經濟學::金融||Accounting::其他||註冊會計師::其他||Private banking::其他||財務顧問::金融||納斯達克100指數::其他||當沖交易::金融||私募基金::其他||Private equity::金融||電腦運算::其他||財經::商業||財務會計::商業||Business::商業||Real estate investing::金融||Wealth management::金融||道瓊斯工業平均指數::其他||證券交易所::金融||股份::金融",loc:"",lx:"名單"},{ta:"",proj:"AI識別：科技/商業/時尚美妝",tags:"Apple Watch::科技||智慧科技::科技||Wearable technology::科技||新興技術::科技||Internet of things::其他||Business::金融||Online shopping::商業||Fashion::商業||Interior design::商業||現代家具::家居||宜家家居::商業||Current events::社會||Food::美食||排屋::其他||Townhouse::房地產興趣",loc:"",lx:"訊息"},{ta:"",proj:"AI識別：居家/美食",tags:"學習::教育||書籍::娛樂||News media::娛樂||學校::教育||社區議題::法律與政府||Household::社會||LifeStyle Food::時尚美妝||健康和保健::時尚美妝||Social media::網路媒體||政府機關概念和作法::社會",loc:"",lx:"訊息"},{ta:"",proj:"AI識別：居家",tags:"生活用品::家居||家務::家居||家電::科技||傢俱::家居||一般保險::金融||House::房地產興趣||591房屋交易網::其他||Interior design::商業||排屋::其他||Townhouse::房地產興趣||iPhone::科技||Internet of things::其他||智慧科技::科技",loc:"",lx:"訊息"},{ta:"",proj:"AI識別：商業",tags:"零售業::科技||批發::商業||經銷::商業||供應鏈::其他||居家事業::商業||Small business::商業||銀行帳戶::金融||貿易::金融||電子商務::商業||Marketing::商業||Social media marketing::商業||Influencer marketing::商業||Business model::金融||Online shopping::商業||Internet of things::其他||排屋::其他||Townhouse::房地產興趣||火鍋::其他||速食休閒餐廳::美食||Apple Watch::科技",loc:"",lx:"訊息"},{ta:"",proj:"AI識別：商業",tags:"經銷::商業||零售業::科技||進口::商業||出口貿易::其他||業務::商業||直運::商業||物流::商業||Business::商業||資金::其他||591房屋交易網::其他||Real estate::科技||Electric vehicle::交通||Automobile::交通||Facebook 付款用戶::其他",loc:"",lx:"訊息"},{ta:"",proj:"AI識別：美食",tags:"Food industry::其他||包裝和標籤::商業||製造生產服務和組織::商業||機械加工::其他||Electrical engineering::其他||保單::金融||超市::美食||技術員::其他||Automobile::交通||休閒餐廳::美食||Online shopping::商業||Digital media::科技||家電::科技||Home improvement::家居||彩券::娛樂||Cycling::交通",loc:"",lx:"名單"},{ta:"",proj:"AI識別：科技/娛樂",tags:"Taiwankou::其他||T'Ai-Wan::其他||White-collar worker::娛樂||PC Gamer::其他||Spotify::娛樂||演唱會::音樂活動||戶外休閒活動::旅遊生活||歌唱::娛樂||Music::旅遊生活||甜點::美食||派對::旅遊生活||網路遊戲::娛樂||野餐::食品和飲料||攀岩::極限運動||Stock market::金融||卡拉OK::其他||Camping::旅遊生活||Netflix::娛樂||拼圖::其他||攀石::其他||Hiking::爬山||Real estate investing::金融||運動類遊戲::娛樂||電腦遊戲::娛樂||Real estate::房地產興趣||電玩遊戲::娛樂||Social media::網路媒體||YouTube::娛樂",loc:"",lx:"名單"},{ta:"",proj:"AI識別：育兒教育",tags:"婚禮::社會||婚宴::旅遊生活||訂婚戒指::珠寶||媽媽寶寶-懷孕::其他||生產::其他||Parenting::其他||喜帖::旅遊生活||餐廳::美食",loc:"",lx:"名單"},{ta:"",proj:"AI識別：居家/金融",tags:"Real estate::房地產興趣||Real estate investing::金融||Condominium::房地產興趣||Leasing::房地產興趣||591房屋交易網::其他",loc:"",lx:"名單"},{ta:"",proj:"AI識別：育兒教育/金融",tags:"研究所教育::教育||科學::期刊||研究::其他||文學::娛樂||Education::教育||新興技術::科技||實驗室::其他||Investment::商業||財經::商業||新聞播報::娛樂||智慧科技::科技||工程和理工學院::教育||理工學院::其他",loc:"",lx:"訊息"},{ta:"",proj:"AI識別：科技/商業",tags:"Artificial intelligence::科技||Big data::科技||新興技術::科技||Semiconductor::其他||Internet of things::其他||Business::金融||軟體開發::科技||Software engineering::科技||iPhone::科技||Python::程式語言||GitHub::其他||Food::美食||Travel::旅遊生活||http://booking.com/::旅遊生活||免稅商店::其他||Interior design::商業||Wine tasting::美食||數位貨幣::金融",loc:"",lx:"訊息"},{ta:"",proj:"AI識別：金融",tags:"儲蓄::金融||儲蓄帳戶::金融||存款帳戶::金融||儲蓄互助社::其他||Financial planning::金融||信用額度::金融||金錢::金融||Passive income::商業||Investment::商業||現金::其他||Stock market::金融||White-collar worker::娛樂||優惠券::商業||折扣和折讓::商業||7-11::其他||便利商店::商業||超市::美食||熱門話題::其他||591房屋交易網::其他",loc:"",lx:"名單"},{ta:"",proj:"AI識別：科技/居家",tags:"建材::科技||結構工程::其他||砌體結構::其他||Sustainable architecture::其他||整建::房地產興趣||News media::娛樂||Open house::商業||Kitchen appliances::商業||Home decor::家居||Lifestyle::旅遊生活||Quality of life::健康運動||Mental health::健康運動||營建管理::其他",loc:"",lx:"訊息"},{ta:"",proj:"AI識別：金融/科技",tags:"Wealth::金融||Investment::商業||收入::商業||Automobile::交通||電子商務::商業||Stock market::金融||Badminton::球拍類運動||酒精飲品::美食||591房屋交易網::其他||排屋::其他||Townhouse::房地產興趣||New Home::其他",loc:"",lx:"訊息"},{ta:"",proj:"AI識別：商業/科技",tags:"Marketing::商業||Digital marketing::商業||折扣商店::商業||綜藝節目::娛樂||傢俱::家居||韓國電視劇::娛樂||Influencer marketing::商業||Online shopping::商業||居家裝潢零售商::商業||廣告::商業||Design::商業||政府::社會||行政服務::其他||宜家家居::商業||雅高達::其他||銀行帳戶::金融||Business model::金融||簡餐館::美食",loc:"",lx:"名單"},{ta:"",proj:"AI識別：金融/商業",tags:"財經::商業||Accounting::商業||Personal finance::金融||Financial planning::金融||金融服務::商業||Banking::金融||Entrepreneurship::商業||Investment::商業||財務會計::商業||Business::商業||Wealth management::金融||Small business::其他",loc:"",lx:"名單"},{ta:"",proj:"AI識別：育兒教育/旅遊/居家",tags:"Language education::其他||外語::其他||航空公司::其他||Education::社會||工程和理工學院::教育||Travel::旅遊生活||慢跑::跑步||Gardening::家居||超市::美食||生活用品::家居||韓國電視劇::娛樂||Beauty::社會||美學::社會||Business model::金融||Coffee::美食",loc:"",lx:"1510"},{ta:"",proj:"AI識別：商業",tags:"網路名人::其他||YouTube::娛樂||Social media marketing::商業||Business model::金融||Affiliate marketing::商業||電子商務::商業||自由工作者::商業||自僱::商業||Passive income::商業||直銷::其他||獨資企業::商業||Entrepreneurship::金融||居家事業::商業||591房屋交易網::其他||House::房地產興趣||網紅創作者::其他",loc:"",lx:"1510"},{ta:"",proj:"AI識別：時尚美妝/科技",tags:"服裝::時尚美妝||Online shopping::商業||Fashion::時尚美妝||Beauty::時尚美妝||髮型::時尚美妝||快時尚::時尚美妝||Mobile payment::金融||MBA::金融||LINE::其他||Netflix::娛樂||流行音樂::娛樂||休閒娛樂::社會||麥當勞::美食||街頭時尚::時尚美妝||運動場所::健康運動||Personal finance::金融||燒烤::美食||Beer::美食||假期::旅遊生活||591房屋交易網::其他",loc:"",lx:""},{ta:"",proj:"AI識別：居家/育兒教育/美食",tags:"Household::社會||Parenting styles::教育||私立學校::教育||基本英語::其他||兒童發展::教育||宮崎駿::其他||樂高::教育||Food::美食||Healthy cooking::美食||早午餐::美食||Cooking::美食||壽司::美食||燒牛肉::其他||鮭魚::其他||Gourmet::美食||氣泡酒::美食",loc:"",lx:"1510"},{ta:"",proj:"AI識別：科技/旅遊",tags:"智慧科技::科技||Artificial intelligence::科技||Big data::科技||新興技術::科技||Travel::旅遊生活||飯店::旅遊生活||http://booking.com/::旅遊生活||http://hotels.com/::旅遊生活||Trivago::其他||Real estate::科技||House::房地產興趣||免稅商店::其他",loc:"",lx:"名單"},{ta:"",proj:"AI識別：育兒教育/金融",tags:"學術研討會::其他||研究::其他||展覽館::其他||Higher education::教育||Education::社會||Investment::商業||新聞播報::娛樂||大眾媒體::娛樂||財經::商業||House::房地產興趣||591房屋交易網::其他",loc:"",lx:"名單"},{ta:"",proj:"AI識別：科技/旅遊",tags:"智慧科技::科技||Artificial intelligence::科技||Big data::科技||新興技術::科技||Travel::旅遊生活||飯店::旅遊生活||Booking.com::旅遊生活||Hotels.com::旅遊生活||Trivago::其他||Real estate::科技||House::房地產興趣||免稅商店::其他",loc:"",lx:"訊息"},{ta:"",proj:"AI識別：育兒教育/金融",tags:"學術研討會::其他||研究::其他||展覽館::其他||Higher education::教育||Education::社會||Investment::商業||新聞播報::娛樂||大眾媒體::娛樂||財經::商業||House::房地產興趣||591房屋交易網::其他",loc:"",lx:"訊息"},{ta:"",proj:"AI識別：娛樂/育兒教育/科技/美食",tags:"Contemporary art::娛樂||Educational resources::教育||Art exhibitions::娛樂||Craft Beer and Brewing::其他||早午餐::美食||Language education::其他||Women's clothing::時尚美妝||Men's clothing::時尚美妝||Full English breakfast::其他||Professional development::商業||Party planning::特殊場合和活動||Independent travel::旅遊||Specialty coffee::美食||HydraFacial 1223 +Spotify::娛樂||Adventure travel::旅遊生活||Camping::旅遊生活||Craft brewing::美食",loc:"",lx:"名單"},{ta:"",proj:"AI識別：美食",tags:"新興技術::科技||Semiconductor::其他||Food industry::其他||能源::科技||物流::商業",loc:"",lx:"名單"},{ta:"",proj:"AI識別：育兒教育",tags:"婚宴::旅遊生活||喜帖::旅遊生活||婚紗攝影::娛樂||媽媽寶寶-懷孕::其他||生產::其他||Parenting::其他||戒指::珠寶||結婚蛋糕 1127主粉專 -結婚蛋糕::旅遊生活||兒童文學::娛樂||私立學校::教育||蒙台梭利教育法::其他||婚禮::社會||親子::娛樂",loc:"",lx:"訊息"},{ta:"",proj:"AI識別：居家/金融",tags:"Real estate::房地產興趣||Real estate investing::金融||Real estate development::房地產興趣||Investment club::俱樂部||創意房地產投資::房地產興趣||591房屋交易網::其他",loc:"",lx:"名單"},{ta:"",proj:"AI識別：科技/商業",tags:"T'Ai-Wan::其他||Business model::金融||Entrepreneurship::商業||獨資企業::商業||酒精飲品::美食||產品經理::其他||Luxury vehicle::交通||高級訂製時裝::時尚美妝||經常旅行的用戶::其他||Small business::其他||國際飛行常客::其他||副總經理::其他||創辦人::其他||總監::其他||董事長 0112 +生產率::其他||Business incubator::其他||Business development::商業||Business opportunities::金融",loc:"",lx:"名單"},{ta:"",proj:"AI識別：科技/金融",tags:"Credit card::金融||儲蓄::金融||Passive income::商業||Financial planning::金融||Online banking::金融||納斯達克100指數::其他||股市指數::金融||共同基金::金融||一般保險::金融||Real estate::科技||Real estate listing websites::科技||Interior design::商業||地板::其他||Home improvement::家居",loc:"",lx:"名單"},{ta:"",proj:"AI識別：育兒教育/居家/科技",tags:"學習::教育||Online learning::教育||Professional development::商業||政府機關概念和作法::社會||財政預算案::其他||Household::社會||Fitness::健康運動||News media::娛樂||Insurance::商業||Current events::社會||Education::其他||軍事::社會||政府員工::社會||社區和社會服務 0109 擴大::其他",loc:"",lx:"名單"},{ta:"",proj:"AI識別：育兒教育/居家",tags:"傢俱::家居||Parenting::教育||新生兒派對::教育||家電::科技||兒童::教育||Real estate::房地產興趣||家長：家長::子女最大 12 個月||嬰幼兒家長::其他||學齡前兒童的家長::其他||低年級學童的家長::其他||青少年學童的家長 0108 +嬰幼兒和孕婦用品店::其他||Parenting styles::教育||超市::美食||Beer::美食",loc:"",lx:"名單"},{ta:"",proj:"AI識別：科技",tags:"Taiwankou::其他||T'Ai-Wan::其他||醫學院::教育||律師::法律和法律服務||法律::法律和法律服務||科學::期刊||軟體開發::科技||程式語言::科技||Software engineering::科技||電腦科學::科技||網站開發::科技||Fitness::健康運動||Consumer electronics::科技||Household::社會||Business model::金融||轎車::交通||House::房地產興趣||別墅::旅遊生活",loc:"",lx:"訊息"},{ta:"",proj:"AI識別：金融/商業",tags:"公司::商業||Personal finance::金融||Business model::金融||Passive income::商業||Startups::商業||Entrepreneurship::商業||獨資企業::商業||Investment::商業||Business::商業||Real estate investing::金融||Wealth::金融||居家事業::商業||Real estate::房地產興趣||收入::商業",loc:"",lx:"訊息"},{ta:"",proj:"未命名",tags:"居家事業::商業||收入::商業||食品和飲品::美食||指甲彩繪::時尚美妝||美甲::時尚美妝||美甲沙龍::時尚美妝||足部護理::時尚美妝||Keratin::其他||髮型::時尚美妝||自僱::商業||律師::法律和法律服務||自由工作者::商業||律師事務所::法律和法律諮詢服務||零售業::科技||批發::商業||經銷::商業||早午餐::美食||Small business::其他",loc:"",lx:"訊息"},{ta:"",proj:"AI識別：育兒教育/居家",tags:"Parenting::教育||廚房::家居||Interior design::商業||現代家具::家居||家電::科技||Early childhood education::教育||生活用品::家居||運動::健康運動||暑假::教育||草地::家居||任天堂::遊戲機和相關配件||Pet::農業自然||Dog grooming::農業自然||Dog walking::狗狗||犬隻健康::農業自然||貓糧::農業自然",loc:"",lx:"訊息"},{ta:"",proj:"AI識別：居家/育兒教育",tags:"廚房::家居||閱讀::娛樂||Gardening::旅遊生活||Parenting::教育||Home improvement::家居||591房屋交易網::其他||Early childhood education::教育||Education::社會||大自然::科技||Cycling::健康運動||書籍::娛樂||Household::社會||Real estate::科技||Cooking::美食||質感設計::其他",loc:"Hong、Wen、International、School、后里運動公園、豐原車站、台中環線、台中市、Taichung",lx:"訊息"},{ta:"",proj:"AI識別：金融/居家/商業",tags:"Passive income::商業||Real estate investing::金融||Wealth::金融||Real estate::房地產興趣||公司::其他||收入::商業||Entrepreneurship::商業||Business::商業||獨資企業::商業||Franchising::商業||Startups::商業||居家事業::商業",loc:"慈眀高中、環中東路七段、台中市、環中東路三段、台中市、Taichung",lx:"訊息"},{ta:"",proj:"AI識別：旅遊/美食/時尚美妝/育兒教育",tags:"Travel Deals::其他||LifeStyle Food::其他||Men's clothing::時尚美妝||Women's clothing::時尚美妝||Educational resources::教育||Craft Beer and Brewing::其他||Party planning::特殊場合和活動||早午餐::美食||Full English breakfast::其他||World Gym::其他||Contemporary art::娛樂||Language education::其他||Adult education::商業||Professional development::商業||Digital art::其他||Independent travel::旅遊",loc:"",lx:"訊息"},{ta:"",proj:"AI識別：美食/時尚美妝/旅遊/科技",tags:"Professional services::其他||LifeStyle Food::其他||Podcast::音樂和音訊串流||Men's clothing::時尚美妝||Women's clothing::時尚美妝||Consumer electronics::科技||Travel Deals::其他||Apple Music::其他||Financial planning::金融||Tech news::娛樂||行動應用程式::科技||Fitness::健康運動||Educational resources::教育||休閒餐廳::美食||生產率 1224 +數位媒體::科技||lending::金融",loc:"",lx:"訊息"},{ta:"",proj:"AI識別：科技/金融",tags:"儲蓄::金融||White-collar worker::娛樂||超市::美食||配電系統::其他||Personal finance::金融||折扣和折讓::商業||Insurance::商業||技術員::其他||數位相機::相機和相機設備||Food industry::其他||玻璃::其他||Household::社會||佳能企業::其他||代工生產::其他||休閒活動::旅遊生活||Industrial engineering::科技||科技::科技||製造生產服務和組織::商業||Commuting::其他",loc:"",lx:"訊息"},{ta:"",proj:"AI識別：居家",tags:"廚房::家居||廚具::家居||餐具::其他||家電::科技||家務::家居||中式料理::美食||生活用品::家居||Household::社會||Parenting::教育||Personal finance::金融||優惠券::商業||超市::美食||一般保險::金融||591房屋交易網::其他||Financial planning::金融||Home improvement::家居",loc:"",lx:"訊息"},{ta:"",proj:"AI識別：時尚美妝",tags:"排屋::其他||代工生產::其他||Lifestyle content::商業||別墅::旅遊生活||文化遺產::藝術和文化||Tourist attractions::旅遊生活||行動應用程式::科技||Google地圖::其他||五金行::商業||印刷::出版||真空包裝::其他||Real estate::房地產興趣||Commuting::其他||政府員工::社會||漁業 0113 +連棟住宅::房地產興趣||食品加工::其他||配電系統::其他||民俗學::其他||節慶::旅遊生活||tea leaf::美食||Recreational fishing::釣魚",loc:"",lx:"訊息"},{ta:"",proj:"AI識別：科技",tags:"Manufacturing::科技||代工生產::其他||Agriculture::農業自然||現金回贈獎勵方案::金融||Loyalty program::其他||折扣和購物回饋)::其他||Compensation and benefits::其他||Workwear::其他||Lifestyle::旅遊生活||Parenting styles::教育||Household::關係||Lifestyle content::商業||排屋::其他||別墅::旅遊生活||科技早期採用者::其他",loc:"",lx:"訊息"},{ta:"",proj:"AI識別：科技/時尚美妝/金融",tags:"YCM 永進機械 Yeong Chin Machinery Industries Co.::其他||服裝::時尚美妝||購物中心::商業||Beauty::社會||Fashion::時尚美妝||快時尚::時尚美妝||儲蓄::金融||Personal finance::金融||熱門話題::其他||Online banking::金融||淘寶網::其他||Online shopping::商業||Mobile payment::金融||LINE::其他||行動應用程式::科技||Craft brewing::美食||運動::健康運動||休閒娛樂::社會||Netflix::娛樂||Spotify::娛樂||591房屋交易網::其他",loc:"",lx:"訊息"},{ta:"",proj:"AI識別：居家/科技",tags:"House::房地產興趣||Condominium::房地產興趣||起步房::房地產興趣||591房屋交易網::其他||Real estate listing websites::科技||Real estate::金融||Leasing::房地產興趣||由擁有者出售::房地產興趣",loc:"",lx:"訊息"},{ta:"",proj:"AI識別：居家/時尚美妝",tags:"Interior design::商業||Design::商業||住家修繕::居家裝修||平面設計::娛樂||網站設計::科技||Fashion::商業||服裝::時尚美妝||休閒娛樂::社會||休閒遊戲::娛樂||Online shopping::商業||百貨公司::商業||House::房地產興趣||Real estate listing websites::科技||Home improvement::家居||休閒餐廳::美食||Beauty::社會||居家事業::商業",loc:"",lx:"訊息"},{ta:"",proj:"AI識別：育兒教育/居家",tags:"News media::娛樂||書籍::娛樂||文化::社會||財經::商業||Television::其他||Education::社會||圖書館::其他||House::房地產興趣||Apartment::房地產興趣||Real estate investing::金融||591房屋交易網::其他||Real estate listing websites::科技",loc:"",lx:"訊息"},{ta:"",proj:"AI識別：旅遊/美食",tags:"求婚::旅遊生活||婚禮::社會||Travel::旅遊生活||Booking.com::旅遊生活||Trivago::其他||Hotels.com::旅遊生活||Coffee::美食||星巴克::美食||宜家家居::商業||家電::科技||591房屋交易網::其他||Real estate listing websites::科技",loc:"",lx:"訊息"},{ta:"",proj:"AI識別：金融/健康運動",tags:"Luxury vehicle::交通||收入::商業||Stock market::金融||金錢::金融||數位貨幣::金融||體育::其他||運動::健康運動||Running::健康運動||Wealth::金融||Foreign exchange market::金融||戶外休閒活動::旅遊生活||House::房地產興趣||591房屋交易網::其他",loc:"竹南科學園區、新竹科學工業園區、竹南獅山親子公園",lx:"訊息"},{ta:"",proj:"AI識別：金融/居家",tags:"工廠::商業||加工出口工廠::其他||Manufacturing::科技||物流::商業||Insurance::商業||保單::金融||Household::社會||超市::美食||量販店::美食||家樂福::其他||Home improvement::家居||五金行::商業||Real estate::科技||591房屋交易網::其他",loc:"",lx:"訊息"},{ta:"",proj:"AI識別：美食",tags:"簡餐館::美食||甜點::美食||在地美食::美食||烘培坊::美食||火鍋::其他||燒烤::美食||韓式料理::美食||Gourmet::美食||壽司::美食||鮭魚::其他||Netflix::娛樂||Spotify::娛樂||Apple Music::其他||YouTube::娛樂||UberEATS::其他||Mobile payment::金融||速食休閒餐廳::美食||速食餐廳::美食||自助餐::其他||真人實境秀::娛樂",loc:"",lx:"訊息"},{ta:"",proj:"AI識別：時尚美妝/金融",tags:"服裝::時尚美妝||購物中心::商業||Beauty::社會||Fashion::時尚美妝||Cosmetics::時尚美妝||Personal finance::金融||儲蓄::金融||熱門話題::其他||Online banking::金融||Online shopping::商業||淘寶網::其他||momo購物網::其他||Mobile payment::金融||LINE::其他||行動應用程式::科技||流行音樂::娛樂||Beer::美食||UberEATS::其他||運動::健康運動||591房屋交易網::其他||Real estate listing websites::科技",loc:"",lx:"訊息"},{ta:"",proj:"AI識別：育兒教育/居家/美食/旅遊",tags:"書籍::娛樂||廚房::家居||Education::社會||大自然::科技||Household::社會||Cooking::美食||Travel::科技||休閒活動::旅遊生活||假期::旅遊生活||Real estate::科技||591房屋交易網::其他||樂屋網::其他",loc:"",lx:"訊息"},{ta:"",proj:"AI識別：金融/科技",tags:"Wealth::金融||Investment::商業||收入::商業||Automobile::交通||電子商務::商業||Stock market::金融||Badminton::球拍類運動||酒精飲品::美食||Real estate::科技||House::房地產興趣||591房屋交易網::其他||樂屋網::其他",loc:"",lx:"訊息"},{ta:"",proj:"AI識別：科技/健康運動",tags:"技術員::其他||White-collar worker::娛樂||工廠::商業||保單::金融||存款帳戶::金融||配電系統::其他||代工生產::其他||Public transport::交通||超市::美食||本日優惠::商業||政府員工::社會||Education::其他||行政服務 1204 +教育資源::普||Lifestyle content::商業||Parenting styles::教育||Professional development::商業||Retirement Insurance Benefits::其他||benefit::軍事||Home organization::家居||師範教育::商業||Educational resources::教育||旋轉式刮鬍刀::其他||Motorcycle accessories::交通||Public administration::社會||Lifestyle::旅遊生活||保護服務::其他",loc:"",lx:"訊息"},{ta:"",proj:"AI識別：居家/美食",tags:"學習::教育||Professional development::商業||書籍::娛樂||News media::娛樂||學校::教育||社區議題::法律與政府||Household::社會||LifeStyle Food::時尚美妝||Fitness::健康運動||Social media::網路媒體||政府機關概念和作法::社會||財政預算案::其他||快時尚::時尚美妝||Education::其他||社區和社會服務::其他",loc:"",lx:"訊息"},{ta:"",proj:"AI識別：科技/居家/育兒教育",tags:"戶外::旅遊生活||Artificial intelligence::科技||Interior design::商業||White-collar worker::娛樂||程式語言::科技||Information technology::科技||Art exhibitions::娛樂||Parenting::教育||網站開發::科技||Online shopping::商業||航空公司::其他||Investment::商業||軟體開發::科技||餐廳::美食||星巴克::美食||零售業::科技||電腦程式設計::科技||科技::科技||Travel::旅遊生活||Trivago::其他||Booking.com::旅遊生活",loc:"",lx:"名單"},{ta:"",proj:"AI識別：科技",tags:"Artificial intelligence::科技||Big data::科技||Software engineering::科技||軟體開發::科技||電腦程式設計::科技||Information technology::科技||電腦工程::科技||Machine learning::科技||任天堂::遊戲機和相關配件||Python::程式語言||PlayStation::遊戲機||UberEATS::其他||酒精飲品::美食||Food::美食||市場趨勢::金融||數位貨幣::金融",loc:"",lx:"名單"},{ta:"",proj:"AI識別：商業",tags:"Marketing::商業||Business::商業||Small and medium enterprises::商業||Business model::金融||戰略計劃::其他||Social media marketing::商業||購物中心::商業||Influencer marketing::商業||管理::商業||Business incubator::其他||Loyalty program::其他||折扣和購物回饋)::其他||商務旅遊::旅遊生活",loc:"",lx:"名單"},{ta:"",proj:"AI識別：商業",tags:"管理::商業||Business::商業||Small and medium enterprises::商業||戰略計劃::其他||Business model::金融||Social media marketing::商業||Marketing::商業||Influencer marketing::商業||購物中心::商業||Business development::商業||價格::其他||節慶::旅遊生活",loc:"",lx:"名單"},{ta:"",proj:"AI識別：科技/時尚美妝/金融",tags:"新興技術::科技||AI::其他||三星電子::其他||羅技::其他||NVIDIA GeForce::其他||Fashion::商業||證券::金融||Personal finance::金融||Business::金融||宜家家居::商業||Online shopping::科技||電子商務網站::科技||排屋::其他||Townhouse::房地產興趣||Taiwankou::其他||T'Ai-Wan::其他||591房屋交易網::其他||鮭魚::其他||智慧科技::科技||酒精飲品::美食||電子商務網站  1201 -燒牛肉::科技||LifeStyle Food::其他||旅行社和預訂::旅遊生活",loc:"",lx:"名單"},{ta:"",proj:"AI識別：商業/居家",tags:"管理::商業||Manufacturing::科技||Business::商業||傢俱::家居||Interior design::商業||Home improvement::家居||現代家具::家居||宜家家居::商業||政府::社會||Online shopping::商業||Fashion::時尚美妝||排屋::其他||Townhouse::房地產興趣||保單::金融||業務::商業||Commuting::其他||中型企業對企業企業員工::B2B",loc:"",lx:"名單"},{ta:"",proj:"AI識別：商業/美食/時尚美妝",tags:"Business networking::其他||蘇富比::其他||百達翡麗::時尚美妝||度假村::旅遊生活||Wine tasting::美食||路易威登::時尚美妝||Entrepreneurship::商業||Luxury lifestyle::科技||Philanthropy::社會||Country club::其他||High-net-worth individual::商業||Golf::健康運動||Hiking::爬山||BACKPACKING::健康運動||Trails::旅遊生活||Birdwatching::其他",loc:"",lx:"名單"},{ta:"",proj:"AI識別：金融",tags:"比爾·蓋茨::其他||Private banking::其他||古馳::時尚美妝||席夢思::其他||路易威登::時尚美妝||私人公司::其他||水療::時尚美妝||Tax law::其他||遊艇::交通||Entrepreneurship::商業||股份::金融||Wealth::金融||Real estate::科技||Investment::金融||Priority Pass::其他||Golf::健康運動||現代藝術::娛樂||手錶::時尚美妝||Collectibles::收藏品||度假::社會||Luxury vehicle::交通||古董::其他||Sports car::交通||拍賣::其他",loc:"",lx:"名單"},{ta:"",proj:"AI識別：居家/金融",tags:"高級訂製時裝::時尚美妝||排屋::其他||Townhouse::房地產興趣||別墅::旅遊生活||Private banking::其他||愛馬仕::時尚美妝||Luxury::商業||路易威登::時尚美妝||Cartier::珠寶商||凡賽斯::時尚美妝",loc:"",lx:"名單"},{ta:"",proj:"AI識別：科技/金融",tags:"軟體開發::科技||Big data::科技||Artificial intelligence::科技||新興技術::科技||智慧科技::科技||Stock market::金融||棒球::健康運動||NBA季後賽::其他||Mobile payment::金融||Google電子錢包::其他||Uber::商業||Information technology::科技||Trivago::其他||http://geek.com/::其他||Travel::科技||GitHub::其他||Fitness::健康運動||重量訓練::健康運動||智慧裝置::科技||雞肉::食品||羅技::其他||Razer::其他",loc:"",lx:"訊息"},{ta:"",proj:"AI識別：時尚美妝/美食",tags:"零售銀行業務::金融||Podcast::音樂和音訊串流||Online advertising::商業||Buy one get one free::商業||Lifestyle::旅遊生活||Lifestyle Travel::其他||LifeStyle Food::其他||Professional services::其他||Business networking::其他||休閒餐廳::美食||Women's clothing::時尚美妝||Cash on delivery::其他||Men's clothing::時尚美妝||行動應用程式::科技||Consumer electronics::其他||Loyalty program::其他||折扣和購物回饋)::其他||Movie lovers::娛樂||線上訂餐::美食||momo購物網::其他",loc:"",lx:"名單"},{ta:"",proj:"AI識別：金融",tags:"工廠::商業||保單::金融||傢俱::家居||Personal finance::金融||技術員::其他||食品::美食||家樂福::其他||家電::科技||Manufacturing::科技||生活用品::家居||機械工程::科技||製造生產服務和組織::商業",loc:"",lx:"訊息"},{ta:"",proj:"未命名",tags:"Accounting::其他||政府::社會||Current events::社會||News media::娛樂||傢俱::家居||韓國電視劇::娛樂||壽司::美食||燒牛肉::其他||鮭魚::其他||Interior design::商業||科技::科技||政府員工::社會||保護服務::其他||財務會計::商業||Cloud computing::科技||Private banking::其他||財政預算案::其他||快時尚::時尚美妝||簿記::其他",loc:"",lx:"名單"},{ta:"",proj:"AI識別：美食",tags:"住宿加早餐酒店::其他||http://booking.com/::旅遊生活||Food::美食||火鍋::其他||日本料理::美食||牛肉::美食||服裝::時尚美妝||襯衫::時尚美妝||Fashion::時尚美妝||Electric vehicle::交通||BMW::交通||特斯拉汽車::交通||購物中心::商業||配送::商務||UberEATS::其他",loc:"",lx:"名單"},{ta:"",proj:"AI識別：美食",tags:"簡餐館::美食||甜點::美食||在地美食::美食||烘培坊::美食||火鍋::其他||燒烤::美食||韓式料理::美食||Gourmet::美食||壽司::美食||鮭魚::其他||Netflix::娛樂||Spotify::娛樂||Apple Music::其他||YouTube::娛樂||UberEATS::其他||Mobile payment::金融",loc:"",lx:"名單"},{ta:"",proj:"AI識別：時尚美妝/金融",tags:"服裝::時尚美妝||購物中心::商業||Beauty::社會||Fashion::時尚美妝||Cosmetics::時尚美妝||Personal finance::金融||熱門話題::其他||Online banking::金融||Online shopping::商業||淘寶網::其他||Mobile payment::金融||LINE::其他||行動應用程式::科技||韓國電視劇::娛樂||速食休閒餐廳::美食||流行音樂::娛樂||綜藝節目::娛樂||Real estate listing websites::科技||假期::旅遊生活||快時尚::時尚美妝",loc:"",lx:"名單"},{ta:"",proj:"AI識別：商業",tags:"管理::商業||Brand management::其他||Entrepreneurship::商業||廣告行銷活動::商業||Business management::商業||Human resource management::商業||徵才::商業||徵才網站::商業||Marketing::商業||培訓和開發::商業||資金::其他||Investment::金融||股市指數::金融||Real estate investing::金融",loc:"",lx:"訊息"},{ta:"",proj:"AI識別：金融",tags:"程式語言::科技||滑雪勝地::登山和滑雪勝地||亞瑟士::其他||Badminton::球拍類運動||智慧科技::科技||Lexus 汽車::交通||優乃克::其他||Stock market::金融||滑雪::健康運動||電腦記憶體::科技||Credit card::金融||網球::健康運動||美津濃::其他||滑雪板::健康運動||Electrical engineering::其他||電腦程式設計::科技||科技::科技||PlayStation 4::其他",loc:"",lx:"名單"},{ta:"",proj:"未命名",tags:"跟團旅行::旅遊生活||糕點::美食||文化遺產::藝術和文化||民俗學::其他||古蹟::其他||超市::美食||Asian American culture::社會||肥皂劇::娛樂||綜藝節目::娛樂||證券交易所::金融||Real estate::科技||婚禮::社會||公園與遊憩::其他||YouTube::娛樂",loc:"",lx:"名單"},{ta:"",proj:"AI識別：科技/時尚美妝/金融/居家",tags:"業務::商業||Apple Watch::科技||Fashion::時尚美妝||Banking::金融||Real estate::科技||Social media marketing::商業||Social media::網路媒體||Insurance::商業||大眾媒體::娛樂||News media::娛樂||個人發展::個人身分||Affiliate marketing::商業||休閒餐廳::美食||星巴克::美食||早午餐::美食||Socializing::其他||Lifestyle brand::其他||Gourmet::美食||Specialty coffee::美食||Business development::商業",loc:"",lx:"名單"},{ta:"",proj:"未命名",tags:"工廠::商業||Manufacturing::科技||配電系統::其他||代工生產::其他||能源效率::科技||Semiconductor::其他||NVIDIA GeForce::其他||綜合企業::其他||羅技::其他||Razer::其他||行動應用程式::科技||Semi-truck::交通||材料科學::其他||Tech news::娛樂||儲蓄帳戶::金融||Current events::社會||Technology brands::科技||Internet of things::其他||Gadget & Gear::其他||Professional development::商業||職涯發展::商業||智慧科技::科技||機械工程::科技||Compensation and benefits::其他||輪胎品牌和商店::商業||Craft brewing::美食||充電器::其他||電池::其他||製冷::其他||Automation::其他||駕駛::交通||二手商品::購物和銷售",loc:"",lx:"訊息"},{ta:"",proj:"AI識別：娛樂/美食/旅遊",tags:"網路名人::其他||Music::旅遊生活||Coffee::美食||甜點::美食||Travel::科技||住宿加早餐酒店::其他||免稅商店::其他||蛋糕::美食||韓國流行音樂::娛樂||航空公司::其他||華語流行音樂::其他||Instagram::科技||星巴克::美食||http://booking.com/::旅遊生活||Places::旅遊生活||旅行社和預訂::旅遊生活||休閒餐廳::美食||數位相機::相機和相機設備||肖像攝影::娛樂||購物中心::商業||Instant camera::其他",loc:"",lx:"名單"},{ta:"",proj:"AI識別：科技/金融/育兒教育/居家",tags:"KitchenAid::家居||Personal finance::金融||幼兒照護::教育||Parenting styles::教育||Home improvement::家居||Home and garden::家居||居家和園藝媒體::家居||Family travel::娛樂||Entrepreneurship::金融||電子商務::商業||Startups::商業||顧客關係管理::公關||銷售時點情報系統::其他||Small business::其他",loc:"",lx:"名單"},{ta:"",proj:"AI識別：美食",tags:"簡餐館::美食||甜點::美食||在地美食::美食||烘培坊::美食||火鍋::其他||燒烤::美食||韓式料理::美食||Gourmet::美食||壽司::美食||鮭魚::其他||Netflix::娛樂||Spotify::娛樂||Apple Music::其他||YouTube::娛樂||UberEATS::其他||Mobile payment::金融||LifeStyle Food::其他||Food::食品零售商||LifeStyle Home::旅遊生活",loc:"",lx:"訊息"},{ta:"",proj:"AI識別：科技/娛樂",tags:"Online entertainment::娛樂和媒體||Video on demand::影片串流服務||socializing::其他||Live events::旅遊生活||Entertainment News::其他||Streaming::娛樂||Happy hour::美食||Digital media::科技||Viral video::網路影片||派對::旅遊生活||Lifestyle::旅遊生活||Mobile payment::金融||Credit card::金融||Christmas Holiday::其他",loc:"",lx:"訊息"},{ta:"",proj:"AI識別：育兒教育/旅遊",tags:"牙科學院::教育||Nursing education::醫學教育||免稅商店::其他||Independent travel::旅遊||一般保險::金融||Higher education::教育||衛生學::其他||生物學::科技||Beauty::社會||清潔::時尚美妝||CeraVe Skincare::其他||Cetaphil::其他||科學::期刊||Uber::商業",loc:"",lx:"訊息"},{ta:"",proj:"AI識別：科技/育兒教育/健康運動/居家",tags:"Taiwankou::其他||T'Ai-Wan::其他||White-collar worker::娛樂||Educational resources::教育||Parenting styles::教育||Health::時尚美妝||Extracurricular activities::其他||Home organization::家居||速食::美食||Outdoor Living::其他||Camping::旅遊生活||Cycling::健康運動||News media::娛樂||Business::商業||服裝::時尚美妝||Current events::社會||Commuting::其他||戶外休閒活動::旅遊生活||Gardening::旅遊生活",loc:"",lx:"訊息"},{ta:"",proj:"AI識別：科技",tags:"Internet of things::其他||共同基金::金融||GitHub::其他||Big data::科技||智慧科技::科技||Semiconductor::其他||航空公司::其他||能量飲料::美食||製造生產服務和組織::商業||Compensation and benefits::其他||Gadget & Gear::其他||LifeStyle Home::其他||Professional development::商業||Stock broker::金融||Video on demand::影片串流服務||婚禮網站和部落格::科技||婚紗攝影::娛樂||婚戒::旅遊生活",loc:"",lx:"訊息"},{ta:"",proj:"AI識別：科技/旅遊/居家",tags:"免稅商店::其他||航空公司::其他||商務艙::旅遊生活||機場::其他||Priority Pass::其他||Travel the World::其他||Visa Cash::其他||Real estate::科技",loc:"",lx:"名單"},{ta:"",proj:"AI識別：商業/美食",tags:"快時尚::時尚美妝||Influencer marketing::商業||火鍋::其他||在地美食::美食||燒烤::美食||Gourmet::美食||酒精飲品::美食||可樂::其他||簡餐館::美食||乳製品::美食||Badminton::球拍類運動||保齡球::其他||卡拉OK::其他||韓國電視劇::娛樂||刺青::時尚美妝||PlayStation::遊戲機||淘寶網::其他||美妝店::商業",loc:"",lx:"名單"},{ta:"",proj:"AI識別：金融/居家",tags:"金融服務::商業||Insurance::商業||Real estate::科技",loc:"",lx:"名單"},{ta:"",proj:"AI識別：金融",tags:"Personal finance::金融||儲蓄::金融||存款帳戶::金融||Financial planning::金融||財務會計::商業||MBA::金融||Accounting::其他||金融服務::商業||Hiking::爬山||Cycling::健康運動||戶外休閒活動::旅遊生活||Camping::旅遊生活||釣魚::旅遊生活||Independent travel::旅遊||漁具::其他||迪卡儂::其他",loc:"",lx:"名單"},{ta:"",proj:"AI識別：科技/金融",tags:"T'Ai-Wan::其他||Financial market::金融||金錢::金融||金融經濟學::其他||財經::商業||金融服務::商業||金融分析::其他||Passive income::商業||Investment::金融||Stock market::金融||Real estate::房地產興趣||收入::商業||Return on investment::金融",loc:"",lx:"名單"},{ta:"",proj:"AI識別：育兒教育",tags:"天然食品::美食||Rural::農業自然||Educational resources::教育||純素營養::美食||健康的習慣::旅遊生活||Birdwatching::其他||旅行社和預訂::旅遊生活||魚油::其他||全價值營養::其他||膽固醇::科技||中式料理::美食||簡餐館::美食||休閒活動::旅遊生活",loc:"",lx:"訊息"},{ta:"",proj:"AI識別：科技/育兒教育",tags:"電腦科學::科技||科學::期刊||實驗室::其他||Software engineering::科技||Python::程式語言||GitHub::其他||Tech news::娛樂||Higher education::教育||生物化學::其他||發電::其他||婚宴::旅遊生活||喜帖::旅遊生活||Social media::網路媒體||Influencer marketing::商業||中型企業對企業企業員工::B2B||政府員工::社會||Information technology::其他||軟體開發::科技||電腦工程::科技||數位貨幣::金融||納斯達克100指數::其他||Passive income::商業",loc:"",lx:"名單"},{ta:"",proj:"AI識別：居家/科技",tags:"Real estate::科技||Real estate listing websites::科技||First-time home buyer::房地產興趣",loc:"",lx:"名單"},{ta:"",proj:"AI識別：旅遊/居家",tags:"外語::其他||航空公司::其他||工程和理工學院::教育||Travel::旅遊生活||慢跑::跑步||Gardening::家居||超市::美食||生活用品::家居||韓國電視劇::娛樂||Beauty::社會||美學::社會||Business model::金融||護膚保養::時尚美妝||Coffee::美食",loc:"",lx:"名單"},{ta:"",proj:"AI識別：時尚美妝/美食/商業/科技",tags:"Men's clothing::時尚美妝||Women's clothing::時尚美妝||Podcast::音樂和音訊串流||LifeStyle Food::其他||Professional services::其他||Business development::商業||Apple Music::其他||Full English breakfast::其他||行動應用程式::科技||Fitness::健康運動||Tech news::娛樂||Consumer electronics::科技||生產率::其他||Digital media::科技",loc:"",lx:"名單"},{ta:"",proj:"AI識別：居家",tags:"Home organization::家居||Household::商業||Home and garden::家居||百葉簾::其他||整建::房地產興趣||Home renovation::家居||Spring cleaning::家居||節慶::旅遊生活||傢俱::家居||居家飾品::家居",loc:"",lx:"訊息"},{ta:"",proj:"AI識別：育兒教育/居家",tags:"Parenting::教育||廚房::家居||Interior design::商業||現代家具::家居||Consumer electronics::科技||Early childhood education::教育||生活用品::家居||運動::健康運動||暑假::教育||草地::家居||任天堂::遊戲機和相關配件||Pet::農業自然||貓糧::農業自然",loc:"",lx:"名單"},{ta:"",proj:"未命名",tags:"Rural::科技||肥料::農業自然||Agriculture::農業自然||有機農業::農業自然||Farmers market::美食||出口貿易::其他||批發::商業||物流::商業||Gardening::農業自然||天氣預報::其他||政府機關概念和作法::社會||溫室::其他||食品加工::其他||中式料理::美食||食品保存::其他||生物技術::其他||農企業::農業自然",loc:"",lx:"訊息"},{ta:"",proj:"AI識別：科技",tags:"程式語言::科技||Open source software::其他||PHP::其他||Tech news::娛樂||Java::其他||有氧運動::健康運動||Fitness::健康運動||Badminton::球拍類運動||電玩遊戲::娛樂||PlayStation::遊戲機||超級馬利奧系列::其他||薩爾達傳說::其他||電玩遊戲網路媒體::娛樂||Collectibles::教育||馬拉松::跑步||玩命關頭::其他||手機遊戲::娛樂",loc:"",lx:"訊息"},{ta:"",proj:"AI識別：居家/科技",tags:"Prefabricated home::其他||居家風格和類型::房地產興趣||度假屋::旅遊生活||Garden furniture::家居||Rural::其他||日式旅館::其他||度假屋出租::旅遊生活||Retirement planning::金融||Birdwatching::其他||Trails::旅遊生活||水族飼養::其他",loc:"",lx:"名單"},{ta:"",proj:"AI識別：科技",tags:"Software engineering::科技||程式語言::科技||C語言::其他||軟體開發::科技||行動應用程式::科技||Open source software::其他||Electric vehicle::交通||特斯拉汽車::交通||油電混合車::交通||洗車::交通||Automobile::交通||鍍膜::其他||油電混合動力車::交通||改裝車::交通||Camping::旅遊生活||自訂車款::交通",loc:"",lx:"名單"},{ta:"",proj:"AI識別：商業",tags:"Business development::商業||國際貿易::其他||進口::商業||出口貿易::其他||B2B::商業||Sales management::商業||Procurement::其他||Business::商業||物流::商業||供應鏈::其他||經銷::商業||倉儲業::科技||價格::其他||Logistics::金融||Lead generation::商業||Business opportunities::金融",loc:"",lx:"名單"},{ta:"",proj:"AI識別：娛樂/科技",tags:"Contemporary art::娛樂||Art exhibitions::娛樂||Art::娛樂||Handicraft::工藝品||雕刻::娛樂||寶石::科技||裝飾風藝術::其他||花卉::農業自然||Investment::商業||美國運通::其他||納斯達克100指數::其他||插花::其他||Asset management::金融||Passive income::商業||Collectibles::興趣",loc:"",lx:"訊息"},{ta:"",proj:"AI識別：金融/商業",tags:"Financial planning::金融||Stock market::金融||Passive income::商業||股份::金融||Investment::金融||Stock broker::金融||Asset management::金融||私募基金::其他||Private equity::金融||Tax preparation::其他||Private banking::其他||納斯達克100指數::其他||道瓊斯工業平均指數::其他||標準普爾500指數::其他",loc:"",lx:"名單"},{ta:"",proj:"AI識別：商業/居家",tags:"Business networking::其他||領英::其他||領導::社會||Professional development::商業||職涯::商業||Business leaders::金融||新家::其他||House::房地產興趣||起步房::房地產興趣||White-collar worker::娛樂||Commuting::其他||遠離家鄉 0130 +個人發展::加了之後很穩定||Adult education::商業||在地美食::美食||生產率::其他||不與家人同住::其他",loc:"",lx:"名單"},{ta:"",proj:"AI識別：美食/時尚美妝/旅遊",tags:"Wine tasting::美食||酒莊::美食||Lifestyle Travel::其他||Cultural travel::其他||葡萄園::其他||度假村::旅遊生活||跨界休旅車::其他||住宿加早餐酒店::其他||遊輪::旅遊生活||都會車::交通||別墅::旅遊生活||美國運通::其他||Specialty coffee::美食||前菜::其他||Foreign exchange market::金融",loc:"",lx:"名單"},{ta:"",proj:"AI識別：科技/美食",tags:"Rural::其他||度假屋::旅遊生活||水族飼養::其他||Birdwatching::其他||釣魚::旅遊生活||Trails::健行||Woodworking::娛樂||tea leaf::美食||RV Travel::其他||休旅車營地::旅遊生活||National parks::旅遊目的地||雕刻::娛樂||Gardening::旅遊生活||水療::時尚美妝||麻將::其他||Chinese Culture::其他||歷史::歷史",loc:"",lx:"名單"},{ta:"",proj:"AI識別：商業/金融/科技",tags:"Business development::商業||Life insurance::金融||保單::金融||證券::金融||Credit card::金融||Automobile::科技||Business networking::其他||Marketing::商業||直效營銷::其他||財務顧問::金融||B2B::商業||Lead generation::商業||Trade shows::貿易展",loc:"",lx:"名單"},{ta:"",proj:"AI識別：科技",tags:"AI::其他||Science communication::其他||Tech news::娛樂||http://geek.com/::其他||Software development::其他||Machine learning::科技||英語::語言||Multinational corporation::其他||IT諮詢::其他||International business::其他||Semiconductor::其他||Internet of things::其他||電光源::其他||Software engineering::科技||物理學::物理學||不與家人同住 0202 +國際新聞::娛樂||Consumer electronics::其他||Scientific::科技||Google開發人員::其他||經常旅行的用戶::其他",loc:"",lx:"名單"},{ta:"",proj:"AI識別：商業",tags:"零售業::科技||批發::商業||供應鏈::其他||獨資企業::商業||經銷::商業||居家事業::商業||Small business::商業||銀行帳戶::金融||Marketing::商業||貿易::金融||Social media marketing::商業||Influencer marketing::商業||Online shopping::商業||電子商務 0211 +價格::商業||配送::商務||節慶::旅遊生活||淘寶網::其他",loc:"",lx:"名單"},{ta:"",proj:"AI識別：科技/居家",tags:"建材::科技||結構工程::其他||Sustainable architecture::其他||營建管理::其他||砌體結構::其他||整建::房地產興趣||News media::娛樂||Open house::商業||Household::商業||Kitchen appliances::商業||Quality of life::健康運動||Lifestyle::旅遊生活||自我照護::健康運動||Mental health::健康運動",loc:"",lx:"名單"},{ta:"",proj:"AI識別：科技",tags:"批發::商業||Electric vehicle::交通||經銷::商業||出口貿易::其他||二手車::交通||Lexus 汽車::交通||賓士::交通||Automobile::科技||國際貿易::其他||運輸::交通||別墅::旅遊生活||貿易::金融||物流::商業||Nissan 汽車::交通||News media::娛樂||進口::商業",loc:"",lx:"訊息"},{ta:"",proj:"未命名",tags:"綜藝電視節目::娛樂||表演藝術::娛樂||演唱會::音樂活動||Live events::旅遊生活||節慶::旅遊生活||派對::旅遊生活||Influencers::時尚美妝||Passive income::商業||低成本航空公司::其他||Stock market::金融||Current events::社會||Real estate::科技||House::房地產興趣||網紅創作者::其他||餐飲創作者::其他",loc:"",lx:"名單"},{ta:"",proj:"AI識別：金融/商業",tags:"證券::金融||財務會計::商業||Financial planning::金融||金融服務::商業||Foreign exchange market::金融||儲蓄::金融||Business development::商業||Professional services::其他||Personal finance::金融||Life insurance::金融||一般保險::金融||Lead generation::商業||行政服務 0312 +零售銀行業務::金融||Business networking::其他||Investment::金融||Travel::其他",loc:"",lx:"訊息"},{ta:"",proj:"AI識別：商業",tags:"中彰大橋::其他||批發::商業||Small business::商業||居家事業::商業||經銷::商業||供應鏈::其他||銀行帳戶::金融||貿易::金融||電子商務::商業||Marketing::商業||Social media marketing::商業||Influencer marketing::商業||Online shopping::商業||價格::其他||Business model::金融||Lead generation::商業||Food service::美食||Commuting::其他",loc:"",lx:"1510"},{ta:"",proj:"AI識別：居家",tags:"智慧科技::科技||iPhone::科技||House::金融||Interior design::商業||591房屋交易網::其他||排屋::其他||Townhouse::房地產興趣||家電::科技||傢俱::家居||一般保險::金融||家務::家居||生活用品::家居||Health::時尚美妝||Gourmet::美食||Business::金融||酒精飲品::美食||Consumer electronics::其他",loc:"",lx:"訊息"},{ta:"",proj:"AI識別：育兒教育",tags:"量販店::美食||Parenting::教育||家樂福::其他||Early childhood education::教育||Education::社會||幼兒照護::教育||Manufacturing::科技||婚姻::旅遊生活||代工生產::其他||親子天下::其他||製造生產服務和組織::商業",loc:"",lx:"訊息"},{ta:"",proj:"AI識別：商業/金融/科技",tags:"Business development::商業||Life insurance::金融||保單::金融||證券::金融||Credit card::金融||Automobile::科技||Business networking::其他||Marketing::商業||直效營銷::其他||財務顧問::金融||B2B::商業||Lead generation::商業||Trade shows::貿易展",loc:"",lx:"名單"},{ta:"",proj:"AI識別：育兒教育",tags:"Parenting styles::教育||Motherhood::娛樂||媽媽寶寶-懷孕::其他||生產::其他||Parenting::其他||新生兒派對::教育||Design studios::商業||在家教育::教育||LifeStyle Home::其他||繪畫::娛樂||Household::社會||運動類遊戲::娛樂||Family travel::娛樂||Language education::其他||家長：嬰幼兒家長::其他||學齡前兒童的家長::其他||低年級學童的家長 0310 +蒙台梭利教育法::其他||兒童發展::教育||樂器::樂器||親子::娛樂",loc:"",lx:"訊息"},{ta:"",proj:"AI識別：育兒教育/科技/商業/居家",tags:"Educational resources::教育||Extracurricular activities::其他||News media::娛樂||製造生產服務和組織::商業||Business::商業||Human resource management::商業||Current events::社會||Home organization::家居||Health::時尚美妝||本田汽車::交通||豐田汽車::交通||Commuting::其他",loc:"",lx:"訊息"},{ta:"",proj:"AI識別：科技/居家",tags:"建材::科技||結構工程::其他||Sustainable architecture::其他||營建管理::其他||砌體結構::其他||整建::房地產興趣||News media::娛樂||Open house::商業||Household::商業||Kitchen appliances::商業||Quality of life::健康運動||Lifestyle::旅遊生活||自我照護::健康運動||Mental health::健康運動||土木工程::科技||Risk management::其他||Woodworking::家居",loc:"",lx:"名單"},{ta:"",proj:"AI識別：科技/健康運動",tags:"White-collar worker::娛樂||技術員::其他||工廠::商業||保單::金融||存款帳戶::金融||配電系統::其他||代工生產::其他||Public transport::交通||超市::美食||本日優惠::商業||Educational resources::教育||Parenting styles::教育||Lifestyle content::商業||Retirement Insurance Benefits::其他||Professional development::商業||benefit::軍事||Home organization::家居",loc:"",lx:"訊息"},{ta:"",proj:"AI識別：居家/科技/美食",tags:"House::房地產興趣||Automobile::交通||Food trucks::其他||591房屋交易網::其他||工程::科技||倉儲業::科技||食品加工::其他||Manufacturing::科技||運輸::交通||零部件市場::其他||物流::商業||Real estate::科技||科技::科技||使用 Facebook 的管道：所有行動裝置::科技||餐飲創作者::其他",loc:"",lx:"名單"},{ta:"",proj:"AI識別：商業/居家/旅遊",tags:"Business::商業||市場趨勢::金融||Prefabricated home::其他||Open house::商業||居家風格和類型::房地產興趣||RV Travel::其他||Camping::旅遊生活||休旅車營地::旅遊生活||Ecotourism::旅遊生活||Outdoor Living::其他",loc:"",lx:"訊息"},{ta:"",proj:"AI識別：旅遊/居家",tags:"居家風格和類型::房地產興趣||Ecotourism::旅遊生活||Rural::其他||拖掛式房車::其他||農村::其他||Tourist attractions::旅遊生活||休閒活動::旅遊生活||Household::社會||公園與遊憩::其他||Farm-to-table::其他||Gardening::旅遊生活",loc:"",lx:"訊息"},{ta:"",proj:"AI識別：商業",tags:"零售業::科技||批發::商業||經銷::商業||供應鏈::其他||居家事業::商業||Small business::商業||銀行帳戶::金融||貿易::金融||電子商務::商業||Marketing::商業||Social media marketing::商業||Influencer marketing::商業||Online shopping::商業",loc:"",lx:"訊息"},{ta:"",proj:"AI識別：居家/科技",tags:"遊程承攬業::其他||跟團旅行::旅遊生活||Gardening::花園和園藝造景||Camping::旅遊生活||休旅車營地::旅遊生活||National parks::旅遊目的地||Chinese Culture::其他||Trails::健行||Lifestyle content::商業||Coffee::美食||LifeStyle Food::時尚美妝||Local events::美食||感情狀況：已婚::其他",loc:"",lx:"訊息"},{ta:"",proj:"AI識別：居家/時尚美妝",tags:"Home decor::家居||居家裝潢構想::家居||室內裝潢品牌和零售商::商業||百葉簾::其他||現代家具::家居||Lifestyle::旅遊生活||Scandinavian design::房地產興趣||Open house::商業||Interior design::商業||窗戶::房地產興趣||Real estate::科技",loc:"",lx:"訊息"},{ta:"",proj:"AI識別：商業/科技",tags:"Marketing::商業||Business opportunities::金融||Social media marketing::商業||購物中心::商業||Sales management::商業||Lead generation::商業||零售業::科技||服裝::時尚美妝||Co-working::其他||Business leaders::金融||Small business::商業||Fashion::娛樂||Human resource management::商業",loc:"",lx:"名單"},{ta:"",proj:"AI識別：金融",tags:"Trading strategy::金融||金錢::金融||金融經濟學::其他||財經::商業||金融服務::商業||金融分析::其他||Passive income::商業||Investment::金融||Stock market::金融||Real estate::房地產興趣||收入::商業||Return on investment::金融",loc:"",lx:"名單"},{ta:"",proj:"AI識別：科技/居家",tags:"二手車::交通||Automobile::商業||卡車::交通||批發::商業||製造生產服務和組織::商業||建築工程::其他||土木工程::科技||Home improvement::家居||金屬::其他||一般保險::金融||儲蓄::金融||酒精飲品::美食",loc:"",lx:"訊息"},{ta:"",proj:"AI識別：商業/居家",tags:"Business development::商業||Business networking::其他||Entrepreneurship::金融||Lead generation::商業||個人發展::個人身分||Photography::娛樂||Design::商業||Home office::家居||Project management software::其他||影音俱樂部::其他||MacBook::其他||Canva::其他||生產率::其他||Online banking::金融",loc:"",lx:"名單"},{ta:"",proj:"AI識別：金融/居家/育兒教育/美食",tags:"Life insurance::金融||Household::社會||Parenting styles::教育||Online learning::教育||政府機關概念和作法::社會||Banking::金融||LifeStyle Food::時尚美妝||社區議題::法律與政府||Fitness::健康運動||News media::娛樂",loc:"",lx:"訊息"},{ta:"",proj:"AI識別：居家",tags:"百葉簾::其他||居家裝潢構想::家居||室內裝潢品牌和零售商::商業||宜家家居::商業||Workinghouse 生活工場::其他||大創百貨::其他||家樂福::其他||Online shopping::科技||momo購物網::其他||Home improvement::家居||Home renovation::家居||整建::房地產興趣",loc:"",lx:"訊息"},{ta:"",proj:"AI識別：科技",tags:"Shenkang::其他||T'Ai-Wan::其他||批發::商業||出口貿易::其他||排屋::其他||進口::商業||紡織品::其他||Chemical industry::其他||玻璃::其他||生物可分解塑膠::其他||Automobile::科技||居家事業::商業||B2B::商業||Procurement::其他||代工生產::其他||Accounting::商業",loc:"",lx:"訊息"},{ta:"",proj:"AI識別：科技",tags:"Shenkang::其他||T'Ai-Wan::其他||批發::商業||排屋::其他||代工生產::其他||B2B::商業||五金行::商業||零部件市場::其他||Manufacturing::科技||不鏽鋼::其他||水管修繕::房地產興趣||金屬加工::房地產興趣||建材::科技||Home improvement::家居||Home renovation::家居||傢俱::家居||Small business::其他||改裝車::交通||配電系統::其他||Commuting::其他",loc:"",lx:"訊息"},{ta:"",proj:"AI識別：娛樂/科技/商業",tags:"佳士得::其他||Art auction::其他||Luxury::旅遊生活||路易威登::時尚美妝||愛馬仕::時尚美妝||Art exhibitions::娛樂||勞力士::時尚美妝||Business leaders::金融||Senior management::其他||保時捷::其他||賓士::交通||管理::商業||Investment::金融||Private banking::其他||Entrepreneurship::商業",loc:"",lx:"訊息"},{ta:"",proj:"AI識別：美食",tags:"管理::商業||食品和飲品::美食||Coffee::美食||Cooking::美食||中式料理::美食||韓式料理::美食||日本料理::美食||零售業::科技||Business development::商業||Social media marketing::商業||廚具::家居||節慶::旅遊生活||Instagram 商業檔案管理員::其他||LifeStyle Food::其他||Food::其他",loc:"",lx:"名單"},{ta:"",proj:"AI識別：金融/商業",tags:"金融經濟學::其他||Trading strategy::金融||Passive income::商業||Investment::金融||Asset management::金融||納斯達克100指數::其他||倫敦證券交易所::金融||美國運通::其他||現金::其他||特斯拉汽車::交通||NVIDIA GeForce::其他||Real estate::房地產興趣||黃金::科技",loc:"",lx:"訊息"},{ta:"",proj:"AI識別：育兒教育/娛樂/居家",tags:"私立學校::教育||國際學校::教育||Bilingual education::其他||樂器::樂器||Art::娛樂||兒童發展::教育||Luxury::商業||Gardening::家居||Luxury vehicle::交通||Terrace::家居||Stock market::金融||High-net-worth individual::商業",loc:"",lx:"名單"},{ta:"",proj:"AI識別：金融",tags:"Investment::金融||Trading strategy::金融||Passive income::商業||Foreign exchange market::金融||黃金::科技||石油::其他||Stock market::金融||News media::娛樂||Semiconductor::其他||Luxury::商業||航空公司::其他||Smart home automation::科技||一般保險::金融",loc:"",lx:"名單"},{ta:"",proj:"AI識別：商業",tags:"Business model::金融||零售業::科技||批發::商業||產品::商業||經銷::商業||供應鏈::其他||居家事業::商業||電子商務::商業||自僱::商業||貿易::金融||Marketing::商業||Online advertising::商業||價格::其他||Accounting::商業||商家的粉絲專頁管理員::其他",loc:"",lx:"名單"},{ta:"",proj:"AI識別：居家/旅遊/科技",tags:"House::房地產興趣||Travel::科技||Big data::科技||免稅商店::其他||智慧科技::科技||高科技::科技||新興技術::科技||飯店::旅遊生活||Real estate::科技||Hotels.com::旅遊生活||Trivago::其他||Booking.com::旅遊生活",loc:"",lx:"名單"},{ta:"",proj:"AI識別：居家/美食",tags:"Townhouse::房地產興趣||自僱::商業||代工生產::其他||製造生產服務和組織::商業||Food industry::其他||食品加工::其他||化學::其他||環境科學::科技||包裝和標籤::商業||急凍食品::其他||飲料::美食||批發::商業||物流::商業||一般保險::金融",loc:"",lx:"訊息"},{ta:"",proj:"AI識別：育兒教育/居家/金融",tags:"Education::社會||學習::教育||課程::教育||學校::教育||文學::娛樂||Interior design::商業||電子書::娛樂||Personal finance::金融||Financial planning::金融||Stock market::金融||書籍::娛樂||Real estate investing::金融",loc:"",lx:"名單"},{ta:"",proj:"AI識別：育兒教育",tags:"科學::期刊||Higher education::教育||Education::教育||自然科學::其他||哲學::其他||研究所教育::教育||財經::商業||文學::娛樂||實驗室::其他||新興技術::科技||大眾媒體::娛樂||工程和理工學院::教育||數學::其他||植物園::其他||森林生態學::其他||觀賞植物::農業自然",loc:"",lx:"名單"},{ta:"",proj:"AI識別：科技/居家",tags:"Shenkang::其他||T'Ai-Wan::其他||生活用品::家居||家務::家居||家電::科技||傢俱::家居||一般保險::金融||House::房地產興趣||591房屋交易網::其他||Interior design::商業||排屋::其他||Townhouse::房地產興趣||iPhone::科技||Internet of things::其他||智慧科技::科技",loc:"",lx:"訊息"},{ta:"",proj:"AI識別：居家/金融",tags:"Real estate::房地產興趣||591房屋交易網::其他||股市指數期貨::金融||Stock market::金融||Financial planning::金融||證券::金融||Stock broker::金融||Trading strategy::金融",loc:"",lx:"1510"},{ta:"",proj:"AI識別：美食/商業",tags:"Food service::美食||Restaurant management::其他||Business model::金融||食品保存::其他||飲料::美食||中式料理::美食||Coffee::美食||在地美食::美食||早午餐::美食||輪班工作制::商業",loc:"",lx:"1510"},{ta:"",proj:"AI識別：科技/金融",tags:"資料管理::科技||資料分析::金融||資料視覺化::科技||Machine learning::科技||防毒軟體::其他||金融經濟學::其他||Investment::金融||Stock market::金融||Passive income::商業||黃金::科技||石油::其他||Semiconductor::其他||Luxury::商業||航空公司::其他||Smart home automation::科技||Trading strategy::金融",loc:"",lx:"名單"},{ta:"",proj:"AI識別：娛樂/科技",tags:"Contemporary art::娛樂||Art exhibitions::娛樂||Art::娛樂||雕刻::娛樂||寶石::科技||裝飾風藝術::其他||花卉::農業自然||美國運通::其他||納斯達克100指數::其他||Investment::金融||插花::其他||Passive income::商業||Collectibles::興趣||石英::其他||黃金::科技||Luxury::商業||Real estate::科技",loc:"",lx:"名單"},{ta:"",proj:"AI識別：金融",tags:"Investment::金融||Trading strategy::金融||Passive income::商業||Foreign exchange market::金融||黃金::科技||石油::其他||Stock market::金融||News media::娛樂||Semiconductor::其他||Luxury::商業||航空公司::其他||Smart home automation::科技||一般保險::金融",loc:"",lx:"名單"},{ta:"",proj:"AI識別：科技/育兒教育",tags:"歌唱::娛樂||benefit::軍事||表演藝術::娛樂||圖書館::其他||假期::旅遊生活||Online learning::教育||Current events::社會||英語::語言||婚禮::社會||師範教育::商業||政府::社會||YouTube::娛樂||休旅車::交通||掀背車::交通",loc:"",lx:"訊息"},{ta:"",proj:"AI識別：金融/居家/科技",tags:"Small and medium enterprises::商業||Personal finance::金融||金融服務::商業||生物技術::其他||特斯拉汽車::交通||Stock market::金融||Real estate development::房地產興趣||Fitness::健康運動||生物學::科技||書籍::娛樂||醫學院::教育||Real estate::科技||管理::商業",loc:"",lx:"名單"},{ta:"",proj:"AI識別：居家/金融/科技",tags:"House::房地產興趣||社會運動::社會||Financial market::金融||Personal finance::金融||Big data::科技||Machine learning::科技||iPad::其他||Passive income::商業||Current events::社會||Stock market::金融||MacBook Pro::其他||Real estate investing::金融||政府機關概念和作法::社會||金融經濟學::其他||政治和社會議題::社會||地緣政治學::其他",loc:"",lx:"名單"},{ta:"",proj:"AI識別：金融/商業",tags:"金融經濟學::其他||Trading strategy::金融||Investment::金融||Asset management::金融||納斯達克100指數::其他||倫敦證券交易所::金融||美國運通::其他||現金::其他||特斯拉汽車::交通||英偉達::其他||Real estate::房地產興趣||黃金::科技",loc:"",lx:"名單"},{ta:"",proj:"AI識別：居家/金融",tags:"Interior design::商業||律師事務所::法律和法律諮詢服務||批發::商業||供應鏈::其他||Personal finance::金融||經銷::商業||出口貿易::其他||電子商務::商業||Food industry::其他||生物學::科技||Investment::商業||醫學院::教育||Real estate::科技||居家事業::商業||財產保險::其他||零售業::科技||Small business::其他",loc:"",lx:"名單"},{ta:"",proj:"AI識別：科技",tags:"Automation::其他||Information technology::科技||591房屋交易網::其他||工程::科技||力學::其他||金屬::其他||Current events::社會||電機工程::科技||高科技::科技||機械工程::科技||Electrical engineering::其他||Consumer electronics::科技||科技::科技||資訊::其他||科技早期採用者::其他",loc:"",lx:"名單"}];function sw(n,el){
const AUD=YOU.map(function(y){return{ta:y.ta,project:y.proj,interest:y.tags.split('||').map(function(t){return t.split('::')[0];}).join('、'),type:y.lx};});
const TAGS={
  re:["Real Estate 591 (591房屋交易網)","Housing (房屋)","Real Estate Industry (房地產)","Residential Area (住宅區)","Property Portal (房屋廣告)","Property (不動產)","Apartment (公寓)","Apartment Complex (公寓大樓)","Real Estate Investment (房地產投資)","Leju Network (樂屋網)","Home Style (居家風格)","Home Construction (住宅興建)","Starter Home (起步房)","Rental Property (租賃)","Real Estate Development (房地產開發)","Real Estate Economics (房地產經濟學)","Property Valuation (房地產估價)","First-Time Buyer (首次購房者)","Home Buyer Subsidy (首次購屋補助)","Mortgage Loan (房屋抵押貸款)","New Home (新家)","Retirement Community (退休社區)","Prefab Home (組合屋)","Real Estate Investing (房地產投資相關)","Residential Real Estate (住宅房地產)","Real Estate Investment Club (房地產投資俱樂部)","Commercial Property (商用不動產)","Home Renovation (住家翻新)","Townhouse (連棟住宅)","First-time Home Buyer (首次購房者)","Rental Listings (待租房屋資訊)","Sustainable Architecture Design (永續建築設計)","For Sale By Owner (由擁有者出售)","Property Listing Sites (房屋廣告入口網站)","Creative Real Estate Investing (創意房地產投資)","Home Insurance (房屋保險)","Row House (排屋)"],
  invest:["Stocks (股票)","Financial Market (金融市場)","Foreign Exchange (外匯市場)","Cryptocurrency (數位貨幣)","Stock Index (股市指數)","Wealth (財富)","Money (金錢)","Income (收入)","Passive Income (被動收入)","Financial News (財經)","Investment (投資)","Financial Planning (財務規劃)","Personal Finance (個人理財)","Savings (儲蓄)","Stock Market (股票市場)","Trading Strategy (交易策略)","Day Trading (當沖交易)","Swing Trading (波段交易)","Forex Signals (外匯交易信號)","Investment Strategy (投資策略)","Financial Advisor (財務顧問)","Capital (資金)","Financial Services (金融服務)","Banking (銀行業)","Asset Management (資產管理)","Shares (股份)","ROI (投資報酬率)","Investor (投資者)","Securities (證券)","Mobile Payment (行動支付)","Savings Account (儲蓄帳戶)","Stock Broker (股票經紀人)","Algorithmic Trading (演算法自動交易)","Venture Capital (創投融資)","Angel Investing (天使投資)","Seed Accelerator (創業加速器)","ETF (指數型股票基金)","Mutual Fund (共同基金)","London Stock Exchange (倫敦證券交易所)","NASDAQ 100 (納斯達克100指數)","S&P 500 (標準普爾500指數)","Dow Jones (道瓊斯工業平均指數)","Stock Index Futures (股市指數期貨)","Private Equity (私募股權投資)","Private Fund (私募基金)","Investment Banking (投資銀行業)","Investment Management (投資管理)"],
  rich:["Luxury Car (豪華轎車)","Duty-Free Shop (免稅商店)","Luxury Goods (精品)","Private Banking (私人銀行)","Hermes (愛馬仕)","Chanel (香奈兒)","Golf (高爾夫球)","Senior Executive (高階管理人員)","Haute Couture (高級訂製)","High Net Worth (高淨值人士)","Luxury Lifestyle (豪奢生活方式)","Country Club (高級俱樂部)","Fine Dining (高級餐飲愛好者)","Art Auction (藝術拍賣)","Priority Pass (機場貴賓室)","Frequent Flyer Program (飛行常客獎勵)","Philanthropy (慈善家)","Boutique Fashion (女性精品服飾)","Boutique Hotel (精品酒店)","Luxury Travel (豪華旅遊)","Luxury Resort (奢華渡假村)","Collectibles (收藏品)","High-end Audio (高端音響)","Gucci (古馳時尚品牌)","Versace (凡賽斯時尚品牌)","Louis Vuitton (路易威登時尚品牌)","Porsche (保時捷)","Patek Philippe (百達翡麗名錶)","Rolex (勞力士名錶)","Haute Couture Fashion (高級訂製時裝)","Antiques (古董)","Yacht (遊艇)","Gold (黃金)","Gemstones (寶石)","Auction (拍賣)","Christie's Auction (佳士得藝術拍賣)","Sotheby's Auction (蘇富比藝術拍賣)","Christie's (佳士得藝術拍賣)","Sotheby's (蘇富比藝術拍賣)"],
  home:["Home Renovation (居家裝修)","IKEA (宜家家居)","Furniture (傢俱)","Interior Design (室內設計)","Modern Furniture (現代家具)","Home Improvement (住家修繕)","Quality Design (質感設計)","Fashion Design (時尚設計)","Kitchen (廚房)","Home Living (住家)","Home Appliances (家電)","Home Decor Store (居家裝潢)","Hardware Store (五金行)","Household Goods (生活用品)","Bedroom Furniture (臥室家具)","Tables & Desks (桌子)","Dehumidifier (除濕機)","Air Purifier (空氣凈化器)","Dyson (戴森)","KitchenAid (廚房家電)","Searchome Design (設計家)","Home & Living Mag (漂亮家居)","Blinds (百葉簾)","Lawn & Garden (草地)","Gardening (園藝)","Housework (家務)","Zara Home (居家品牌)","Interior Design Content (室內設計內容)","Home Organization (家務管理和整理)","Household Goods Retail (居家用品零售商)","LifeStyle Home (生活風格家居)","Kitchen Appliances Brand (廚房家電品牌)","Cabinetry (櫥櫃)","Garden Furniture (庭院家具)","Garden Architecture (花園建築裝飾)","Terrace (露台)","Spring Cleaning (大掃除)","Home Office Furniture (居家辦公家具)","Kitchen Design (廚房設計)","Scandinavian Design (北歐風設計)","Light Fixtures (燈具)","Home Decor (居家裝飾)","Smart Home Automation (家庭自動化)","HVAC (暖通空調)","Housewarming Party (入厝派對)","Home Decor Retail (居家裝飾零售)","Home Decor Media (居家和園藝媒體)","Home Style Types (居家風格和類型)","Interior Decoration Retail (居家裝潢零售商)","Home Decoration Ideas (居家裝潢構想)","Home Accessories (居家飾品)","Flooring (地板)","Windows (窗戶)","Stainless Steel (不鏽鋼)","Mattress Brand (床墊品牌)","KitchenAid (KitchenAid廚房家電)","Garden Tools (園藝工具)","Flowers (花卉)","Flower Arranging (插花)","Ornamental Plants (觀賞植物)","Greenhouse (溫室)","Home Appliance Brand (家電品牌和零售商)"],
  food:["Cooking (烹飪)","Supermarket (超市)","Hypermarket (量販店)","Alcoholic Drinks (酒精飲品)","Gourmet Food (美食)","Coffee (咖啡)","Cafe (咖啡廳)","Chinese Cuisine (中式料理)","Organic Food (有機產品)","Picnic (野餐)","Casual Dining (休閒餐廳)","Restaurant (餐廳)","Home Brewing (自釀啤酒)","Beer Festival (啤酒節)","Starbucks (星巴克)","Farmer Market (農夫市集)","Carrefour (家樂福)","RT-Mart (大潤發)","7-Eleven (7-11)","FamilyMart (全家)","Costco (好市多)","Beverages (飲料)","Food Processing (食品加工)","Food (食品)","Seafood (海鮮)","Tea (茶)","Farm-to-Table (產地直送)","Baking & Cooking Tools (烘焙廚具)","Cookware (廚具)","Food & Beverage Industry (餐飲業)","Beer Brewing (釀造)","Brewery (釀造廠)","Food Preservation (食品保存)","Sauces (醬汁)","Wine Tasting (品酒)","Fine Dining Lovers (精緻料理愛好者)","Dining Out (外食)","Foodie (美食家)","Gourmet Food Lovers (美食愛好者)","Food Media (食品媒體和內容)","Wine Content (葡萄酒相關內容)","Specialty Coffee (精品咖啡)","Quality Foods (優質食品)","Microbrewery (小型精釀啤酒廠)","KIND Healthy Snacks (健康零食品牌)","Food Trucks (餐車飲食業)","Home Cooking (在家下廚)","Craft Beer (精釀啤酒手工啤酒)","Convenience Food (即時食品)","Food Ingredients (食材)","Tea Leaf Brand (茶葉品牌)","Liquor Retailer (酒類商品零售商)","Lifestyle Food (輕食均衡飲食)","Farm-to-Table (產地到餐桌)","Farmers Market (農夫市集)","Hospitality Industry (餐旅業)","Japanese Cuisine (日本料理)","Hotpot (火鍋)","Brunch (早午餐)","Beef (牛肉)","Desserts (甜點)","Local Cuisine (在地美食)","Cake (蛋糕)","Sushi (壽司)","Fast Food (速食)","Vegan Nutrition (純素營養)","Natural Food (天然食品)","Beer (啤酒)","Energy Drinks (能量飲料)","English Breakfast (英式早餐)","Culinary Arts (烹飪學)","Buffet (自助餐)","Bakery (烘培坊)","BBQ (燒烤)","Pastry (糕點)","Salmon (鮭魚)","Chicken (雞肉)","Food Creators (餐飲創作者)","Online Food Ordering (線上訂餐)","Korean Cuisine (韓式料理)","Coffee Culture (咖啡文化)","Coffee Beans (咖啡豆)","Winery (葡萄園)","Wine Estate (酒莊)","Sparkling Wine (氣泡酒)","Frozen Food (急凍食品)","Fast Casual Restaurant (速食休閒餐廳)","Balanced Diet (均衡飲食)","Fish Oil (魚油)"],
  travel:["Tourism (旅遊)","Travel Website (旅遊網站)","Trivago (比價平台)","Hotel (飯店)","Booking.com (訂房平台)","Hotels.com (訂房網)","Backpacking (自助旅行)","Travel Channel (旅遊頻道)","Eco-Tourism (生態旅遊)","Light Travel (輕旅行)","Vacation (假期)","Leisure Activities (休閒活動)","Holiday (度假)","Camping (露營)","RV Camping (露營車)","Bed & Breakfast (民宿)","Trailer & RV (拖掛式房車)","Airline (航空公司)","Travel Agency (旅行社)","Travel Bag (背包)","Tourist Attractions (旅遊景點)","Travel Industry (旅遊產業)","Booking.com (訂房)","Hotels.com (訂房)","Lifestyle Travel (生活旅遊)","Campsite (營地)","Weekend Getaway (週末旅遊)","Cultural Tourism (文化觀光)","Cultural Travel (文化旅遊)","Urban Exploration (城市探險)","Flight Comparison Platform (機票比價平台)","Self-guided Tour (自助導覽自由行)","RV Travel (露營車旅遊)","National Parks (國家公園)","Road Trip (公路旅行)","Weekend Trips (週末旅行)","Lifestyle Travel (貼近日常深入在地旅遊)","Ski Resort (滑雪勝地)","Adventure Travel (冒險旅遊)","Resort (度假村)","Vacation Rental (度假屋出租)","Villa (別墅住宿)","Bed and Breakfast (住宿加早餐酒店)","Business Travel (商務旅遊)","Business Class Flight (商務艙)","Low-Cost Airline (低成本航空公司)","Tourist Attractions (旅遊景點和活動)","Cruise (遊輪)","Tour Operator (遊程承攬業)","Group Tour (跟團旅行)","Japanese Inn (日式旅館)","Airport (機場)","Self-guided Travel (自助旅行)"],
  tech:["Smart Technology (智慧科技)","Artificial Intelligence (人工智慧)","Emerging Technology (新興技術)","Big Data (大數據)","YouTube (影音平台)","Electronics (電子產品)","Information Technology (資訊科技)","Technology (科技)","AI (人工智慧)","Computer (電腦)","iPad (平板)","MacBook (蘋果筆電)","Apple Watch (蘋果手錶)","PlayStation (遊戲主機)","Samsung Electronics (三星)","Philips (飛利浦)","Electrolux (伊萊克斯)","Virtual Reality (虛擬實境)","Gaming PC (電競電腦)","Video Editing Software (剪輯軟體)","Photo Editing (圖像編輯)","Smart Devices (智慧裝置)","IT & Tech Services (資訊科技服務)","Consumer Electronics (消費電子)","Instant Camera (即時成像相機)","Smart Technology News (科技新聞)","TechRadar (全球性科技媒體)","Open Source Software (開放原始碼軟體)","Wearable Technology (穿戴式科技)","Android Wear (Android智慧手錶系統)","Mobile App Development (行動應用程式開發)","Software Development (基於組件的軟體工程)","Linux (開放原始碼類Unix作業系統)","DevOps (開發維運整合)","Consumer Electronics Show (消費電子展)","AI (AI人工智能)","C Language (C語言)","Java Programming (Java程式語言)","PHP Programming (PHP程式語言)","Python Programming (Python程式語言)","GitHub (GitHub代碼平台)","Canva (Canva設計工具)","IoT Internet of Things (物聯網)","Software Engineering (軟體工程)","Software Development (軟體開發)","Computer Science (電腦科學)","Computer Programming (電腦程式設計)","Computer Technology (電腦運算)","Cloud Computing (雲端運算)","Machine Learning (機器學習)","Programming Languages (程式語言)","Antivirus Software (防毒軟體)","Web Development (網站開發)","Automation Technology (自動化技術)","GPU (圖形處理器)","RAM (電腦記憶體)","NVIDIA GeForce (NVIDIA顯卡)","Mobile App (行動應用程式)","Samsung Electronics (三星電子)","Japanese Electronics Brand (日本消費電子產品品牌)","Apple Watch (Apple Watch蘋果手錶)","MacBook (MacBook蘋果筆電)","iPad (iPad平板)","iPhone (iPhone蘋果手機)","Logitech (羅技外設)","Razer (Razer電競外設)","Consumer Electronics (消費電子產品)","Tech Brand (科技品牌)","Tech News (科技新聞)","Data Analytics (資料分析)","Data Visualization (資料視覺化)","Data Management (資料管理)","Semiconductor (半導體)"],
  sports:["Sports & Athletics (運動)","Outdoor Activities (戶外休閒)","Badminton (羽球)","Cycling Sport (自行車)","Bicycle (自行車)","Running (跑步)","Fitness (健身)","Gym Fitness (健身房)","Mountain Hiking (登山)","Physical Sports (體育)","Decathlon (迪卡儂)","Wellness (身心健康)","Vitamins & Supplements (維他命)","Health & Wellbeing (健康和保健)","Health Education (健康教育)","Parks & Recreation (公園與遊憩)","Outdoor Lifestyle (戶外)","Sports Media (運動和媒體)","Team Sports (團隊運動)","Pilates Professional (皮拉提斯專業健身)","Stretching (伸展)","Ball Sports (球類運動)","Extreme Sports (極限運動)","Hiking Equipment (健行和露營裝備)","Hiking Trails (健行登山步道)","Mountain Trail (登山步道)","Hiking and Camping (健行和露營)","Jogging (慢跑)","Marathon (馬拉松)","Baseball (棒球)","Tennis (網球)","Weight Training (重量訓練)","Aerobics (有氧運動)","Fitness Club (健身俱樂部)","Rock Climbing (攀岩)","Bouldering (攀石)","Skiing (滑雪)","Snowboarding (滑雪板)"],
  education:["Education (教育)","Higher Education (高等教育)","Academic Conference (學術研討會)","Reading (閱讀)","Academic Journal (學術期刊)","Exhibition Hall (展覽館)","Books (書籍)","Research (研究)","Library (圖書館)","Education & Library (教育和圖書館)","Montessori Education (蒙台梭利)","University (大學)","Graduate Education (研究所)","Parenting Education (親子教育)","Early Childhood Education (幼兒教育)","School District (學區)","Education Resources (教育資源)","Learning (學習)","Training (訓練)","Dental School (牙科學院)","General Education (教育)","Educational Resources (教育資源益智玩具)","Cultural Exchange (交換學生)","Continuing Education (繼續教育)","Extracurricular Activities (課外活動)","Nursing Education (護理教育)","EdTech (教育技術學)","Early Learning Centre (早教中心)","Bilingual Education (雙語教育)","Art Education (藝術教育)","Adult Education (成人教育)","Professional Development (專業發展)","Dental Education (牙醫學院教育)","Language Education (語言教育)","Foreign Language (外語)","English Language (英語學習)","Graduate Education (研究所教育)","Private School (私立學校)","Engineering School (理工學院)","Teacher Education (師範教育)","Montessori Education (蒙台梭利教育法)","Courses (課程)","School (學校)"],
  business:["Entrepreneur (企業家)","Business (商業)","Small Business (小型企業)","Sole Proprietorship (獨資企業)","SME (中小型企業)","Home Business (居家事業)","E-commerce (電子商務)","Franchise (加盟連鎖)","Startup (新創公司)","Wholesale (批發)","Self-Employed (自僱)","Business Development (業務開發)","Business Opportunity (商機)","Digital Marketing (數位行銷)","Social Media Marketing (社群媒體行銷)","Advertising Agency (廣告代理)","Business Incubator (企業孵化器)","Business Model (商業模式)","Drop Shipping (直運)","Customer Service (顧客服務)","Small Business Owner (小型企業主)","Creative Startup (創意創業)","Legal Services (法律服務)","Trade (貿易)","Advertising (廣告)","Company (公司)","Sales (業務)","Administration Industry (行政服務)","Distribution (經銷)","Entrepreneurship (創意創業)","ERP (企業資源計劃)","Outsourcing (外包)","Professional Services (專業服務)","Conglomerate (綜合企業)","Office Supplies (辦公室用品)","Marketing Services (行銷服務)","Freelance Marketplace (自由工作者市場)","Business Opportunities (商機)","Digital Transformation (數位轉型)","Co-working Space (共用工作空間)","Influencer Marketing (網紅行銷)","Trade Shows (設計貿易展)","Risk Management (風險管理)","Lead Generation (開發潛在顧客)","Marketing Automation (行銷自動化)","Sales Management (銷售管理)","Innovation (創新)","International Business (國際商務)","Customer Support (客戶支援)","Project Management Software (專案管理軟體)","B2B Marketing (B2B商業行銷)","Direct Marketing (直效營銷)","Direct Sales (直銷)","Marketing (行銷)","Marketing Planning (行銷企劃)","Marketing Services (行銷服務和組織)","Marketing Strategy (行銷策略)","Ad Campaign (廣告行銷活動)","Brand Management (品牌管理)","Business Plan (商業計畫)","Business Intelligence (商業智慧)","Business Leader (商業領袖)","Data Analytics Business (資料分析)","Training and Development (培訓和開發)","Career Development (職涯發展)","Recruitment (徵才)","E-Commerce (電子商務)","Customer Relationship Management (顧客關係管理)","Affiliate Marketing (聯盟行銷)","Viral Marketing (病毒營銷)","Productivity (生產率)","Management (管理)"],
  media:["Mass Media (大眾媒體)","News Media (新聞媒體)","Current Affairs (時事)","Entertainment (娛樂)","Netflix (串流影音)","TV Shows (電視節目)","TV Channel (電視台)","Short Video (短片)","Video Production (影片製作)","Viral Video (爆紅影片)","Radio Broadcasting (廣播)","Public Broadcasting (公共廣播)","Newspaper (報紙)","News Broadcasting (新聞播報)","Local News (本地新聞)","Pop Culture (流行文化)","Internet Memes (網路迷因)","Social Media (社群媒體)","Video Sharing Platform (影片分享)","Casual Games (休閒遊戲)","Entertainment News (娛樂新聞)","Celebrity News (名人娛樂新聞)","Video on Demand (隨選影片)","International News (國際新聞)","Film Awards (影視獎項)","Music Streaming (音樂和音訊串流)","Film and TV Industry (電影和電視業)","Digital Media (數位媒體)","Memes Community (迷因和社群媒體論壇)","Apple Music (Apple Music)","Netflix (Netflix)","Spotify (音樂串流)","LINE (LINE通訊)","Podcast (Podcast音頻)","Pop Music (流行音樂)","Music Festival (音樂節)","Concert (演唱會)","Singing (歌唱)","Mandopop (華語流行音樂)","K-Pop (韓國流行音樂)","K-Drama (韓國電視劇)","Variety Show (綜藝節目)","Soap Opera (肥皂劇)","Reality TV (真人實境秀)","E-book (電子書)","Viral Videos (爆紅影片)","Trending Topics (熱門話題)","Video Club (影音俱樂部)"],
  gov:["Government (政府)","Local Government (地方政府)","Government Employee (政府員工)","Community Issues (社區議題)","Public Safety (公共安全)","National Security (國家安全)","Veterans Day (軍人節)","Retirement Insurance (退休保險)","Retirement Fund (退休基金)","Pension (退休金)","Retirement Planning (退休規劃)","Community Services (社區服務)","Public Transport (公共運輸)","Government Operations (政府機關概念)","Veteran Benefits (退伍軍人福利)","Public Administration (市政事務)","Retirement Insurance Benefits (退休保險福利)","Military (軍事)","Law (法律)","Lawyer (律師)","Law Firm (律師事務所)","Political and Social Issues (政治和社會議題)","Community and Social Services (社區和社會服務)","Tax Law (稅法)","Budget (財政預算案)"],
  insurance:["Insurance (保險)","Insurance Policy (保單)","Credit Card (信用卡)","Loan (貸款)","PayPal (電子支付)"],
  industry:["Manufacturing (製造業)","Food Industry (食品產業)","Factory (工廠)","Export Processing (加工出口工廠)","Logistics (物流)","Supply Chain (供應鏈)","Textile Industry (紡織工業)","Export Trade (出口貿易)","Machine Manufacturing (機械加工)","Metal Processing (金屬加工)","Warehousing (倉儲業)","Chemical Industry (化學工業)","Agriculture Industry (農業)","Fishery (漁業)","Transport & Moving (運輸與搬運)","Contract Manufacturing (代工生產)","Technician (技術員)","Industrial Engineering (工業工程)","Installation & Repair (安裝維修)","Building Materials (建材)","Water Industry (水利產業)","Procurement (採購管理)","Logistics Services (運輸和物流服務)","Freight Transport (運輸和物流貨運)","Industrial Technology (產業科技)","Electrical Wiring (電氣配線)","Forklift (叉車)","Sustainable Architecture (永續建築)","Building Construction (建築工程)","Manufacturing (製造)","Manufacturing Services (製造生產服務)","Packaging and Labeling (包裝和標籤)","Distribution (配送)","Electrical Distribution (配電系統)","Electric Lighting (電光源)","Battery (電池)","Oil and Gas (石油)","Quartz (石英)","Metal (金屬)","Glass (玻璃)","Masonry (砌體結構)","Machine Tools (工具機)","Printing (印刷)"],
  beauty:["Clothing (服裝)","Fashion Accessories (時尚配件)","Beauty (美容)","Zara (時尚品牌)","H&M (服飾品牌)","MUJI (無印良品)","Lancome (蘭蔻)","MAC Cosmetics (MAC)","Jewelry (首飾)","Skincare (保養)","T-Shirt (T恤)","Garment (成衣)","Beauty Info Community (美妝社群)","Fragrance Oil (香精油)","HydraFacial (海菲秀水飛梭)","Fashion Technology (時尚科技機構)","Sustainable Fashion (永續時尚)","Footwear Media (鞋類媒體和內容)","Fashion Week (時裝周時裝秀)","Garment Industry (成衣服裝業)","Skincare (護膚保養)","Nail Art (指甲彩繪)","Nail Salon (美甲沙龍)","Beauty Salon (美容沙龍)","Beauty Store (美妝店)","Beauty Influencer (美妝網紅)","Keratin (角蛋白)","Hairstyle (髮型)","Tattoo (刺青)","CeraVe Skincare (CeraVe護膚)","Streetwear (街頭時尚)","Fast Fashion (快時尚)","Cartier (卡地亞珠寶)","Men's Fashion (男裝品牌)","Beauty Influencers (美妝網紅)","Keratin and Collagen (角蛋白膠原蛋白)","Men's Grooming (男性修容用品)","Women's Fashion Brand (女裝品牌)","Men's Fashion Brand (男裝品牌)"],
  auto:["Car (汽車)","SUV (休旅車)","Auto Industry (汽車業)","Electric Vehicle (電動車)","Tesla (特斯拉)","Toyota (豐田)","BMW (寶馬)","Mercedes-Benz (賓士)","Honda (本田)","Car Insurance (汽車保險)","Car Loan (車貸)","Automobile Parts (汽車零件)","Electric Scooter (電動機車)","Motorcycle Accessories (摩托車配件)","Semi-Truck (聯結車)","Car Accessories (汽車零件)","Auto Repair (汽車技師)","Family Car (家用車)","Top Gear Magazine (極速誌雜誌)","Enterprise Car Rental (企業租車服務)","Used Car (二手車)","Custom Vehicle (自訂車款)","Car Maintenance (汽車保養)","Car Detailing (汽車美容)","Auto Parts Sales (汽車零件製造和銷售)","Hybrid Vehicle (油電混合車)","Sports Car (跑車)","Crossover SUV (跨界休旅車)","City Car (都會車)","Hatchback (掀背車)","Lexus (Lexus凌志汽車)","Nissan (Nissan日產汽車)","Car Dealership (汽車經銷)","Truck (卡車)","Car Wash (洗車)","Modified Car (改裝車)"],
  medical:["Healthcare Services (醫療健康)","Medical School (醫學院)","Self-Care (自我照護)","Healthcare Industry (醫療行業)","Dentist (牙醫)","Hospital (醫院)","Mental Health (心理健康)","Pharmacy (藥局)","Traditional Chinese Medicine (中醫)","Nutrition (營養)","Physical Therapy (物理治療)","Aesthetic Medicine (醫美)","Health Checkup (健康檢查)","Yoga (瑜珈)","General Health (一般健康)","Healthy Lifestyle (健康的生活習慣)","Nutritional Supplements (維他命和營養補充品)","Health Food Brand (健康食品品牌)","Human Nutrition (人體營養科學)","Protein Supplements (蛋白質補充品)","Healthy Recipes (健康飲食的食譜)","Genetics (遺傳學)","Neuroscience (神經科學)","Yoga Studio (瑜珈教室和教學)","Dental School (牙科學院)","Water Therapy (水療)","Healthy Habits (健康的習慣)","Healthcare Services (健康照護與醫療服務)","Cholesterol (膽固醇)"],
  agri:["Rural Area (農村)","Agritourism (農家樂)","Farm (農場)","Aquaculture (養殖漁業)","International Trade (國際貿易)","Organic Farming (有機農業)","Livestock (畜牧業)","Vegetable Farm (蔬菜農場)","Fruit Farm (果園)","Tea Garden (茶園)","Honey (蜂蜜)","Agricultural Technology (農業科技)","Rural Tourism (農村旅遊)","Farming Community (農業社群)","Commercial Fishing (商業捕魚)","Longline Fishing (延繩捕魚)","Sustainable Agriculture (永續農業)","Agricultural Media (農業新聞和內容)","Agricultural Machinery (農業機械)","Agricultural Services (農業服務和組織)","Agricultural News (農業新聞和內容)","Fertilizer (肥料)","Forest Ecology (森林生態學)","Botanical Garden (植物園)","Agribusiness (農企業)"],
  family:["Family (家庭)","Parent of Toddler (嬰幼兒家長)","Parent of Elementary Child (小學家長)","Parent of Pre-Teen (青少年家長)","Engagement Proposal (求婚)","Wedding (婚禮)","Engagement (訂婚)","Childcare (幼兒照護)","Parenting Styles (教養方式)","Motherhood (育兒雜誌)","Baby Food (嬰兒副食品)","Family Board Games (家庭桌遊)","Red Envelope (紅包亞洲文化)","Kids Activities (兒童活動)","Baby & Maternity Store (嬰幼兒和孕婦用品店)","Working Parent (工作父母雙薪家庭)","Ring (戒指)","Engagement Ring (訂婚戒指)","Wedding Ring (婚戒)","Marriage (婚姻)","Wedding Banquet (婚宴)","Wedding Photography (婚紗攝影)","Wedding Website (婚禮網站和部落格)","Wedding Invitation (喜帖)","Wedding Cake (結婚蛋糕)","Parenting Magazine (育兒雜誌)","Parenting (育兒)","Children Education (兒童發展)","Children's Literature (兒童文學)","Newborn Party (新生兒派對)","Parenting Style (教養方式)","Parent Magazine (親子雜誌)","CommonWealth Education (親子天下)","Mom & Baby (媽媽寶寶懷孕)"],
  youth:["Online Shopping (網路購物)","Young Professionals (上班族)","Instagram (社群)","Work From Home (遠距工作)","Chinese Culture (中華文化)","Movie Lovers (電影愛好者)","Online Entertainment (網路娛樂)","Online Social Community (網路社區)","Internet Celebrity (網路名人)"],
  shopping:["Department Store (百貨公司)","Group Buying (團購)","Sales Promotion (促銷)","Convenience Store (便利商店)","Retail Industry (零售業)","Coupon (優惠券)","Discounts & Deals (折扣優惠)","Shopping (購物)","Flash Sale (特賣促銷)","Daily Deals (本日優惠)","Shopping Discount (購物折扣)","Amazon (亞馬遜)","Loyalty Program (會員集點計畫)","Online Fashion Store (網拍服飾品牌零售商)","Cash Rebate (現金回饋獎勵)","Buy One Get One (買一送一促銷)","Travel Deals (旅行優惠)","Daiso (大創百貨)","momo Shopping (momo購物網)","Taobao (淘寶網)","Discount Shopping (折扣和折讓)","Discount Store (折扣商店)","Thrifty Lifestyle (節儉生活風格)","Shopping Mall (購物中心)","Boutique Store (精品店)","Second-Hand Goods (二手商品)","Home Decor Store (居家裝潢零售商)","Electronics Store (消費電子產品零售商)","Online Shopping Website (網路購物網站)","Home Furnishing Retail (居家用品零售商)"],
  arts:["Graphic Design (平面設計)","Arts (藝術)","Design (設計)","Web Design (網站設計)","Modern Art (現代藝術)","Culture (文化)","Architecture (建築)","Art Exhibition (藝術展覽)","Architecture Media (建築媒體)","Creativity (創意)","Illustration (插畫)","Contemporary Art Museum (當代美術館)","Painting (繪畫)","Museum (博物館)","Buildings (建築物)","Art Gallery (美術館)","User Experience Design (用戶體驗設計)","Digital Art (數字藝術)","Live Music (現場音樂音樂會)","Art Auction (藝術拍賣展)","Graffiti Art (塗鴉藝術)","National Gallery (國家藝廊)","Contemporary Art (當代藝術)","Artwork (藝術品)","Cultural Heritage (文化遺產)","Literature (文學)","History (歷史)","Performing Arts (表演藝術)","Sculpture (雕刻)","Interior Architecture (室內建築)","Art Deco (裝飾風藝術)","Portrait Photography (肖像攝影)","Photographer (攝影師)","Miyazaki Hayao (宮崎駿動漫)","Digital Camera (數位相機)"],
  gaming:["Gamer (玩家)","Nintendo (任天堂)","Mobile Gaming (手機遊戲)","PC Gaming (電腦遊戲)","Console Gaming (主機遊戲)","Esports Tournament (電競賽事)","Steam (Steam平台)","Xbox (Xbox主機)","MOBA Games (MOBA遊戲)","RPG Games (角色扮演遊戲)","Battle Royale (大逃殺遊戲)","Twitch Streamer (遊戲直播)","Unity Game Engine (Unity遊戲引擎)","Board Games (桌上遊戲)","Video Game Culture (電子遊戲文化)","GameFAQs (電玩遊戲網路媒體)","Collectible Toys (收藏用玩具集換卡片)","Mobile Gaming (運動類遊戲)","Super Mario (超級馬利奧系列)","Legend of Zelda (薩爾達傳說)","Online Gaming (網路遊戲)","Video Games (電玩遊戲)","LEGO (樂高玩具)","Mahjong (麻將)"],
  pets:["Pets & Animals (寵物)","Pet Food (寵物食品)","Dog (狗)","Cat (貓)","Pet Grooming (寵物美容)","Veterinary Clinic (動物醫院)","Pet Accessories (寵物配件)","Fish Aquarium (水族箱)","Bird (鳥類)","Pet Insurance (寵物保險)","Dog Training (狗狗訓練)","Pet Shelter (動物收容)","Dog Grooming (狗狗美容)","Dog Walking (遛狗)","Dog Health (犬隻健康)","Aquarium Keeping (水族飼養)","Cat Food (貓糧)","Fishing Gear (漁具)"],
  engineering:["High-Tech (高科技)","Computer Engineering (電腦工程)","Electronic Engineering (電子工程)","Civil Engineering (土木工程)","Construction Engineering (建築工程)","Environmental Engineering (環境工程)","Mechanical Engineering (機械工程)","Electrical Engineering (電機工程)","Electronic Components (電子元件)","Genetic Engineering (基因工程)","Physical Security (保護人員和財產安全)","Science Communication (科技傳播學)","Structural Engineering (結構工程)","Materials Science (材料科學)","Mechanics (力學)","Chemistry (化學)","Biochemistry (生物化學)","Biotechnology (生物技術)","Biology (生物學)","Physics (物理學)","Energy Science (能源)","Energy Efficiency (能源效率)","Environmental Science (環境科學)","Natural Science (自然科學)","Mathematics (計算與數學)"],
  craft:["Cotton Craft (棉花)","Sewing Machine (縫紉機)","Textile (紡織品)","Textile Crafts (紡織工藝)","Yarn (紗線)","Embroidery (刺繡)","Knitting (編織)","Sewing (縫紉)","Handicraft (手工藝)","Crafts & Hobbies (手工藝嗜好)","Woodworking (木工手工藝)"],
  community:["Donation (捐贈)","Charity & Non-profit (慈善公益)","Non-profit Organization (非營利組織)","Club (俱樂部)","Political & Social Issues (政治社會)"],
  corporate:["Product Manager (產品經理)","Founder (創辦人)","Director (總監)","Vice President (副總經理)","Corporate Management (企業管理)","CEO (執行長)","Manager (經理)","Human Resources (人力資源)","CFO (財務長)","Executive Coaching (高管教練)","Leadership (領導力)","Board of Directors (董事會)","Corporate Strategy (企業策略)","Business Networking (商業社交)","C-Suite Executive (高層主管)","Leadership Development (領導力發展)","Business Networking (商業社交人脈)","Consulting (顧問諮詢業)","Multinational Corporation (跨國公司)","Compensation and Benefits (薪水及福利)","Employee Engagement (員工敬業度)","Workwear (工作服)","Human Resources Management (人力資源管理)","Female Entrepreneur (女性企業家)","Business Decision Maker (商業決策者)","Leadership (領導)","Chairman (董事長)"],
  leisure:["Leisure & Entertainment (休閒娛樂)","Nature & Science (大自然)","Leisure Lifestyle (休閒)","Nature Photography (自然攝影)","Outdoor Living (戶外生活)","Quality of Life (生活品質)","Park (公園)","Plants & Flowers (植物花卉)","Leisure Fishing (休閒釣魚)","Birdwatching (觀鳥)","Lifestyle Brand (生活品牌)","Weekend Getaway (週末小旅行)","Staycation (宅度假)","Christmas Holiday (聖誕假期)","Socializing (社交交際)","Aquarium Tourism (水族旅遊景點)","Live Events (現場活動)","Brunch Party Planning (派對策畫)","Lifestyle Magazine (生活風格雜誌)","Happy Hour (歡樂時光)","Movie Lovers (電影愛好者)","Karaoke (卡拉OK)","Jigsaw Puzzle (拼圖)","Bowling (保齡球)","Party (派對)","Festival Events (節慶活動)","Fishing (釣魚)"],
  finance:["ATM (自動提款機)","Wire Transfer (電匯)","Digital Wallet (數位錢包)","Installment Plan (分期付款)","Credit Score (信用評分)","Online Banking (網路銀行)","FinTech (金融科技)","BNPL (先買後付)","Forex Trading (外匯交易)","Wealth Management (財富管理)","Financial Technology (金融科技)","Payment Service Provider (支付服務商)","Lending Services (信貸服務)","Mobile Banking (行動銀行)","Certified Financial Planner (認證理財規劃師)","Tax Preparation (報稅申報服務)","Foreign Exchange Market (外匯市場)","Credit Union (儲蓄互助社)","Bank Account (銀行帳戶)","Retail Banking (零售銀行業務)","Personal Finance Services (個人理財服務)","Credit Services (信貸服務)","American Express (美國運通)","Financial Accounting (財務會計)","Financial Economics (金融經濟學)"],
  pin_rich:["Luxury Car (豪華轎車)","Luxury Goods (精品)","Private Banking (私人銀行)","Hermes (愛馬仕)","Chanel (香奈兒)","Golf (高爾夫球)","Haute Couture (高級訂製)","High Net Worth (高淨值人士)","Luxury Lifestyle (豪奢生活方式)","Country Club (高級俱樂部)","Christie's Auction (佳士得藝術拍賣)","Sotheby's Auction (蘇富比藝術拍賣)","Fine Dining (高級餐飲愛好者)","Art Auction (藝術拍賣)","Priority Pass (機場貴賓室)","Frequent Flyer Program (飛行常客獎勵)","Philanthropy (慈善家)","Boutique Fashion (女性精品服飾)","Boutique Hotel (精品酒店)","Luxury Travel (豪華旅遊)","Luxury Resort (奢華渡假村)","Collectibles (收藏品)","High-end Audio (高端音響)","Wine Tasting (品酒)","Fine Dining Lovers (精緻料理愛好者)","Specialty Coffee (精品咖啡)","Asset Management (資產管理)","Wealth (財富)"],
  pin_stock:["Stocks (股票)","Financial Market (金融市場)","Foreign Exchange (外匯市場)","Cryptocurrency (數位貨幣)","Stock Index (股市指數)","Financial Planning (財務規劃)","Stock Market (股票市場)","Trading Strategy (交易策略)","Day Trading (當沖交易)","Swing Trading (波段交易)","Forex Signals (外匯交易信號)","Investment Strategy (投資策略)","Financial Advisor (財務顧問)","Capital (資金)","ROI (投資報酬率)","Investor (投資者)","Securities (證券)","Stock Broker (股票經紀人)","Algorithmic Trading (演算法自動交易)","Venture Capital (創投融資)","Angel Investing (天使投資)","ETF (指數型股票基金)","Forex Trading (外匯交易)","Wealth Management (財富管理)","FinTech (金融科技)","Passive Income (被動收入)","Investment (投資)"],
  pin_senior:["Retirement Insurance (退休保險)","Retirement Fund (退休基金)","Pension (退休金)","Retirement Planning (退休規劃)","Retirement Community (退休社區)","Veteran Benefits (退伍軍人福利)","Retirement Insurance Benefits (退休保險福利)","General Health (一般健康)","Healthy Lifestyle (健康的生活習慣)","Traditional Chinese Medicine (中醫)","Health Checkup (健康檢查)","Physical Therapy (物理治療)","Yoga (瑜珈)","Nutritional Supplements (維他命和營養補充品)","Birdwatching (觀鳥)","Nature Photography (自然攝影)","Tea Leaf Brand (茶葉品牌)","Cultural Tourism (文化觀光)","National Gallery (國家藝廊)","Garden Architecture (花園建築裝飾)","Garden Furniture (庭院家具)","Home Cooking (在家下廚)","Healthcare Services (醫療健康)","Family Board Games (家庭桌遊)"],
  pin_youth:["Mobile Gaming (手機遊戲)","PC Gaming (電腦遊戲)","Console Gaming (主機遊戲)","Esports Tournament (電競賽事)","Twitch Streamer (遊戲直播)","MOBA Games (MOBA遊戲)","RPG Games (角色扮演遊戲)","Battle Royale (大逃殺遊戲)","Memes Community (迷因和社群媒體論壇)","Entertainment News (娛樂新聞)","Music Streaming (音樂和音訊串流)","Online Shopping (網路購物)","Young Professionals (上班族)","Instagram (社群)","Work From Home (遠距工作)","Online Entertainment (網路娛樂)","Movie Lovers (電影愛好者)","YouTube (影音平台)","Virtual Reality (虛擬實境)","Cash Rebate (現金回饋獎勵)","Buy One Get One (買一送一促銷)","Video on Demand (隨選影片)","Celebrity News (名人娛樂新聞)","Digital Art (數字藝術)","Live Music (現場音樂音樂會)"],
  pin_tech:["Smart Technology (智慧科技)","Artificial Intelligence (人工智慧)","Emerging Technology (新興技術)","Big Data (大數據)","Information Technology (資訊科技)","AI (人工智慧)","Virtual Reality (虛擬實境)","Smart Devices (智慧裝置)","IT & Tech Services (資訊科技服務)","Consumer Electronics (消費電子)","Open Source Software (開放原始碼軟體)","Wearable Technology (穿戴式科技)","Android Wear (Android智慧手錶系統)","Mobile App Development (行動應用程式開發)","Software Development (基於組件的軟體工程)","Linux (開放原始碼類Unix作業系統)","DevOps (開發維運整合)","Consumer Electronics Show (消費電子展)","Computer Engineering (電腦工程)","Electronic Engineering (電子工程)","High-Tech (高科技)","Electronic Components (電子元件)","Digital Transformation (數位轉型)","Innovation (創新)","Unity Game Engine (Unity遊戲引擎)","ERP (企業資源計劃)"],
  pin_gov:["Government (政府)","Local Government (地方政府)","Government Employee (政府員工)","Community Issues (社區議題)","Public Safety (公共安全)","National Security (國家安全)","Veterans Day (軍人節)","Retirement Insurance (退休保險)","Retirement Fund (退休基金)","Pension (退休金)","Retirement Planning (退休規劃)","Community Services (社區服務)","Public Transport (公共運輸)","Government Operations (政府機關概念)","Veteran Benefits (退伍軍人福利)","Public Administration (市政事務)","Retirement Insurance Benefits (退休保險福利)","Compensation and Benefits (薪水及福利)","Employee Engagement (員工敬業度)"],
  pin_re:["Real Estate 591 (591房屋交易網)","Housing (房屋)","Real Estate Industry (房地產)","Residential Area (住宅區)","Property Portal (房屋廣告)","Property (不動產)","Apartment (公寓)","Apartment Complex (公寓大樓)","Real Estate Investment (房地產投資)","Leju Network (樂屋網)","Home Construction (住宅興建)","Starter Home (起步房)","Rental Property (租賃)","Real Estate Development (房地產開發)","Real Estate Economics (房地產經濟學)","Property Valuation (房地產估價)","First-Time Buyer (首次購房者)","Home Buyer Subsidy (首次購屋補助)","Mortgage Loan (房屋抵押貸款)","New Home (新家)","Prefab Home (組合屋)","Real Estate Investing (房地產投資相關)","Residential Real Estate (住宅房地產)","Real Estate Investment Club (房地產投資俱樂部)","Commercial Property (商用不動產)","Home Renovation (住家翻新)","Townhouse (連棟住宅)","Rental Listings (待租房屋資訊)","Sustainable Architecture Design (永續建築設計)","Building Construction (建築工程)"]
};
const CATNAMES={
  re:'Real Estate (房地產)',
  invest:'Investment (投資理財)',
  rich:'Luxury Wealth (高端消費)',
  home:'Home Living (居家生活)',
  food:'Food Dining (美食餐飲)',
  travel:'Travel Tourism (旅遊觀光)',
  tech:'Technology (科技數位)',
  sports:'Sports Health (運動健康)',
  education:'Education (教育學習)',
  business:'Business Marketing (商業行銷)',
  media:'Media Entertainment (媒體娛樂)',
  gov:'Government Public (政府公共)',
  insurance:'Finance Insurance (金融保險)',
  industry:'Industry Manufacturing (工業製造)',
  beauty:'Fashion Beauty (時尚美容)',
  auto:'Automotive (汽車交通)',
  medical:'Health Medical (醫療健康)',
  agri:'Agriculture Rural (農業農村)',
  family:'Family Wedding (家庭婚姻)',
  youth:'Youth Lifestyle (年輕族群)',
  shopping:'Shopping Deals (購物優惠)',
  arts:'Arts Design (藝術設計)',
  gaming:'Gaming E-sports (遊戲電競)',
  pets:'Pets Animals (寵物動物)',
  engineering:'Engineering Science (工程科學)',
  craft:'Crafts DIY (手工藝)',
  community:'Community Non-profit (社區公益)',
  corporate:'Corporate Executive (企業高管)',
  leisure:'Leisure Outdoor (休閒戶外)',
  finance:'Banking Payments (銀行支付)',
  pin_rich:'有錢興趣 (Wealthy Interests)',
  pin_stock:'股市期貨 (Stocks & Futures)',
  pin_senior:'長輩興趣 (Senior Interests)',
  pin_youth:'年輕人興趣 (Youth Interests)',
  pin_tech:'科技業興趣 (Tech Industry)',
  pin_gov:'公務員興趣 (Civil Servant)',
  pin_re:'房地產興趣 (Real Estate)'
};
let ALL_TAGS=Object.values(TAGS).flat();
// Build reverse lookup: Chinese substring → full TAGS entry + category
const TAG_LOOKUP={};const TAG_CAT={};
Object.keys(TAGS).forEach(cat=>{
  TAGS[cat].forEach(t=>{
    TAG_CAT[t]=cat;
    const m=t.match(/^(.+?)\s*\((.+)\)\s*$/);
    if(m){
      TAG_LOOKUP[m[2]]=t;
      const simple=m[2].replace(/（[^）]*）/g,'').replace(/\([^)]*\)/g,'').trim();
      if(simple&&!TAG_LOOKUP[simple])TAG_LOOKUP[simple]=t;
    }
  });
});
// Supplement TAGS with all unique raw tags from AUD not already mapped
const _audRaw=[...new Set(AUD.flatMap(a=>parseTags(a.interest)))];
const _extra=[];
_audRaw.forEach(raw=>{
  const norm=raw.replace(/（[^）]*）/g,'').replace(/\([^)]*\)/g,'').trim();
  if(!TAG_LOOKUP[raw]&&!TAG_LOOKUP[norm]&&raw.length>0){
    _extra.push(raw);
    TAG_LOOKUP[raw]=raw;TAG_LOOKUP[norm]=raw;
  }
});
if(_extra.length){
  TAGS.extra=_extra;CATNAMES.extra='Uncategorized (未分類興趣)';
  const sel=document.getElementById('catSel');
  const opt=document.createElement('option');opt.value='extra';opt.textContent='Uncategorized (未分類興趣) ('+_extra.length+')';
  const lastGrp=sel.querySelector('optgroup:last-of-type');(lastGrp||sel).appendChild(opt);
}
ALL_TAGS=Object.values(TAGS).flat();
// Fix dropdown label in case of encoding issue

let _tt;
function esc(s){return(s||'').replace(/&/g,'&amp;').replace(/</g,'&lt;').replace(/>/g,'&gt;')}
function copyText(t,el){
  navigator.clipboard.writeText(t).then(()=>{
    if(el){el.classList.add('copied');setTimeout(()=>el.classList.remove('copied'),900)}
    const toast=document.getElementById('toast');
    toast.textContent='已複製';toast.classList.add('show');clearTimeout(_tt);
    _tt=setTimeout(()=>toast.classList.remove('show'),1400);
  });
}
function mkTag(text,catKey){
  const el=document.createElement('span');el.className='tag';
  const m=text.match(/^(.+?)\s*\((.+)\)\s*$/);
  if(m&&m[1]!==m[2]){
    const en=document.createElement('span');en.className='tag-en';en.textContent=m[1];
    const zh=document.createElement('span');zh.className='tag-zh';zh.textContent=m[2];
    el.appendChild(en);el.appendChild(zh);
    el.onclick=()=>copyText(m[1],el);
  }else{
    const simple=text.replace(/（[^）]*）/g,'').replace(/\([^)]*\)/g,'').trim()||text;
    const en=document.createElement('span');en.className='tag-en';en.textContent=simple;
    if(simple!==text){const zh=document.createElement('span');zh.className='tag-zh';zh.textContent=text;el.appendChild(zh);}
    el.insertBefore(en,el.firstChild);
    el.onclick=()=>copyText(simple,el);
  }
  return el;
}
function parseTags(s){
  if(!s)return[];
  return s.split(/[、，]|(?:或)(?=[^\s（,])|,/).map(t=>t.trim().replace(/^[-\s]+/,'').replace(/\s+/,' ')).filter(t=>t.length>1&&t.length<60);
}
function badgeCls(tp){const m={名單:'bn',訊息:'bm',流量:'bf',互動:'bi'};return m[tp]||'bo'}

// PAGE 1
function renderP1(){
  const cat=document.getElementById('catSel').value;
  const q=document.getElementById('tagQ').value.trim().toLowerCase();
  const main=document.getElementById('p1main');
  const info=document.getElementById('sideInfo');
  main.innerHTML='';
  if(cat){
    const pool=q?TAGS[cat].filter(t=>t.toLowerCase().includes(q)):TAGS[cat];
    info.textContent=pool.length+' 個標籤';
    const blk=document.createElement('div');blk.className='cat-blk';
    const ttl=document.createElement('div');ttl.className='cat-ttl';
    ttl.innerHTML=CATNAMES[cat]+'<span class="cat-cnt">'+pool.length+'</span>';
    const grid=document.createElement('div');grid.className='tag-grid';
    pool.forEach(t=>grid.appendChild(mkTag(t,cat)));
    blk.appendChild(ttl);blk.appendChild(grid);main.appendChild(blk);
  } else if(q){
    const pool=ALL_TAGS.filter(t=>t.toLowerCase().includes(q)||t.replace(/（[^）]*）/g,'').toLowerCase().includes(q));
    info.textContent=pool.length+' 個標籤';
    const blk=document.createElement('div');blk.className='cat-blk';
    const ttl=document.createElement('div');ttl.className='cat-ttl';
    ttl.innerHTML='搜尋結果<span class="cat-cnt">'+pool.length+'</span>';
    const grid=document.createElement('div');grid.className='tag-grid';
    pool.forEach(t=>grid.appendChild(mkTag(t,TAG_CAT[t]||'')));
    blk.appendChild(ttl);blk.appendChild(grid);main.appendChild(blk);
  } else {
    let total=0;
    Object.keys(TAGS).filter(k=>!k.startsWith('pin_')).forEach(k=>{
      total+=TAGS[k].length;
      const blk=document.createElement('div');blk.className='cat-blk';
      const ttl=document.createElement('div');ttl.className='cat-ttl';
      ttl.innerHTML=CATNAMES[k]+'<span class="cat-cnt">'+TAGS[k].length+'</span>';
      const grid=document.createElement('div');grid.className='tag-grid';
      TAGS[k].forEach(t=>grid.appendChild(mkTag(t,k)));
      blk.appendChild(ttl);blk.appendChild(grid);main.appendChild(blk);
    });
    info.textContent='共 '+total+' 個標籤';
  }
}
document.getElementById('catSel').addEventListener('change',renderP1);
document.getElementById('tagQ').addEventListener('input',renderP1);
renderP1();

// PAGE 2
const projs=[...new Set(AUD.map(a=>a.project).filter(p=>p))].sort();
const ps=document.getElementById('projSel');
projs.forEach(p=>{const o=document.createElement('option');o.value=p;o.textContent=p;ps.appendChild(o);});

function renderP2(){
  const proj=document.getElementById('projSel').value;
  const q=document.getElementById('audQ').value.trim().toLowerCase();
  const list=document.getElementById('audList');
  let pool=proj?AUD.filter(a=>a.project===proj):AUD;
  if(q)pool=pool.filter(a=>(a.ta||'').toLowerCase().includes(q)||(a.interest||'').toLowerCase().includes(q)||(a.project||'').toLowerCase().includes(q));
  const allTags=new Set();
  pool.forEach(a=>parseTags(a.interest).forEach(t=>allTags.add(t)));
  document.getElementById('p2stats').innerHTML='共 <strong>'+pool.length+'</strong> 組受眾 / <strong>'+allTags.size+'</strong> 個不重複興趣標籤';
  list.innerHTML='';
  if(!pool.length){list.innerHTML='<div class="empty">無符合結果</div>';return;}
  pool.forEach(a=>{
    const tags=parseTags(a.interest);
    const card=document.createElement('div');card.className='aud-card';
    const ta=(a.ta||'').replace(/\r?\n/g,' ').replace(/[、，,]\s*\d+(?:訊息|名單)[^\s（(]*/g,'').replace(/\s+\d+(?:訊息|名單)\s*$/,'').trim();
    const projClean=(a.project||'').replace(/[、，,]\s*\d+(?:訊息|名單)[^\s（(]*/g,'').replace(/\s+\d+(?:訊息|名單)\s*$/,'').trim();
    const proj_badge=projClean?'<span style="font-size:11px;color:#888;background:#f5f5f6;padding:2px 6px;border-radius:10px">'+esc(projClean)+'</span>':'';
    const type_badge=a.type?'<span class="badge '+badgeCls(a.type)+'">'+esc(a.type)+'</span>':'';
    card.innerHTML='<div class="aud-hd"><span class="aud-ta">'+esc(ta)+'</span>'+proj_badge+type_badge+'</div><div class="aud-tgs"></div>';
    list.appendChild(card);
    const tArea=card.querySelector('.aud-tgs');
    if(tags.length){const g=document.createElement('div');g.className='aud-tg-grid';tags.forEach(raw=>{const full=TAG_LOOKUP[raw]||(TAG_LOOKUP[raw.replace(/（[^）]*）/g,'').trim()]);const entry=(full&&full!==raw)?full:null;g.appendChild(mkTag(entry||raw,entry?TAG_CAT[entry]:null));});tArea.appendChild(g);}
    else tArea.innerHTML='<span style="color:#bbb;font-size:11px">（無可解析標籤）</span>';
  });
}
document.getElementById('projSel').addEventListener('change',renderP2);
document.getElementById('audQ').addEventListener('input',renderP2);
renderP2();

// PAGE 3 - Map
let map_=null,marker_=null,selLoc=null;
function initMap(){
  if(map_)return;
  map_=L.map('leafletMap').setView([24.15,120.7],11);
  L.tileLayer('https://{s}.tile.openstreetmap.org/{z}/{x}/{y}.png',{attribution:'© OpenStreetMap'}).addTo(map_);
  map_.on('click',e=>setPin(e.latlng.lat,e.latlng.lng,'已釘選位置'));
  setTimeout(()=>map_.invalidateSize(),200);
}
function setPin(lat,lng,name){
  selLoc={lat,lng,name};
  document.getElementById('locLbl').textContent=name+' ('+lat.toFixed(4)+', '+lng.toFixed(4)+')';
  if(marker_)map_.removeLayer(marker_);
  marker_=L.marker([lat,lng]).addTo(map_).bindPopup(name).openPopup();
  map_.setView([lat,lng],14);
}
async function searchLoc(){
  const q=document.getElementById('locInput').value.trim();
  if(!q)return;
  try{
    const url='https://nominatim.openstreetmap.org/search?q='+encodeURIComponent(q+'台灣')+'&format=json&limit=1';
    const r=await fetch(url,{headers:{'Accept-Language':'zh-TW'}});
    const d=await r.json();
    if(d.length){setPin(parseFloat(d[0].lat),parseFloat(d[0].lon),d[0].display_name.split(',')[0]);}
    else document.getElementById('locLbl').textContent='找不到該地點';
  }catch(e){document.getElementById('locLbl').textContent='定位失敗';}
}

// Interest ratios
const ratioData=[
  {id:'rich',name:'Wealthy (有錢)',pct:20,checked:true},
  {id:'re',name:'Real Estate (房地產)',pct:30,checked:true},
  {id:'youth',name:'Youth (年輕人)',pct:15,checked:true},
  {id:'tech',name:'Tech (科技業)',pct:20,checked:true},
  {id:'gov',name:'Civil Service (公務員)',pct:15,checked:true}
];
function buildRatios(){
  const list=document.getElementById('ratioList');
  list.innerHTML='';
  ratioData.forEach((r,i)=>{
    const row=document.createElement('div');row.className='ratio-row';
    row.innerHTML='<input type="checkbox" class="rc" id="rc'+i+'" '+(r.checked?'checked':'')+'><span class="rn" onclick="toggleDet('+i+')">'+r.name+'</span><input type="number" class="rp" id="rp'+i+'" value="'+r.pct+'" min="0" max="100"><span class="rpct">%</span>';
    list.appendChild(row);
    const det=document.createElement('div');det.className='rdet';det.id='rdet'+i;
    TAGS[r.id].slice(0,15).forEach(t=>{
      const s=document.createElement('span');s.className='rmtag sel';s.textContent=t;
      s.onclick=()=>s.classList.toggle('sel');det.appendChild(s);
    });
    list.appendChild(det);
    row.querySelector('#rc'+i).addEventListener('change',updateRatioTotal);
    row.querySelector('#rp'+i).addEventListener('input',updateRatioTotal);
  });
  updateRatioTotal();
}
function toggleDet(i){document.getElementById('rdet'+i).classList.toggle('open');}
function updateRatioTotal(){
  let sum=0;
  ratioData.forEach((_,i)=>{if(document.getElementById('rc'+i).checked)sum+=parseInt(document.getElementById('rp'+i).value)||0;});
  const el=document.getElementById('ratioTot');
  el.textContent='合計 '+sum+'%'+(sum===100?' ✓':' (需達100%)');
  el.className='rtot '+(sum===100?'ok':'warn');
}
buildRatios();

function getRatioSummary(){
  const parts=[];
  ratioData.forEach((r,i)=>{
    if(document.getElementById('rc'+i).checked){
      const pct=parseInt(document.getElementById('rp'+i).value)||0;
      const selTags=[...document.getElementById('rdet'+i).querySelectorAll('.rmtag.sel')].map(s=>s.textContent);
      parts.push(r.name+'('+pct+'%): '+selTags.slice(0,5).join('、'));
    }
  });
  return parts.join('\n');
}

function getApiKey(){
  let k=localStorage.getItem('ant_k');
  if(!k){k=prompt('請輸入 Anthropic API Key（sk-ant-api03-…）\n（只需輸入一次，將儲存於本機）');if(k&&k.trim())localStorage.setItem('ant_k',k.trim());}
  return(k||'').trim();
}

// Analyze
async function doAnalyze(){
  const key=getApiKey();
  if(!key){document.getElementById('p3err').textContent='未設定 API Key';return;}
  document.getElementById('p3err').textContent='';
  document.getElementById('p3hint').style.display='none';
  const priceMin=document.getElementById('priceMin').value;
  const priceMax=document.getElementById('priceMax').value;
  const pricePing=document.getElementById('pricePing').value;
  const loc=selLoc?selLoc.name+'（'+selLoc.lat.toFixed(3)+','+selLoc.lng.toFixed(3)+'）':'（未設定）';
  const ratios=getRatioSummary();
  const card=document.getElementById('anaCard');card.style.display='block';
  const spin=document.getElementById('anaSpin');spin.innerHTML='<span class="spin"></span>';
  document.getElementById('anaTxt').textContent='分析中…';
  const priceDesc=priceMin&&priceMax?priceMin+'萬—'+priceMax+'萬':pricePing?'單坪'+pricePing+'萬':'未提供';
  const sys='你是台灣房地產 Meta 廣告受眾策略師。根據建案資訊，用繁體中文條列分析最適受眾輪廓（5-8點），包含：目標客群職業與收入、生活型態特徵、投放建議、競爭重點。簡潔精準。';
  const user='建案總價：'+priceDesc+'\n地點：'+loc+'\n興趣配比：\n'+ratios;
  try{const r=await callClaude(key,sys,user,600);document.getElementById('anaTxt').textContent=r;}
  catch(e){document.getElementById('anaTxt').textContent='錯誤：'+e.message;}
  spin.innerHTML='';
}

// Generate
async function doGenerate(){
  const key=getApiKey();
  if(!key){document.getElementById('p3err').textContent='未設定 API Key';return;}
  document.getElementById('p3err').textContent='';
  document.getElementById('p3hint').style.display='none';
  const priceMin=document.getElementById('priceMin').value;
  const priceMax=document.getElementById('priceMax').value;
  const pricePing=document.getElementById('pricePing').value;
  const loc=selLoc?selLoc.name:'（未設定地點）';
  const lat=selLoc?selLoc.lat:24.15;
  const lng=selLoc?selLoc.lng:120.7;
  const ratios=getRatioSummary();
  const priceDesc=priceMin&&priceMax?priceMin+'萬—'+priceMax+'萬':pricePing?'單坪'+pricePing+'萬':'未提供';
  const card=document.getElementById('genCard');card.style.display='block';
  const spin=document.getElementById('genSpin');spin.innerHTML='<span class="spin"></span>';
  document.getElementById('genBody').innerHTML='<div class="empty">生成中…</div>';
  const sys='你是台灣房地產 Meta 廣告受眾策略師。根據建案資訊生成完整受眾包。請以此 JSON 格式回傳（只回傳 JSON，不要說明）：{"description":"受眾包描述2-3句","locations":[{"name":"地名","reason":"選擇原因15字內"},{"name":"...","reason":"..."},{"name":"...","reason":"..."}],"interests":["標籤1","標籤2",...共30個],"performance":{"rating":"優","score":85,"reason":"評估說明","cpc":"$15-$25"}}';
  const user='建案總價：'+priceDesc+'\n地點：'+loc+'（座標'+lat.toFixed(3)+','+lng.toFixed(3)+'）\n興趣配比：\n'+ratios;
  try{
    const raw=await callClaude(key,sys,user,1200);
    const m=raw.match(/\{[\s\S]*\}/);
    if(!m)throw new Error('無法解析回傳格式');
    renderGenResult(JSON.parse(m[0]));
  }catch(e){document.getElementById('genBody').innerHTML='<div class="empty" style="color:#b31412">錯誤：'+esc(e.message)+'</div>';}
  spin.innerHTML='';
}

function renderGenResult(d){
  const body=document.getElementById('genBody');body.innerHTML='';
  const desc=document.createElement('div');desc.className='gen-desc';desc.textContent=d.description||'';body.appendChild(desc);
  if(d.locations&&d.locations.length){
    const lhdr=document.createElement('div');lhdr.className='locs-hdr';lhdr.textContent='推薦地點（點擊可在地圖標記）';body.appendChild(lhdr);
    const locs=document.createElement('div');
    d.locations.forEach((loc,i)=>{
      const row=document.createElement('div');row.className='gen-loc';
      row.innerHTML='<span class="gen-loc-n">'+(i+1)+'</span><div><div class="gen-loc-name">'+esc(loc.name)+'</div><div class="gen-loc-why">'+esc(loc.reason)+'</div></div>';
      locs.appendChild(row);
    });
    body.appendChild(locs);
  }
  const ihdr=document.createElement('div');ihdr.className='locs-hdr';ihdr.style.marginTop='10px';ihdr.textContent='興趣標籤（點擊複製）';body.appendChild(ihdr);
  const grid=document.createElement('div');grid.className='gen-tg-grid';
  (d.interests||[]).forEach(t=>grid.appendChild(mkTag(t)));body.appendChild(grid);
  if(d.performance){
    const p=d.performance;const rMap={優:'good',可:'ok',差:'bad'};const cls=rMap[p.rating]||'ok';
    const box=document.createElement('div');box.className='perf-box '+cls;
    box.innerHTML='<div class="prat '+cls+'">'+(p.rating||'?')+'</div><div class="pbody"><div class="pscore">成效評估 '+(p.score||0)+'分</div><div class="preason">'+esc(p.reason||'')+'</div><div class="pcpc">預估 CPC：'+esc(p.cpc||'')+'</div></div>';
    body.appendChild(box);
  }
}

// AI Pick Ratios
async function aiPickRatios(){
  const key=getApiKey();
  if(!key){document.getElementById('p3err').textContent='未設定 API Key';return;}
  const priceMin=document.getElementById('priceMin').value;
  const priceMax=document.getElementById('priceMax').value;
  const pricePing=document.getElementById('pricePing').value;
  const loc=selLoc?selLoc.name:'台灣中部';
  const priceDesc=priceMin&&priceMax?priceMin+'萬—'+priceMax+'萬':pricePing?'單坪'+pricePing+'萬':'未提供';
  const sys='你是 Meta 廣告受眾策略師，根據建案資訊建議各興趣類別比例。只回傳 JSON，格式：{"rich":20,"re":30,"youth":15,"tech":20,"gov":15}，5個值加總必須等於100。不要說明。';
  const user='建案總價：'+priceDesc+'\n地點：'+loc;
  try{
    const raw=await callClaude(key,sys,user,200);
    const m=raw.match(/\{[^}]+\}/);if(!m)return;
    const d=JSON.parse(m[0]);
    ratioData.forEach((_,i)=>{
      const k2=ratioData[i].id;
      if(d[k2]!==undefined){document.getElementById('rp'+i).value=d[k2];document.getElementById('rc'+i).checked=d[k2]>0;}
    });
    updateRatioTotal();
  }catch(e){document.getElementById('p3err').textContent='AI選取失敗：'+e.message;}
}

// Claude API
async function callClaude(key,sys,user,maxTok){
  const r=await fetch('https://api.anthropic.com/v1/messages',{
    method:'POST',
    headers:{'Content-Type':'application/json','x-api-key':key,'anthropic-version':'2023-06-01','anthropic-dangerous-direct-browser-access':'true'},
    body:JSON.stringify({model:'claude-haiku-4-5-20251001',max_tokens:maxTok,system:sys,messages:[{role:'user',content:user}]})
  });
  if(!r.ok){const e=await r.json().catch(()=>({}));throw new Error(e.error?.message||'HTTP '+r.status);}
  const d=await r.json();return d.content?.[0]?.text||'';
}

// Tabs
document.querySelectorAll('.tab').forEach(tab=>{
  tab.addEventListener('click',()=>{
    document.querySelectorAll('.tab').forEach(t=>t.classList.remove('active'));
    document.querySelectorAll('.page').forEach(p=>p.classList.remove('active'));
    tab.classList.add('active');
    document.getElementById('page-'+tab.dataset.page).classList.add('active');
    if(tab.dataset.page==='ai')setTimeout(initMap,50);
    if(tab.dataset.page==='gen')setTimeout(initGenMap,50);
  });
});
function randomInterests(){
  var cats=Object.keys(TAGS).filter(function(k){return k.indexOf("pin_")<0&&TAGS[k]&&TAGS[k].length>=5;});
  for(var i=cats.length-1;i>0;i--){var j=Math.floor(Math.random()*(i+1));var t=cats[i];cats[i]=cats[j];cats[j]=t;}
  var pick=cats.slice(0,20);
  var main=document.getElementById("p1main");
  main.innerHTML="";
  pick.forEach(function(cat){
    var pool=TAGS[cat].slice();
    for(var i=pool.length-1;i>0;i--){var j=Math.floor(Math.random()*(i+1));var t=pool[i];pool[i]=pool[j];pool[j]=t;}
    var sel=pool.slice(0,10);
    var blk=document.createElement("div");blk.className="cat-blk";
    var ttl=document.createElement("div");ttl.className="cat-ttl";
    ttl.innerHTML=(CATNAMES[cat]||cat)+"<span class=\cat-cnt\>"+sel.length+"</span>";
    var grid=document.createElement("div");grid.className="tag-grid";
    sel.forEach(function(t){grid.appendChild(mkTag(t,cat));});
    blk.appendChild(ttl);blk.appendChild(grid);main.appendChild(blk);
  });
  var info=document.getElementById("randomInfo");
  if(info)info.textContent="已隨機顯示 "+pick.length+" 類各 10 個標籤";
  document.getElementById("catSel").value="";
}
function cp(el){ct(el.querySelector('[data-cp]').getAttribute('data-cp'))}
function ct(text){
  const done=()=>{const t=document.getElementById('toast');t.textContent='已複製 → '+text;t.classList.add('on');clearTimeout(t._x);t._x=setTimeout(()=>t.classList.remove('on'),2000)};
  if(navigator.clipboard){navigator.clipboard.writeText(text).then(done).catch(()=>fb(text,done))}else{fb(text,done)}
}
function fb(text,cb){const a=document.createElement('textarea');a.value=text;a.style.cssText='position:fixed;opacity:0';document.body.appendChild(a);a.focus();a.select();try{document.execCommand('copy')}catch(e){}document.body.removeChild(a);cb()}
const TW={
'台北市':['中正','大同','中山','松山','大安','萬華','信義','士林','北投','內湖','南港','文山','內湖科技園區','南港軟體園區'],
'新北市':['板橋','三重','中和','永和','新莊','新店','土城','蘆洲','樹林','淡水','汐止','三峽','鶯歌','林口工業區','新北產業園區','安坑工業區'],
'桃園市':['桃園','中壢','大溪','楊梅','蘆竹','大園','龜山','八德','龍潭','平鎮','桃園航空城','中壢工業區','桃園工業區','龍潭科技園區','楊梅工業區'],
'台中市':['中區','東區','南區','西區','北區','北屯','西屯','南屯','太平','大里','霧峰','烏日','豐原','潭子','大雅','神岡','沙鹿','龍井','梧棲','清水','大甲','中科園區','豐洲科技工業園區','后里科技工業園區','梧棲工業區','台中工業區'],
'台南市':['中西','東','南','北','安平','安南','永康','歸仁','新化','仁德','新營','麻豆','佳里','善化','南科園區','台南科技工業區','安平工業區','永康工業區'],
'高雄市':['新興','前金','苓雅','鹽埕','鼓山','旗津','前鎮','三民','楠梓','小港','左營','仁武','岡山','鳳山','大寮','林園','旗山','美濃','路竹科技工業區','仁武工業區','大發工業區','臨海工業區','岡山工業區'],
'基隆市':['仁愛','信義','中山','中正','七堵','暖暖','安樂','基隆工業區'],
'新竹市':['東','北','香山','竹科（新竹科學工業園區）'],
'新竹縣':['竹北','竹東','新埔','關西','湖口','新豐','湖口工業區','台元科技園區'],
'苗栗縣':['苗栗','頭份','竹南','通霄','苑裡','竹南科技工業區','頭份工業區'],
'彰化縣':['彰化','員林','和美','鹿港','溪湖','彰化工業區','全興工業區','彰濱工業區'],
'南投縣':['南投','草屯','埔里','集集','竹山','南投工業區'],
'雲林縣':['斗六','斗南','虎尾','西螺','雲林科技工業區','六輕麥寮工業區'],
'嘉義市':['東','西'],
'嘉義縣':['太保','朴子','大林','民雄','嘉義科學工業園區','嘉義工業區'],
'屏東縣':['屏東','潮州','東港','恆春','屏東科技工業區','農業生技園區'],
'宜蘭縣':['宜蘭','羅東','蘇澳','頭城','礁溪','利澤工業區'],
'花蓮縣':['花蓮','鳳林','玉里','吉安','花蓮工業區'],
'台東縣':['台東','成功','關山','台東工業區']};
const POI={'信義':['台北101','新光三越信義A8/A11','微風廣場'],'大安':['忠孝SOGO','東區商圈','頂好超市'],'中山':['晶華酒店商圈','新光三越中山'],'士林':['故宮博物院','士林夜市'],'北投':['北投溫泉區','新北投捷運站'],'內湖':['IKEA內湖','大潤發內湖'],'南港':['南港展覽館','南港車站'],'文山':['貓空纜車','政大商圈'],'內湖科技園區':['內湖科技園區管理中心','台灣大哥大總部','緯創資通'],'南港軟體園區':['南港軟體工業園區','中研院','南港展覽館2館'],'板橋':['板橋大遠百','環球購物中心'],'新店':['裕隆城購物中心','碧潭'],'淡水':['淡水老街','漁人碼頭'],'三重':['好市多三重','三重商圈'],'林口工業區':['林口工業區','林口三井outlet'],'安坑工業區':['安坑工業區','新店大豐路商圈'],'桃園航空城':['桃園國際機場','諾富特機場酒店'],'中壢工業區':['中壢工業區','中壢SOGO'],'桃園工業區':['桃園工業區','桃園高鐵站'],'龍潭科技園區':['龍潭科技園區','龍潭大池'],'南屯':['好市多南屯','廣三SOGO','文心森林公園'],'西屯':['逢甲夜市','台中歌劇院','大遠百台中'],'北屯':['新天地購物中心','北屯路商圈'],'太平':['長億商圈','太平大買家'],'烏日':['台中高鐵站','好市多烏日'],'豐原':['廟東夜市','豐原火車站'],'大里':['大里大買家','大里藝術館'],'霧峰':['亞洲大學現代美術館','霧峰農會酒莊'],'中科園區':['中科管理局','聯詠科技台中廠','台積電中科廠'],'豐洲科技工業園區':['豐洲科技工業園區','全球第三大TFT-LCD聚落'],'后里科技工業園區':['后里科技工業園區','后里馬場'],'梧棲工業區':['梧棲工業區','台中港'],'台中工業區':['台中工業區','大里都心商圈'],'南科園區':['台積電南科廠','南科管理局','奇美博物館'],'台南科技工業區':['台南科技工業區','台南高鐵站'],'中西':['赤崁樓','台南孔廟商圈','花園夜市'],'永康':['台南高鐵站','家樂福永康'],'安平':['安平老街','夕遊出張所'],'路竹科技工業區':['路竹科技工業區','橋頭糖廠'],'仁武工業區':['仁武工業區','澄清湖'],'大發工業區':['大發工業區','大寮棒球場'],'臨海工業區':['臨海工業區','高雄港'],'岡山工業區':['岡山工業區','岡山眷村博物館'],'苓雅':['夢時代購物中心','瑞豐夜市'],'前鎮':['高雄展覽館','好市多前鎮'],'左營':['漢神巨蛋','高雄高鐵站','蓮池潭'],'鳳山':['衛武營藝術文化中心','大東文化藝術中心'],'楠梓':['好市多楠梓','統一夢時代楠梓'],'竹科（新竹科學工業園區）':['台積電竹科總部','聯發科技','工研院'],'台元科技園區':['台元科技園區','竹北高鐵站'],'湖口工業區':['湖口工業區','湖口老街'],'竹南科技工業區':['竹南科技工業區','頭份交流道'],'彰濱工業區':['彰濱工業區','鹿港老街'],'彰化工業區':['彰化工業區','彰化火車站'],'雲林科技工業區':['雲林科技工業區','雲林斗六夜市'],'六輕麥寮工業區':['台塑麥寮六輕','麥寮港'],'嘉義科學工業園區':['嘉義科學工業園區','嘉義高鐵站'],'屏東科技工業區':['屏東科技工業區','屏東夜市'],'利澤工業區':['利澤工業區','羅東夜市'],'竹北':['竹北高鐵站','家樂福竹北'],'中壢':['中壢SOGO','老街溪河廊'],'桃園':['桃園高鐵站','桃園展演中心']};
function updCity(){
  const city=document.getElementById('gr-city').value;
  const dw=document.getElementById('dist-wrap');
  if(!city||!TW[city]){dw.innerHTML='<span style="font-size:12px;color:var(--sub)">請先選擇縣市</span>';updPOI();return;}
  dw.innerHTML=TW[city].map(d=>'<input type="checkbox" class="dist-cb" id="dc-'+d+'" value="'+d+'" onchange="updPOI()"><label class="dist-lbl" for="dc-'+d+'">'+d+'</label>').join('');
  updPOI();
}
function updPOI(){
  const dists=[...document.querySelectorAll('.dist-cb:checked')].map(c=>c.value);
  let pois=[];dists.forEach(d=>{if(POI[d])pois=pois.concat(POI[d])});
  const el=document.getElementById('gr-poi');
  if(pois.length){el.style.display='block';el.innerHTML='<b>AI推薦地標：</b>'+pois.join('、')+'<span style="font-size:10px;color:var(--sub);margin-left:6px">（可加入受眾包地點欄位）</span>';}
  else el.style.display='none';
}
function addGrRow(){
  const cats=[
    {v:'__auto',l:'不指定（AI智能分配）'},
    {v:'',l:'─────────',d:true},
    {v:'__hidden',l:'隱藏興趣（全部）'},{v:'__hidden_family',l:'隱藏 - 親子/家庭'},{v:'__hidden_outdoor',l:'隱藏 - 戶外/休閒'},
    {v:'__hidden_food',l:'隱藏 - 美食/生活'},{v:'__hidden_biz',l:'隱藏 - 職場/商務'},{v:'__hidden_fashion',l:'隱藏 - 時尚/美妝'},{v:'__hidden_travel',l:'隱藏 - 旅遊/風格'},
    {v:'__rich',l:'有錢興趣'},{v:'__young',l:'年輕興趣'},
    {v:'__re',l:'房地產興趣'},{v:'__tech',l:'科技業興趣'},{v:'__civil',l:'公務員興趣'},
    {v:'',l:'─────────',d:true},
    {v:'科技',l:'科技'},{v:'金融',l:'金融'},{v:'商業',l:'商業'},{v:'美食',l:'美食'},
    {v:'家居',l:'家居'},{v:'時尚美妝',l:'時尚美妝'},{v:'健康運動',l:'健康運動'},
    {v:'娛樂',l:'娛樂'},{v:'旅遊生活',l:'旅遊生活'},{v:'教育',l:'教育'},
    {v:'農業自然',l:'農業自然'},{v:'社會',l:'社會'},{v:'交通',l:'交通'},{v:'其他',l:'其他'},
    {v:'',l:'── 延伸興趣（未收錄）──',d:true},
    {v:'__xfin',l:'延伸・財務投資'},{v:'__xprop',l:'延伸・房產直接'},
    {v:'__xfam',l:'延伸・親子家庭'},{v:'__xhlt',l:'延伸・健康運動'},
    {v:'__xtech',l:'延伸・科技職場'},{v:'__xcar',l:'延伸・汽車交通'},
    {v:'__xtrip',l:'延伸・旅遊度假'},{v:'__xfood',l:'延伸・美食生活'},
    {v:'__xlux',l:'延伸・精品奢華'},{v:'__xbiz',l:'延伸・職場創業'}
  ];
  const id='r'+Date.now();
  const div=document.createElement('div');
  div.className='gr-row';div.id=id;
  div.innerHTML='<select class="gr-cat"><option value="">選擇分類</option>'+cats.map(c=>c.d?'<option disabled>'+c.l+'</option>':'<option value="'+c.v+'">'+c.l+'</option>').join('')+'</select><input class="gr-pct" type="number" min="1" max="100" placeholder="0" oninput="updTotal()"><span style="font-size:12px;color:var(--sub);flex-shrink:0">%</span><button class="gr-del" onclick="this.closest(\'.gr-row\').remove();updTotal()">×</button>';
  document.getElementById('gr-rows').appendChild(div);
  updTotal();
}
function updTotal(){
  const rows=[...document.querySelectorAll('#gr-rows .gr-pct')];
  const total=rows.reduce((s,i)=>s+(parseInt(i.value)||0),0);
  const hasAuto=[...document.querySelectorAll('#gr-rows .gr-cat')].some(s=>s.value==='__auto');
  const el=document.getElementById('gr-total');
  if(total>100){
    const over=total-100;
    el.textContent='超出 '+over+'%（請減少各項百分比，合計不得超過 100%）';
    el.className='gr-total over';
  } else if(total===100){
    el.textContent='已設定 100% ✓（所有標籤由您指定分類）';
    el.className='gr-total ok';
  } else if(hasAuto){
    const remain=100-total;
    el.textContent='已設定 '+total+'% ｜ 剩餘 '+remain+'%（AI智能補充）';
    el.className='gr-total ok';
  } else {
    el.textContent='合計：'+total+'%'+(total===0?'（請輸入百分比）':'');
    el.className='gr-total';
  }
}
function cpAll(btn){
  const tags=btn.closest('.pkg').dataset.tags.split('||').join(', ');
  ct(tags);
}
const hiddenSub={
  family:['Household','LifeStyle Home','Motherhood','Parenting','Family travel','Kids activities','Cultural','Kitchen appliances','Design studios','House work','HVAC','Cabinetry','Garden furniture','Gazebo','Tiny House Movement','KitchenAid','Home and garden'],
  outdoor:['Recreational fishing','Extreme sports','Team sports','Fitness professional','Trails','Birdwatching','Outdoor living','Hiking equipment','Top Gear','Family car','Enterprise Rent-A-Car','Rural','Longlining','Semi-truck','Forklift'],
  food:['Foodie','Healthy cooking','Local events','KIND Healthy Snacks','Food trucks','Tea leaf','Control system','Foodservice','LifeStyle Food','Healthy','Nutritional supplements','BACK','Nutrition','Protein','Healthy recipes','FineDiningLovers'],
  biz:['Payment service provider','Employee engagement','Medical Sales Representative','Freight transport','Customer support','Trade shows','Lending','Foreign company'],
  fashion:['Weekend','Fragrance oil','HydraFacial','Fashion Tech','Jewelry','Collectible','Digital media','Boutique'],
  travel:['Lifestyle brand','Lifestyle Travel','Lifestyle content','Weekend Trips','Christmas Holiday','Self-guided tour','Brunch','Happy hour','Skyscanner','Cheapflights','Video game culture']
};
var _xCatIdx={__xfin:0,__xprop:1,__xfam:2,__xhlt:3,__xtech:4,__xcar:5,__xtrip:6,__xfood:7,__xlux:8,__xbiz:9};
function spPool(cat,used){
  const spMap={__rich:'rich',__young:'young',__hidden:'hidden',__re:'re',__tech:'tech',__civil:'civil'};
  if(spMap[cat])return D.filter(d=>d.sp===spMap[cat]&&!used.has(d.cp));
  if(cat.startsWith('__hidden_')){
    const sub=cat.replace('__hidden_','');
    const list=hiddenSub[sub]||[];
    return D.filter(d=>d.sp==='hidden'&&list.includes(d.cp)&&!used.has(d.cp));
  }
  if(cat in _xCatIdx){
    var g=EXTRA_TAGS[_xCatIdx[cat]];
    if(!g)return[];
    return g.tags.filter(function(t){return!used.has(t.en);}).map(function(t){return{cp:t.en,sc:5,sp:'',c:cat};});
  }
  // For plain category pools: sort tags that have any sp value before plain tags
  // (sp-tagged items are hand-curated "special" entries within a category and rank higher)
  return D.filter(d=>d.c===cat&&!used.has(d.cp)).sort((a,b)=>(b.sp?1:0)-(a.sp?1:0)||a.cp.localeCompare(b.cp));
}
let _map=null,_marker=null;
// geoDist: Haversine geodesic distance in km between two lat/lng points
function geoDist(a,b,c,d){const R=6371,dLat=(c-a)*Math.PI/180,dLon=(d-b)*Math.PI/180,x=Math.sin(dLat/2)**2+Math.cos(a*Math.PI/180)*Math.cos(c*Math.PI/180)*Math.sin(dLon/2)**2;return R*2*Math.atan2(Math.sqrt(x),Math.sqrt(1-x));}
function detectAreaType(lat,lng){
  const tech=[
    {lat:24.79,lng:121.0,r:4,name:'新竹科學園區'},{lat:24.12,lng:120.67,r:5,name:'中部科學園區'},
    {lat:23.15,lng:120.34,r:5,name:'台南科學園區'},{lat:22.82,lng:120.42,r:5,name:'南部科學園區'},
    {lat:25.04,lng:121.62,r:2.5,name:'南港/內湖科技園區'},{lat:25.08,lng:121.58,r:2,name:'內湖科技園區'},
    {lat:24.96,lng:121.22,r:4,name:'桃園航空城/科技'}
  ];
  const luxury=[
    {lat:25.033,lng:121.565,r:1.8,name:'台北信義區'},{lat:25.026,lng:121.543,r:2,name:'台北大安區'},
    {lat:25.047,lng:121.529,r:1.5,name:'台北中山區'},{lat:24.155,lng:120.685,r:2,name:'台中七期重劃區'},
    {lat:22.616,lng:120.305,r:2,name:'高雄左營/鼓山'},{lat:22.996,lng:120.212,r:2,name:'台南安平/新市政'}
  ];
  for(const p of tech){if(geoDist(lat,lng,p.lat,p.lng)<p.r)return{type:'tech',name:p.name};}
  for(const z of luxury){if(geoDist(lat,lng,z.lat,z.lng)<z.r)return{type:'luxury',name:z.name};}
  if(lng>121.5&&lat>22.5&&lat<25)return{type:'resort',name:'東部/度假地帶'};
  if(lat<22.5)return{type:'resort',name:'南台灣/觀光地帶'};
  return{type:'general',name:''};
}
function initGenMap(){
  if(_map){_map.invalidateSize();return;}
  const el=document.getElementById('gr-map');
  if(!el||typeof L==='undefined')return;
  _map=L.map('gr-map').setView([23.97,120.97],7);
  window._map=_map;
  L.tileLayer('https://{s}.tile.openstreetmap.org/{z}/{x}/{y}.png',{attribution:'© OpenStreetMap',maxZoom:18}).addTo(_map);
  _map.on('click',function(e){
    const lat=e.latlng.lat,lng=e.latlng.lng;
    if(_marker)_marker.remove();
    _marker=L.marker([lat,lng]).addTo(_map);
    revGeocode(lat,lng);
  });
}
function searchAddr(){
  const q=document.getElementById('map-addr').value.trim();
  if(!q)return;
  const info=document.getElementById('map-info');
  if(info){info.style.display='block';info.textContent='搜尋中...';}
  fetch('https://nominatim.openstreetmap.org/search?q='+encodeURIComponent(q)+'&countrycodes=tw&format=json&limit=1')
    .then(r=>r.json()).then(function(data){
      if(!data||!data.length){if(info)info.textContent='找不到地址，請輸入更完整的地址';return;}
      const lat=parseFloat(data[0].lat),lng=parseFloat(data[0].lon);
      if(!_map)initGenMap();
      _map.setView([lat,lng],14);
      if(_marker)_marker.remove();
      _marker=L.marker([lat,lng]).addTo(_map);
      revGeocode(lat,lng);
    }).catch(function(){if(info)info.textContent='定位失敗，請稍後再試';});
}
function revGeocode(lat,lng){
  const info=document.getElementById('map-info');
  if(info){info.style.display='block';info.textContent='定位中...';}
  const ar=detectAreaType(lat,lng);
  window.mapAreaType=ar.type;window.mapAreaName=ar.name;
  fetch('https://nominatim.openstreetmap.org/reverse?lat='+lat+'&lon='+lng+'&format=json&accept-language=zh-TW')
    .then(r=>r.json()).then(function(data){
      const a=data.address||{};
      const cityRaw=a.city||a.county||a.state_district||'';
      const dist=a.suburb||a.district||a.town||a.village||'';
      const cityMap={'台北':'台北市','臺北':'台北市','新北':'新北市','桃園':'桃園市','台中':'台中市','臺中':'台中市',
        '台南':'台南市','臺南':'台南市','高雄':'高雄市','基隆':'基隆市','新竹市':'新竹市','新竹縣':'新竹縣',
        '苗栗':'苗栗縣','彰化':'彰化縣','南投':'南投縣','雲林':'雲林縣','嘉義市':'嘉義市','嘉義縣':'嘉義縣',
        '屏東':'屏東縣','宜蘭':'宜蘭縣','花蓮':'花蓮縣','台東':'台東縣','臺東':'台東縣'};
      let matched='';
      for(const k in cityMap){if(cityRaw.includes(k)){matched=cityMap[k];break;}}
      const sel=document.getElementById('gr-city');
      if(sel&&matched){
        for(const o of sel.options){if(o.text===matched){sel.value=o.value;updCity();break;}}
      }
      window.mapLocKey=(dist||cityRaw||'');
      showLejuPanel(matched||cityRaw,dist);
      var distKey=(dist||'').replace(/[區市鄉鎮村]$/,'');
      window.mapDistKey=distKey;
      window.mapCityKey=matched||cityRaw||'';
      showLejuBldgPanel(distKey,computeUserUnitPrice());
      showRealPricePanel(distKey,window.mapCityKey);
      let areaLabel={tech:'科技/園區地帶',luxury:'精華豪宅地帶',resort:'度假/觀光地帶',general:''}[ar.type]||'';
      let txt=(cityRaw||'未知')+(dist?' '+dist:'');
      if(ar.name)txt+=' ｜ '+ar.name;
      if(areaLabel)txt+='（'+areaLabel+'）';
      if(info)info.textContent=txt;
      if(_marker)_marker.bindPopup('<b>'+txt+'</b>').openPopup();
    }).catch(function(){if(info)info.textContent='無法取得地址（地區類型已偵測）';});
}
function togglePtype(){
  const t=document.querySelector('input[name="ptype"]:checked').value;
  document.getElementById('price-total').style.display=t==='total'?'flex':'none';
  document.getElementById('price-unit').style.display=t==='unit'?'flex':'none';
  updateCriteria();
}
function analyzeBuyer(){
  const priceType=document.querySelector('input[name="ptype"]:checked').value;
  const s1=parseFloat(document.getElementById('sz1').value)||0;
  const s2=parseFloat(document.getElementById('sz2').value)||s1;
  let totalAvg=0,unitAvg=0;
  if(priceType==='total'){
    const p1=parseFloat(document.getElementById('pt1').value)||0;
    const p2=parseFloat(document.getElementById('pt2').value)||p1;
    totalAvg=(p1+p2)/2;
    if(s1+s2>0)unitAvg=totalAvg/((s1+s2)/2);
  } else {
    unitAvg=parseFloat(document.getElementById('pu1').value)||0;
    if(s1+s2>0)totalAvg=unitAvg*((s1+s2)/2);
  }
  const avgSize=(s1+s2)/2||0;
  return {totalAvg,unitAvg,avgSize,
    isLuxury:totalAvg>3000||unitAvg>100,
    isHighEnd:totalAvg>=1500||unitAvg>=60,
    isMid:totalAvg>=800||unitAvg>=30,
    isSmall:avgSize>0&&avgSize<25,
    isLarge:avgSize>50};
}
function getStrategies(p){
  if(p.isLuxury)return[
    {name:'頂奢豪宅買家',desc:'高淨值精品生活族群，豪宅主力客群，重視品牌地段象徵與奢華居住體驗',cats:[['__rich',45],['金融',25],['旅遊生活',20],['美食',10]]},
    {name:'資產配置投資客',desc:'財富管理意識強，視不動產為資產配置工具，追求保值與高流動性增值',cats:[['金融',40],['__rich',30],['商業',20],['__hidden_biz',10]]},
    {name:'頂奢品味換屋',desc:'追求生活質感的成熟換屋族，重視社區等級、精品周邊與私密性',cats:[['__rich',40],['娛樂',20],['旅遊生活',25],['時尚美妝',15]]}
  ];
  if(p.isHighEnd)return[
    {name:'中高資產換屋族',desc:'具換屋實力的熟齡買家，重視格局空間、優質學區與成熟生活機能',cats:[['家居',25],['健康運動',20],['金融',20],['旅遊生活',20],['教育',15]]},
    {name:'理財型投資買家',desc:'看重增值潛力與穩定租金收益，財務規劃意識強的理性置產族',cats:[['金融',35],['房地產興趣',25],['商業',20],['__hidden_biz',20]]},
    {name:'生活品味追求者',desc:'重視居住體驗與質感氛圍，對社區美食文化與周邊生活資源敏感',cats:[['旅遊生活',30],['美食',25],['娛樂',25],['時尚美妝',20]]}
  ];
  if(p.isMid)return[
    {name:'首購換屋家庭',desc:'計畫購屋的三口小家庭，重視學區機能、坪效規劃與社區安全',cats:[['教育',25],['家居',20],['旅遊生活',20],['健康運動',20],['__young',15]]},
    {name:'中價位投資客',desc:'以租養貸或資產增值為目標，關注投報率與地段租賃需求強度',cats:[['金融',35],['房地產興趣',30],['商業',20],['科技',15]]},
    {name:'生活感首購族',desc:'重視日常生活感的年輕買家，對周邊機能、交通便利與社群氣氛敏感',cats:[['旅遊生活',30],['美食',25],['__young',25],['娛樂',20]]}
  ];
  return[
    {name:'年輕首購主力',desc:'社會新鮮人或新婚族，強調捷運便利、低總價輕鬆入場與未來增值空間',cats:[['__young',35],['旅遊生活',25],['娛樂',20],['科技',20]]},
    {name:'小坪數投資族',desc:'以出租獲利為主，鎖定學區或工作機能強烈的精華地段小宅',cats:[['金融',40],['商業',30],['__hidden_biz',20],['科技',10]]},
    {name:'實用機能族群',desc:'注重CP值與日常生活便利，以機能完善、公設實用為首要考量',cats:[['美食',30],['健康運動',30],['旅遊生活',20],['教育',20]]}
  ];
}
// Keyword sets for real-estate buyer relevance scoring within each special category.
// Tags with direct purchase-intent language rank higher than tangentially-related ones.
const _richKw  =['Luxury','Premium','Wealth','Private','Exclusive','High-net-worth','Fine dining','Private bank','Asset management','Boutique hotel','First class','Hedge fund','Private equity','Certified Financial'];
const _youngKw =['TikTok','Instagram','Esport','Streaming','K-pop','Pop culture','Anime','Sneaker','Music festival','Social media','Cryptocurrency','Startup','NFT','Mobile app','Podcast'];
const _reKw    =['Real estate','Mortgage','Home buyer','Condominium','Townhouse','Residential','Renovation','Open house','Rental','Real estate developer'];
const _techKw  =['Software','DevOps','Machine learning','Artificial intelligence','Cloud','Cybersecurity','Open source','Programming','Data science','GitHub','Stack Overflow','Android'];
const _civilKw =['Retirement','Pension','Life insurance','Public service','Government','Civil service','Cultural tourism','Art exhibition','Continuing education','Non-profit'];
function _kwBonus(name,kwList){
  // Returns 0..2 — 1 point per keyword hit, capped at 2
  let hits=0;
  for(let i=0;i<kwList.length&&hits<2;i++){if(name.toLowerCase().includes(kwList[i].toLowerCase()))hits++;}
  return hits;
}
function scoreTag(d,cat){
  let base;
  if(cat==='__rich'&&d.sp==='rich'){base=10+_kwBonus(d.cp,_richKw);}
  else if(cat==='__young'&&d.sp==='young'){base=10+_kwBonus(d.cp,_youngKw);}
  else if(cat==='__hidden'&&d.sp==='hidden'){base=10;}
  else if((cat==='房地產興趣'||cat==='__re')&&d.sp==='re'){base=8+_kwBonus(d.cp,_reKw);}
  else if((cat==='科技'||cat==='__tech')&&d.sp==='tech'){base=8+_kwBonus(d.cp,_techKw);}
  else if(cat==='__civil'&&d.sp==='civil'){base=8+_kwBonus(d.cp,_civilKw);}
  else{
    const at=window.mapAreaType||'general';
    if(at==='tech'&&(d.sp==='tech'||d.c==='科技')){base=7;}
    else if(at==='luxury'&&d.sp==='rich'){base=7;}
    else if(at==='resort'&&(d.c==='旅遊生活'||d.c==='娛樂')){base=5;}
    else if(d.c===cat){
      const catKwMap={'房地產興趣':_reKw,'科技':_techKw,'金融':_richKw};
      const kw=catKwMap[cat];
      base=kw?2+_kwBonus(d.cp,kw):2;
    }else{base=1;}
  }
  const mCatMap={'__rich':'__rich','__young':'__family','__hidden':'__rich',
    '房地產興趣':'__re','__re':'__re','科技':'__tech','__tech':'__tech','__civil':'__civil'};
  const mCat=mCatMap[cat]||'__general';
  const unitPrice=window.lejuBldgPrice||computeUserUnitPrice()||55;
  return Math.round(base*getTagMultiplier(mCat,unitPrice,window.mapAreaType||'general'));
}
function matchExtraLocs(val){
  const parts=val.split(/[,，、\s]+/).map(s=>s.trim()).filter(Boolean);
  let pois=[];
  parts.forEach(function(d){
    if(POI[d]){pois=pois.concat(POI[d]);}
    else{Object.keys(POI).forEach(function(k){if(k.includes(d)||(d.length>=2&&k.startsWith(d)))pois=pois.concat(POI[k]);});}
  });
  return [...new Set(pois)];
}
function previewExtraLocs(){
  const val=(document.getElementById('extra-locs')||{}).value||'';
  const pois=matchExtraLocs(val);
  const el=document.getElementById('extra-poi-preview');
  if(!el)return;
  if(pois.length){el.style.display='block';el.innerHTML='<b>對應地標：</b>'+pois.join('、');}
  else el.style.display='none';
}
function getExtraPois(){return matchExtraLocs((document.getElementById('extra-locs')||{}).value||'');}
function genPkg(){
  const p=analyzeBuyer();
  const hasInput=document.getElementById('pt1').value||document.getElementById('pt2').value||document.getElementById('pu1').value||document.getElementById('sz1').value;
  if(!hasInput){alert('請填入價格或坪數條件，AI 才能分析買家輪廓');return;}

  // ── Validate user-defined interest rows before generating ──
  const rows=[...document.querySelectorAll('#gr-rows .gr-row')];
  let fixedCats=[],autoPct=0;
  rows.forEach(function(r){
    const cat=r.querySelector('.gr-cat').value;
    const pct=parseInt(r.querySelector('.gr-pct').value)||0;
    if(!cat||!pct)return;
    if(cat==='__auto')autoPct+=pct;
    else fixedCats.push([cat,pct]);
  });
  const useUserCats=fixedCats.length>0||autoPct>0;
  if(useUserCats){
    const totalPct=fixedCats.reduce((s,c)=>s+c[1],0)+autoPct;
    // Warn if percentage rows exist but all are zero
    if(totalPct===0&&rows.length>0){
      alert('您已新增分類列，但所有百分比均為 0%。\n請為每個分類輸入百分比，或刪除所有列讓 AI 自動分配。');return;
    }
    // Warn and stop if total exceeds 100%
    if(totalPct>100){
      alert('各項百分比合計為 '+totalPct+'%，超出 '+(totalPct-100)+'%。\n請調整各項百分比，合計不得超過 100%。');return;
    }
  }

  const city=document.getElementById('gr-city').value||'';
  const dists=[...document.querySelectorAll('.dist-cb:checked')].map(c=>c.value);
  let basePois=[];dists.forEach(d=>{if(POI[d])basePois=basePois.concat(POI[d])});
  // Auto-fill from city if no districts selected
  if(basePois.length===0&&city&&TW[city]){
    TW[city].forEach(d=>{if(POI[d])basePois=basePois.concat(POI[d]);});
  }
  const extraPois=getExtraPois();
  // Deduplicated combined pool: base first, then extra
  const allPois=[...new Set([...basePois,...extraPois])];

  const strategies=getStrategies(p);
  const out=document.getElementById('gr-out');
  const labels=['第1組','第2組','第3組'];
  const tier=p.isLuxury?'豪宅頂奢':p.isHighEnd?'中高價位':p.isMid?'中價位':'平價首購';
  const priceStr=p.totalAvg>0?'總價約'+Math.round(p.totalAvg)+'萬':(p.unitAvg>0?'單價約'+Math.round(p.unitAvg)+'萬/坪':'');
  const sizeStr=p.avgSize>0?'坪數約'+Math.round(p.avgSize)+'坪':'';
  const specStr=p.isLarge?'大坪數':p.isSmall?'小坪數':'';
  const areaType=window.mapAreaType||'general';
  const areaName=window.mapAreaName||'';
  const areaLabel={tech:'科技/園區地帶',luxury:'精華豪宅地帶',resort:'度假/觀光地帶'}[areaType]||'';
  const catMode=!useUserCats?'AI依案件等級自動分配興趣組合'
    :autoPct>0?'依您設定占比生成，其中 '+autoPct+'% 由 AI 智能補充（'+strategies[0].name+'策略）'
    :'依您設定的興趣占比生成，AI依價格優先排序標籤';
  const parts=[priceStr,sizeStr,specStr,tier+'案件'];
  if(areaName)parts.push(areaName+(areaLabel?' ('+areaLabel+')':''));
  // ── AI reasoning section ──
  // Part B: this-case evaluation
  const p1r=p.totalAvg>0?'總價 '+Math.round(p.totalAvg)+'萬':'';
  const p2r=p.unitAvg>0?'單價 '+Math.round(p.unitAvg)+'萬/坪':'';
  const priceEvid=(p1r&&p2r)?p1r+' ／ '+p2r:(p1r||p2r||'未輸入價格');
  const tierReason=p.isLuxury?priceEvid+' → 豪宅頂奢策略':p.isHighEnd?priceEvid+' → 中高價換屋策略':p.isMid?priceEvid+' → 中價位策略':priceEvid+' → 平價首購策略';
  const areaReason=areaType==='tech'?'偵測到科技園區 → 科技業標籤獲 +7 地區加成':areaType==='luxury'?'偵測到精華豪宅地帶 → 有錢興趣標籤獲 +7 地區加成':areaType==='resort'?'偵測到度假觀光地帶 → 旅遊娛樂標籤獲 +5 地區加成':'一般住宅地帶 → 無地區加成';
  const topScoreLabel=p.isLuxury?'有錢興趣標籤（12分）':p.isHighEnd?'有錢興趣 ／ 房地產直接標籤（10分）':p.isMid?'房地產直接標籤（10分）':'房地產直接標籤（8分）';
  const stratRows=strategies.map(function(s,i){return '<div style="margin-top:3px"><b>第'+(i+1)+'組 '+s.name+'</b>：'+s.cats.map(function(c){return c[0]+' '+c[1]+'%';}).join(' ／ ')+'</div>';}).join('');
  let html='<div class="ai-reason-box">';
  html+='<div class="ai-r-hd">建案分析<\/div>';
  html+='<div class="ai-r-row"><span class="ai-r-n">1</span><span>'+tierReason+'</span></div>';
  html+='<div class="ai-r-row"><span class="ai-r-n">2</span><span>地區：'+areaReason+'</span></div>';
  html+='<div class="ai-r-row"><span class="ai-r-n">3</span><span>最高優先標籤類型：'+topScoreLabel+'</span></div>';
  html+='<div class="ai-r-row"><span class="ai-r-n">4</span><span>生成策略：'+stratRows+'</span></div>';
  html+='</div>';
  html+='<div style="margin-bottom:14px;padding:12px 16px;background:var(--al);border:1px solid var(--ab);border-radius:10px;font-size:12px;color:var(--a)"><b>AI 分析：</b>'+parts.filter(Boolean).join(' ／ ')+'<br><span style="color:var(--sub)">'+catMode+'</span></div>';

  // ── Per-package deduplication: reset used Set each package ──
  // Rationale: using a single global `used` across 3 packages means packages 2 and 3
  // are forced to use progressively lower-quality tags, since the best tags were
  // consumed by package 1. Each package targets a different buyer persona, so
  // it is correct for each to independently select the highest-ranked tags for its
  // own category mix. Overlap across packages is acceptable (ads manager handles it).
  const allTagsCombined=new Set(); // tracks all tags ever used, for the summary stat
  let pkgSelections=[];

  for(let pkg=0;pkg<3;pkg++){
    const strat=strategies[pkg];
    // Each package starts with a clean deduplication slate
    const used=new Set();
    // Determine category list: user-fixed + AI填auto / 全AI / 全用戶
    let catList,catTotal;
    if(!useUserCats){catList=strat.cats;catTotal=100;}
    else if(autoPct===0){catList=fixedCats;catTotal=fixedCats.reduce((s,c)=>s+c[1],0)||100;}
    else{
      const fixedTotal=fixedCats.reduce((s,c)=>s+c[1],0);
      const aiBase=strat.cats.filter(c=>!fixedCats.find(f=>f[0]===c[0]));
      const aiBaseTotal=aiBase.reduce((s,c)=>s+c[1],0)||1;
      const aiScaled=aiBase.map(c=>[c[0],Math.round(c[1]/aiBaseTotal*autoPct)]).filter(c=>c[1]>0);
      catList=[...fixedCats,...aiScaled];
      catTotal=(fixedTotal+autoPct)||100;
    }
    const sel=[];
    catList.forEach(function(pair){
      const cat=pair[0],pct=pair[1];
      const n=Math.max(1,Math.round(30*pct/catTotal));
      const pool=spPool(cat,used);
      pool.sort(function(a,b){return scoreTag(b,cat)-scoreTag(a,cat)||a.cp.localeCompare(b.cp);});
      pool.slice(0,n).forEach(function(d){used.add(d.cp);sel.push(d);});
    });
    // Fill to 30 using top category
    if(sel.length<30){
      const fillCat=catList[0][0];
      spPool(fillCat,used).sort(function(a,b){return scoreTag(b,fillCat)-scoreTag(a,fillCat)||a.cp.localeCompare(b.cp);}).slice(0,30-sel.length).forEach(function(d){used.add(d.cp);sel.push(d);});
    }
    if(sel.length<30){
      D.filter(function(d){return !used.has(d.cp);}).sort(function(a,b){return a.cp.localeCompare(b.cp);}).slice(0,30-sel.length).forEach(function(d){used.add(d.cp);sel.push(d);});
    }
    const s30=sel.slice(0,30);
    s30.forEach(function(d){allTagsCombined.add(d.cp);});
    pkgSelections.push(s30);
  }

  // Summary stat: total unique tags across all 3 packages (after dedup)
  html+='<div style="margin-bottom:12px;padding:8px 14px;background:var(--goodl);border:1px solid var(--goodb);border-radius:8px;font-size:12px;color:var(--good);font-weight:600">已生成，共選出 '+allTagsCombined.size+' 個標籤</div>';

  for(let pkg=0;pkg<3;pkg++){
    const strat=strategies[pkg];
    const s30=pkgSelections[pkg];
    const tagIds=s30.map(function(d){return d.cp;}).join('||');
    const pkgPois=allPois.length?[0,1,2].map(function(i){return allPois[(pkg*3+i)%allPois.length];}).filter(function(v,i,a){return a.indexOf(v)===i;}).slice(0,Math.min(3,allPois.length)):[];
    // radii: display radius rings (km) for the up-to-3 POI pins in each package
    const radii=[2,3,5];
    const locHtml=pkgPois.length?'<div style="display:flex;flex-wrap:wrap;gap:4px;margin-bottom:8px">'+pkgPois.map(function(pp,i){return '<span style="font-size:11px;background:var(--al);color:var(--a);border:1px solid var(--ab);border-radius:10px;padding:2px 8px">'+pp+' +'+radii[i]+'公里</span>';}).join('')+'</div>':'';
    const tagsHtml=s30.map(function(d){
      const safe=d.cp.replace(/\\/g,'\\\\').replace(/'/g,"\\'");
      return '<div class="ptag" onclick="ct(\''+safe+'\')">'+d.cp+(d.z?'<span class="ptag-c">'+d.z+'</span>':'')+'</div>';
    }).join('');
    const perfHtml=calcPkgPerf(p,getAdType());
    html+='<div class="pkg" data-tags="'+tagIds.replace(/"/g,'&quot;')+'" style="margin-bottom:12px">';
    html+='<div class="gr-pkg-title"><div class="pbadge">'+labels[pkg]+'</div><span style="font-size:12px;font-weight:600;color:var(--tx)">'+strat.name+'</span><button class="cp-all" onclick="cpAll(this)">複製全部 ('+s30.length+')</button></div>';
    html+=locHtml;
    html+='<div style="font-size:11px;color:var(--sub);margin-bottom:8px;padding:6px 10px;background:var(--s2);border-radius:6px;line-height:1.55">'+strat.desc+'</div>';
    html+='<div class="ptags">'+tagsHtml+'</div>';
    html+=perfHtml;
    html+='</div>';
  }
  out.innerHTML=html;
  setTimeout(function(){out.scrollIntoView({behavior:'smooth',block:'start'});},50);
}
(function(){
  const LEJU_DATA={
    '台北市':[{dist:'大安',price:132},{dist:'南港',price:112},{dist:'信義',price:111},{dist:'松山',price:107},{dist:'大同',price:102},{dist:'中山',price:101},{dist:'士林',price:93},{dist:'文山',price:89},{dist:'萬華',price:85}],
    '新北市':[{dist:'永和',price:77},{dist:'板橋',price:73},{dist:'中和',price:69},{dist:'新店',price:68},{dist:'新莊',price:62},{dist:'林口',price:56},{dist:'淡水',price:35}],
    '桃園市':[{dist:'桃園',price:43}],
    '新竹市':[{dist:'新竹',price:47}],
    '台中市':[{dist:'台中',price:41}]
  };
  window.showLejuPanel=function(city,highlightDist){
    const anchor=document.getElementById('leju-panel-anchor');
    if(!anchor)return;
    const old=document.getElementById('leju-panel');if(old)old.remove();
    const rows=LEJU_DATA[city];
    if(!rows||!rows.length)return;
    const sorted=[...rows].sort(function(a,b){return b.price-a.price;});
    const maxPrice=sorted[0].price;
    const normHL=(highlightDist||'').replace(/[區市鄉鎮]$/,'');
    function isCur(d){return d.replace(/[區市鄉鎮]$/,'')=== normHL||d===highlightDist;}
    const rowsHtml=sorted.map(function(r){
      const cur=isCur(r.dist);
      const pct=Math.round(r.price/maxPrice*100);
      return '<div class="leju-row"><span class="leju-label'+(cur?' is-current':'')+'">'+r.dist+'<\/span><div class="leju-bar-track"><div class="leju-bar-fill'+(cur?' is-current':'')+'" style="width:'+pct+'%"><\/div><\/div><span class="leju-value'+(cur?' is-current':'')+'">'+r.price+'<\/span><\/div>';
    }).join('');
    const panel=document.createElement('div');
    panel.id='leju-panel';
    panel.style.cssText='padding:10px 11px 9px;background:var(--s2);border:1px solid var(--bd);border-radius:var(--radius-card);margin-bottom:12px';
    panel.innerHTML='<div class="leju-header"><span class="leju-title">地區行情參考<\/span><span class="leju-unit">萬／坪　近一年均價<\/span><\/div><div class="leju-rows">'+rowsHtml+'<\/div><div class="leju-source">資料來源：樂居 leju.com.tw<\/div>';
    anchor.appendChild(panel);
  };
})();
function getTagMultiplier(cat,unitPrice,areaType){
  const TIERS=[
    {min:130,max:Infinity,w:{__rich:3.0,__re:1.5,__tech:1.2,__civil:0.5,__family:0.8,__general:0.6}},
    {min:90,max:129,w:{__rich:2.2,__re:1.8,__tech:1.5,__civil:0.8,__family:1.0,__general:0.8}},
    {min:65,max:89,w:{__rich:1.4,__re:2.0,__tech:1.8,__civil:1.2,__family:1.5,__general:1.0}},
    {min:50,max:64,w:{__rich:0.8,__re:2.0,__tech:1.6,__civil:1.8,__family:2.0,__general:1.2}},
    {min:0,max:49,w:{__rich:0.5,__re:1.8,__tech:1.2,__civil:2.0,__family:2.5,__general:1.5}}
  ];
  const AREA={
    luxury:{__rich:1.3,__re:1.0,__tech:0.9,__civil:0.6,__family:0.8,__general:0.7},
    tech:{__rich:0.8,__re:1.1,__tech:1.6,__civil:0.9,__family:1.2,__general:1.0},
    resort:{__rich:0.9,__re:1.0,__tech:0.8,__civil:1.1,__family:1.3,__general:1.4},
    general:{__rich:1.0,__re:1.0,__tech:1.0,__civil:1.0,__family:1.0,__general:1.0}
  };
  const VALID=['__rich','__re','__tech','__civil','__family','__general'];
  if(VALID.indexOf(cat)<0)return 1.0;
  const ar=AREA[areaType]||AREA.general;
  const up=(typeof unitPrice==='number'&&unitPrice>0)?unitPrice:55;
  const tier=TIERS.find(function(t){return up>=t.min&&up<=t.max;});
  const base=tier?tier.w[cat]:1.0;
  const raw=base*(ar[cat]||1.0);
  return Math.round(Math.min(3.5,Math.max(0.3,raw))*100)/100;
}
var EXTRA_TAGS=[
  {cat:'財務投資',en:'Finance / Investment',tags:[
    {en:'Investment',zh:'投資'},{en:'Financial planning',zh:'財務規劃'},
    {en:'Stock market',zh:'股票市場'},{en:'Mutual fund',zh:'共同基金'},
    {en:'Retirement planning',zh:'退休規劃'},{en:'Wealth management',zh:'財富管理'},
    {en:'Personal finance',zh:'個人理財'},{en:'Asset management',zh:'資產管理'},
    {en:'Passive income',zh:'被動收入'},{en:'Portfolio management',zh:'投資組合管理'}
  ]},
  {cat:'房產直接',en:'Real Estate Direct',tags:[
    {en:'Real estate',zh:'房地產'},{en:'Mortgage loan',zh:'房屋貸款'},
    {en:'Home buying',zh:'購屋'},{en:'Property investment',zh:'不動產投資'},
    {en:'New construction',zh:'新成屋'},{en:'Real estate broker',zh:'房仲'},
    {en:'House hunting',zh:'找房'},{en:'Home ownership',zh:'置產'},
    {en:'Real estate developer',zh:'建商'},{en:'Interest rate',zh:'利率'}
  ]},
  {cat:'親子家庭',en:'Parenting & Family',tags:[
    {en:'Parenting',zh:'親子教養'},{en:'New parents',zh:'新手父母'},
    {en:'Infant',zh:'嬰幼兒'},{en:'Baby shower',zh:'迎嬰派對'},
    {en:'Child education',zh:'兒童教育'},{en:'Educational toys',zh:'益智玩具'},
    {en:'Kindergarten',zh:'幼稚園'},{en:'Primary school',zh:'小學'},
    {en:'Child development',zh:'兒童發展'},{en:'Baby products',zh:'嬰兒用品'}
  ]},
  {cat:'健康運動',en:'Health & Fitness',tags:[
    {en:'Health & fitness',zh:'健康健身'},{en:'Running',zh:'跑步'},
    {en:'Gym',zh:'健身房'},{en:'Yoga',zh:'瑜伽'},
    {en:'Cycling',zh:'騎單車'},{en:'Swimming',zh:'游泳'},
    {en:'Healthy eating',zh:'健康飲食'},{en:'Wellness',zh:'健康生活'},
    {en:'Organic food',zh:'有機食品'},{en:'Sports nutrition',zh:'運動營養'}
  ]},
  {cat:'科技職場',en:'Tech & Career',tags:[
    {en:'Software engineering',zh:'軟體工程'},{en:'Information technology',zh:'資訊科技'},
    {en:'Artificial intelligence',zh:'人工智慧'},{en:'Cloud computing',zh:'雲端運算'},
    {en:'Data science',zh:'資料科學'},{en:'Semiconductor',zh:'半導體'},
    {en:'Electronics engineering',zh:'電子工程'},{en:'Startup',zh:'新創公司'},
    {en:'Tech industry',zh:'科技業'},{en:'Science park',zh:'科學園區'}
  ]},
  {cat:'汽車交通',en:'Automotive',tags:[
    {en:'Automobile',zh:'汽車'},{en:'Car dealership',zh:'汽車經銷商'},
    {en:'Electric vehicle',zh:'電動車'},{en:'Luxury vehicle',zh:'豪華車'},
    {en:'Tesla',zh:'特斯拉'},{en:'BMW',zh:'寶馬'},
    {en:'Mercedes-Benz',zh:'賓士'},{en:'Toyota',zh:'豐田'},
    {en:'Hyundai',zh:'現代'},{en:'Car insurance',zh:'車險'}
  ]},
  {cat:'旅遊度假',en:'Travel & Leisure',tags:[
    {en:'Travel',zh:'旅遊'},{en:'International travel',zh:'國際旅行'},
    {en:'Hotel',zh:'飯店'},{en:'Resort',zh:'度假村'},
    {en:'Vacation',zh:'假期'},{en:'Airbnb',zh:'民宿'},
    {en:'Tourism',zh:'觀光'},{en:'Cruise',zh:'郵輪'},
    {en:'Backpacking',zh:'背包旅行'},{en:'Sightseeing',zh:'觀光景點'}
  ]},
  {cat:'美食生活',en:'Food & Dining',tags:[
    {en:'Restaurants',zh:'餐廳'},{en:'Fine dining',zh:'精緻餐飲'},
    {en:'Food delivery',zh:'外送服務'},{en:'Cooking',zh:'烹飪'},
    {en:'Gourmet food',zh:'美食'},{en:'Baking',zh:'烘焙'},
    {en:'Coffee',zh:'咖啡'},{en:'Wine',zh:'葡萄酒'},
    {en:'Foodie',zh:'美食愛好者'},{en:'Brunch',zh:'早午餐'}
  ]},
  {cat:'精品奢華',en:'Luxury & Fashion',tags:[
    {en:'Luxury goods',zh:'精品'},{en:'Designer handbags',zh:'名牌包'},
    {en:'Jewelry',zh:'珠寶'},{en:'Chanel',zh:'香奈兒'},
    {en:'Louis Vuitton',zh:'路易威登'},{en:'Hermès',zh:'愛馬仕'},
    {en:'Fashion',zh:'時尚'},{en:'Luxury watches',zh:'名錶'},
    {en:'High-end shopping',zh:'高端購物'},{en:'Premium lifestyle',zh:'頂級生活'}
  ]},
  {cat:'職場創業',en:'Business & Entrepreneurship',tags:[
    {en:'Entrepreneurship',zh:'創業'},{en:'Small business',zh:'小型企業'},
    {en:'Marketing',zh:'行銷'},{en:'Leadership',zh:'領導力'},
    {en:'Career development',zh:'職涯發展'},{en:'Business networking',zh:'商業社交'},
    {en:'MBA',zh:'企業管理碩士'},{en:'Executive',zh:'高階主管'},
    {en:'Management consulting',zh:'管理顧問'},{en:'Real estate agent',zh:'房仲業務'}
  ]}
];
var _xShown={};
var XTAG_SHOW=5;
var _dbTagSet=null;
function _getDbTagSet(){if(_dbTagSet)return _dbTagSet;_dbTagSet=new Set(D.map(function(d){return d.cp;}));return _dbTagSet;}
function _xPickRandom(gi){
  var g=EXTRA_TAGS[gi];if(!g)return[];
  var dbSet=_getDbTagSet();
  var arr=g.tags.filter(function(t){return!dbSet.has(t.en);}).slice();
  for(var i=arr.length-1;i>0;i--){var j=Math.floor(Math.random()*(i+1));var tmp=arr[i];arr[i]=arr[j];arr[j]=tmp;}
  return arr.slice(0,XTAG_SHOW);
}
function _buildXtagChips(gi){
  return (_xShown[gi]||[]).map(function(t){
    var en=t.en.replace(/'/g,'&#39;');
    return '<span class="xtag-chip" onclick="copyXtag(this,\''+en+'\')">'+
      '<span class="xtag-chip-en">'+t.en+'<\/span>'+
      '<span class="xtag-chip-zh">'+t.zh+'<\/span><\/span>';
  }).join('');
}
function shuffleXtags(gi){
  _xShown[gi]=_xPickRandom(gi);
  var chips=document.getElementById('xtag-chips-'+gi);
  var btn=document.getElementById('xtag-shuf-'+gi);
  if(chips)chips.innerHTML=_buildXtagChips(gi);
  if(btn){btn.style.transform='rotate(180deg)';setTimeout(function(){btn.style.transform='';},280);}
}
function shuffleAllXtags(){
  EXTRA_TAGS.forEach(function(g,gi){shuffleXtags(gi);});
}
function renderExtraTags(){
  var sec=document.getElementById('extra-tags-section');
  if(!sec)return;
  EXTRA_TAGS.forEach(function(g,gi){_xShown[gi]=_xPickRandom(gi);});
  var html='<div class="xtag-section">';
  html+='<div class="xtag-hd"><span class="xtag-hd-title">延伸興趣（未收錄標籤）　共 '+EXTRA_TAGS.length+' 類　點擊複製<\/span>';
  html+='<button class="xtag-shuffle-all" onclick="shuffleAllXtags()">🔄 全部刷新<\/button><\/div>';
  html+='<div class="xtag-grid">';
  EXTRA_TAGS.forEach(function(g,gi){
    html+='<div class="xtag-card">';
    html+='<div class="xtag-card-hd"><div><div class="xtag-card-cat">'+g.cat+'<\/div><div class="xtag-card-en">'+g.en+'<\/div><\/div>';
    html+='<button class="xtag-card-shuf" id="xtag-shuf-'+gi+'" onclick="shuffleXtags('+gi+')" title="換一批">🔄<\/button><\/div>';
    html+='<div class="xtag-chips" id="xtag-chips-'+gi+'">'+_buildXtagChips(gi)+'<\/div>';
    html+='<\/div>';
  });
  html+='<\/div><\/div>';
  sec.innerHTML=html;
}
function copyXtag(el,text){
  if(navigator.clipboard){
    navigator.clipboard.writeText(text).then(function(){
      el.classList.add('copied');
      setTimeout(function(){el.classList.remove('copied');},900);
    });
  }
}
var _bldgAreaMap={'大安':'luxury','信義':'luxury','中山':'luxury','南港':'tech',
  '竹北':'tech','新竹市':'tech','淡水':'resort'};
function clearBldg(){
  var addrBlock=document.getElementById('addr-search-block');
  if(addrBlock){addrBlock.style.opacity='';addrBlock.style.pointerEvents='';}
  var an=document.getElementById('bldg-analysis-anchor');if(an)an.innerHTML='';
  var rp=document.getElementById('real-price-anchor');if(rp)rp.innerHTML='';
}
function showBldgAnalysis(item){
  var anchor=document.getElementById('bldg-analysis-anchor');
  if(!anchor||!item||!item.price)return;
  var distKey=item.distKey||'';
  var prof=getBuyerProfile(item.price,distKey,window.mapAreaType||'general');
  var card=document.createElement('div');
  card.className='lbp-card';
  card.style.marginTop='10px';
  var h='<div class="lbp-header"><span class="lbp-title">建案分析<\/span><\/div>';
  h+='<table style="width:100%;font-size:11px;border-collapse:collapse;line-height:1.7">';
  h+='<tr><td style="color:var(--sub);width:68px;vertical-align:top">建案名稱<\/td><td style="font-weight:600;color:var(--tx)">'+item.name+'<\/td><\/tr>';
  h+='<tr><td style="color:var(--sub);vertical-align:top">地點<\/td><td style="color:var(--tx)">'+(item.dist||'')+(item.city?' ・ '+item.city:'')+'<\/td><\/tr>';
  h+='<tr><td style="color:var(--sub);vertical-align:top">均價<\/td><td style="font-weight:700;color:var(--a-dark)">'+item.price+' 萬\/坪<\/td><\/tr>';
  if(prof.relativeNote){
    h+='<tr><td style="color:var(--sub);vertical-align:top">地區比對<\/td><td style="color:var(--tx)">'+prof.relativeNote+'<\/td><\/tr>';
  }
  h+='<tr><td style="color:var(--sub);vertical-align:top">案件定位<\/td><td style="color:var(--tx)"><b>'+prof.tierLabel+'<\/b><\/td><\/tr>';
  h+='<tr><td style="color:var(--sub);vertical-align:top">主力客群<\/td><td style="color:var(--tx)">'+prof.buyers.join('、')+'<\/td><\/tr>';
  h+='<tr><td style="color:var(--sub);vertical-align:top">推薦標籤<\/td><td style="color:var(--tx)">'+prof.catFocus+'<\/td><\/tr>';
  h+='<\/table><div class="lbp-source">分析依據：樂居成交均價 + 地區比對<\/div>';
  card.innerHTML=h;
  anchor.innerHTML='';
  anchor.appendChild(card);
}
function computeUserUnitPrice(){
  var ptype=document.querySelector('input[name="ptype"]:checked');
  if(!ptype)return null;
  var t=ptype.value;
  var s1=parseFloat(document.getElementById('sz1').value)||0;
  var s2=parseFloat(document.getElementById('sz2').value)||s1;
  var avgSize=(s1+s2)/2;
  if(t==='unit'){
    var u=parseFloat(document.getElementById('pu1').value)||0;
    return u>0?u:null;
  }else{
    var p1=parseFloat(document.getElementById('pt1').value)||0;
    var p2=parseFloat(document.getElementById('pt2').value)||p1;
    var totalAvg=(p1+p2)/2;
    return (totalAvg>0&&avgSize>0)?totalAvg/avgSize:null;
  }
}
(function(){
  var BLDG={
    '林口':[
      {n:'原森TWIN TOWERS',p:77.6},{n:'家悅美',p:67.9},{n:'長虹天聚',p:65.0},
      {n:'太子苑',p:62.5},{n:'立陽頤興',p:57.9},{n:'玄泰ONE',p:52.0},
      {n:'夢想之都',p:48.6},{n:'築禾琢立',p:45.0},{n:'杜拜The Palm Island',p:41.2},{n:'世界首席',p:38.9}
    ],
    '新莊':[
      {n:'富都新玉',p:76.1},{n:'勝旺新',p:74.8},{n:'泰鼎自由之丘',p:72.5},
      {n:'青青雙橡園',p:71.3},{n:'豐隆昕誠',p:70.8},{n:'宏璟榮華',p:70.4},
      {n:'永陞聯合公園',p:68.2},{n:'國泰新莊園',p:65.4},{n:'宏福新莊',p:51.0}
    ],
    '板橋':[
      {n:'三輝白昀',p:120.8},{n:'嘉廷家傳',p:84.0},{n:'君麟',p:79.6},
      {n:'新美齊画世代',p:76.7},{n:'板橋璞園的家',p:76.5},{n:'民生新埔',p:76.1},
      {n:'板橋大廈',p:66.4},{n:'板橋世家',p:61.9},{n:'鎮板橋',p:49.5},{n:'大庭新城',p:49.2}
    ],
    '大安':[
      {n:'台北之星',p:215.0},{n:'吾雙',p:201.6},{n:'大陸耑岫',p:180.0},
      {n:'大安A+',p:164.2},{n:'大安傳家',p:147.7},{n:'大安薈館',p:132.4},
      {n:'大安國宅',p:96.5},{n:'大安捷運廣場',p:95.9},{n:'大安1景',p:89.6}
    ],
    '信義':[
      {n:'法意大樓',p:199.1},{n:'信義之星',p:168.9},{n:'璞園信義',p:160.7},
      {n:'吉祥如藝',p:139.9},{n:'信義香榭',p:110.5},{n:'鼎真麗澤',p:91.0},{n:'信義國際',p:84.2}
    ],
    '中山':[
      {n:'中山Q1',p:114.1},{n:'帝璽',p:113.2},{n:'中山居',p:107.1},
      {n:'品中山',p:104.8},{n:'中山隱',p:104.1},{n:'中山官邸',p:100.6},
      {n:'太子中山大樓',p:86.0},{n:'中山民權大樓',p:73.4},{n:'中山首府',p:65.7}
    ],
    '南港':[
      {n:'世界明珠',p:146.7},{n:'國泰SKY PARK',p:139.9},{n:'國協天玥',p:126.8},
      {n:'東方大境',p:121.2},{n:'擎天森林',p:109.1},{n:'昆陽園',p:108.5},
      {n:'蘋果廣場',p:94.0},{n:'東方大地',p:81.7},{n:'南港軟體園區2',p:73.3},{n:'南港花園社區',p:63.1}
    ],
    '桃園':[
      {n:'合眾MRT',p:52.0},{n:'百俊吾双',p:50.9},{n:'金龍皇璽',p:50.9},
      {n:'益騏新画峰',p:49.2},{n:'匯聚',p:49.1},{n:'昭揚縱橫',p:41.3},
      {n:'長榮富豪',p:28.3},{n:'青天花園',p:28.2}
    ],
    '新竹市':[
      {n:'新東京',p:75.1},{n:'沅朔曦月',p:59.3},{n:'昌益文清',p:57.7},
      {n:'科技之心',p:53.7},{n:'米樂第',p:52.9},{n:'鴻築MM21',p:46.1},
      {n:'綠光金澤',p:49.1},{n:'和風大樓',p:43.6},{n:'雲冠天下',p:30.3}
    ],
    '竹北':[
      {n:'昌益御邸',p:91.9},{n:'豐采520',p:88.1},{n:'坤山臻真',p:74.0},
      {n:'若山若餘山',p:69.1},{n:'高峰匯',p:62.8},{n:'禾子旺星光',p:61.9},
      {n:'竹北101',p:43.2},{n:'金洋微上',p:39.3},{n:'六家高鐵B區',p:30.7},{n:'竹北雄觀',p:21.9}
    ],
    '永和':[
      {n:'頂溪大苑',p:109.8},{n:'M PLUS',p:99.9},{n:'漢皇River Sky',p:91.6},
      {n:'詠和心',p:80.1},{n:'黃金時代',p:64.0},{n:'恆豐大樓',p:63.6},
      {n:'鉅陞永麗花園',p:61.5},{n:'漢寶臺大苑',p:55.6},{n:'永和路華廈',p:49.7},{n:'永和成功',p:40.0}
    ],
    '中和':[
      {n:'漢皇方圓',p:114.7},{n:'和御',p:80.1},{n:'大同新紀元',p:78.4},
      {n:'玖原君邸',p:78.3},{n:'冠德心禾匯',p:78.0},{n:'遠雄CASA',p:70.3},
      {n:'永邦恆美',p:57.3},{n:'中和路公寓',p:49.0},{n:'中和100',p:44.2}
    ],
    '新店':[
      {n:'寶安JR',p:96.1},{n:'江陵天喆',p:94.8},{n:'華固譽誠',p:94.4},
      {n:'波爾多',p:69.7},{n:'敦南之森',p:65.5},{n:'新店臺北人',p:64.9},
      {n:'現代君址',p:62.9},{n:'家瑞敦南花園',p:48.4}
    ],
    '淡水':[
      {n:'十得向陽',p:41.6},{n:'翰林苑上水',p:39.5},{n:'新海城',p:38.6},
      {n:'台北灣銀河',p:37.4},{n:'天藝',p:37.2},{n:'和光五明',p:35.5},
      {n:'上水',p:34.4},{n:'伊東市',p:34.1},{n:'台北灣四季之旅',p:29.6},{n:'淡水人',p:26.0}
    ]
  };
  var DIST_CENTER={
    '林口':{lat:25.079,lng:121.382,city:'新北市'},
    '新莊':{lat:25.041,lng:121.459,city:'新北市'},
    '板橋':{lat:25.012,lng:121.466,city:'新北市'},
    '大安':{lat:25.026,lng:121.543,city:'台北市'},
    '信義':{lat:25.033,lng:121.564,city:'台北市'},
    '中山':{lat:25.064,lng:121.524,city:'台北市'},
    '南港':{lat:25.054,lng:121.607,city:'台北市'},
    '桃園':{lat:24.993,lng:121.301,city:'桃園市'},
    '新竹市':{lat:24.803,lng:120.968,city:'新竹市'},
    '竹北':{lat:24.846,lng:121.014,city:'新竹縣'},
    '永和':{lat:25.013,lng:121.519,city:'新北市'},
    '中和':{lat:25.003,lng:121.500,city:'新北市'},
    '新店':{lat:24.972,lng:121.541,city:'新北市'},
    '淡水':{lat:25.168,lng:121.448,city:'新北市'}
  };
  window._BLDG=BLDG;
  window._DIST_CENTER=DIST_CENTER;
  var _bldgPins=[];
  var _bldgMode='chart';
  var _curDist=null;
  var _curPrice=null;
  function _clearPins(){
    _bldgPins.forEach(function(m){try{m.remove();}catch(e){}});
    _bldgPins=[];
  }
  function _pinPos(distKey,idx,total){
    var c=DIST_CENTER[distKey];
    if(!c)return null;
    var angle=(idx/Math.max(total,1))*Math.PI*2-Math.PI/2;
    var r=0.003+(idx%3)*0.002;
    return {lat:c.lat+r*Math.sin(angle),lng:c.lng+r*Math.cos(angle)};
  }
  function _renderChart(wrap,distKey,userPrice){
    var rows=BLDG[distKey];
    if(!rows||!rows.length)return;
    var sorted=rows.slice().sort(function(a,b){return b.p-a.p;});
    var maxP=sorted[0].p;
    var nearestIdx=-1,nearestDiff=Infinity;
    if(userPrice!=null){
      sorted.forEach(function(r,i){var d=Math.abs(r.p-userPrice);if(d<nearestDiff){nearestDiff=d;nearestIdx=i;}});
    }
    var refLabel=userPrice!=null?'<span class="lbp-refline-label">你的案件 '+Math.round(userPrice)+'萬\/坪<\/span>':'';
    var card=document.createElement('div');
    card.className='lbp-card';
    card.innerHTML='<div class="lbp-header"><span class="lbp-title">'+distKey+'　建案價格分布<\/span><span class="lbp-subtitle">萬\/坪・近一年成交<\/span>'+refLabel+'<button class="lbp-mode-btn" onclick="window._bldgToggle()">🗺 地圖<\/button><\/div><div class="lbp-chart"><\/div><div class="lbp-source">資料來源：樂居 leju.com.tw<\/div>';
    wrap.appendChild(card);
    var chart=card.querySelector('.lbp-chart');
    sorted.forEach(function(r,i){
      var row=document.createElement('div');
      row.className='lbp-row'+(i===nearestIdx?' lbp-row--nearest':'');
      var pct=Math.round(r.p/maxP*100);
      row.innerHTML='<div class="lbp-name">'+r.n+'<\/div><div class="lbp-track"><div class="lbp-bar" style="width:'+pct+'%"><\/div><\/div><div class="lbp-price">'+r.p+'萬<\/div>';
      chart.appendChild(row);
    });
  }
  function _renderMap(wrap,distKey,userPrice){
    _clearPins();
    var rows=BLDG[distKey];
    if(!rows||!rows.length)return;
    var sorted=rows.slice().sort(function(a,b){return b.p-a.p;});
    var maxP=sorted[0].p,minP=sorted[sorted.length-1].p;
    var card=document.createElement('div');
    card.className='lbp-card';
    card.innerHTML='<div class="lbp-header"><span class="lbp-title">'+distKey+'　建案價格地圖<\/span><span class="lbp-subtitle">萬\/坪・近一年成交<\/span><button class="lbp-mode-btn" onclick="window._bldgToggle()">📊 圖表<\/button><\/div><div class="lbp-source" style="margin-top:2px">點選價格標籤查看建案名稱　資料：樂居<\/div>';
    wrap.appendChild(card);
    var m=window._map;
    if(!m)return;
    var ctr=DIST_CENTER[distKey];
    if(ctr)m.setView([ctr.lat,ctr.lng],14);
    var nearestPrice=null;
    if(userPrice!=null){
      nearestPrice=sorted.reduce(function(b,r){return Math.abs(r.p-userPrice)<Math.abs(b.p-userPrice)?r:b;},sorted[0]).p;
    }
    sorted.forEach(function(r,i){
      var pos=_pinPos(distKey,i,sorted.length);
      if(!pos)return;
      var ratio=maxP>minP?(r.p-minP)/(maxP-minP):0.5;
      var hue=Math.round((1-ratio)*210);
      var isN=(userPrice!=null&&r.p===nearestPrice);
      var outline=isN?'outline:2px solid #ff6b35;box-shadow:0 0 0 3px rgba(255,107,53,.3);':'';
      var html='<div style="padding:3px 8px;background:hsl('+hue+',65%,42%);color:#fff;border-radius:12px;font-size:10px;font-weight:700;white-space:nowrap;box-shadow:0 1px 4px rgba(0,0,0,.35);cursor:pointer;'+outline+'">'+r.p+'萬<\/div>';
      var icon=L.divIcon({className:'',html:html,iconAnchor:[28,12]});
      var mk=L.marker([pos.lat,pos.lng],{icon:icon}).addTo(m);
      mk.bindPopup('<b>'+r.n+'<\/b><br>均價 '+r.p+' 萬\/坪');
      _bldgPins.push(mk);
    });
  }
  window._bldgToggle=function(){
    _bldgMode=(_bldgMode==='chart'?'map':'chart');
    var wrap=document.getElementById('leju-bldg-panel');
    if(!wrap)return;
    wrap.innerHTML='';
    if(_bldgMode==='map'){_renderMap(wrap,_curDist,_curPrice);}
    else{_clearPins();_renderChart(wrap,_curDist,_curPrice);}
  };
  window.showLejuBldgPanel=function(distKey,userPrice){
    _curDist=distKey;_curPrice=userPrice;
    var wrap=document.getElementById('leju-bldg-panel');
    if(!wrap)return;
    wrap.innerHTML='';
    _clearPins();
    if(_bldgMode==='map'){_renderMap(wrap,distKey,userPrice);}
    else{_renderChart(wrap,distKey,userPrice);}
  };
})();
function getAdType(){
  const el=document.querySelector('input[name="adtype"]:checked');
  return el?el.value:'名單';
}
function getBuyerProfile(unitPrice,distKey,areaType){
  var bldg=window._BLDG&&window._BLDG[distKey];
  var distMedian=null;
  if(bldg&&bldg.length){
    var ps=bldg.map(function(r){return r.p;}).sort(function(a,b){return a-b;});
    distMedian=ps[Math.floor(ps.length/2)];
  }
  var tier,tierLabel,buyers,catFocus;
  if(unitPrice>=150){
    tier='ultra';tierLabel='豪宅頂奢';
    buyers=['高資產人士','企業主','私人銀行客戶','海外投資客'];
    catFocus='有錢興趣、頂奢生活、財富管理、私人銀行';
  }else if(unitPrice>=80){
    tier='high';tierLabel='高端';
    buyers=['高階主管','金融業高管','科技業高管','成功創業者'];
    catFocus='有錢興趣、理財投資、品質生活、換屋需求';
  }else if(unitPrice>=50){
    tier='midhigh';tierLabel='中高端換屋';
    buyers=['換屋族','科技業工程師','雙薪家庭','高階公務員'];
    catFocus='科技業興趣、換屋房地產、家庭教育、理財規劃';
  }else if(unitPrice>=30){
    tier='mid';tierLabel='中端首購';
    buyers=['首購族','公務員','年輕雙薪夫妻','有房需求家庭'];
    catFocus='首購需求、公務員族群、家庭生活、房地產直接';
  }else{
    tier='entry';tierLabel='平價首購';
    buyers=['社會新鮮人','租轉買族','剛性需求首購'];
    catFocus='年輕首購、生活機能、租轉買族';
  }
  if(areaType==='tech'&&(tier==='midhigh'||tier==='mid')){
    buyers=['竹科/桃科工程師','換屋族','雙薪工程師家庭','科技業上班族'];
    catFocus='科技業興趣（園區工程師）、換屋房地產、家庭生活、理財規劃';
  }
  if(areaType==='luxury'&&tier!=='mid'&&tier!=='entry'){
    catFocus='有錢興趣、頂奢生活、財富管理、豪宅購置';
  }
  if(areaType==='resort'){
    buyers=buyers.concat(['度假置產族','退休規劃者']);
    catFocus=catFocus+'、旅遊休閒、退休規劃';
  }
  var relativeNote='';
  if(distMedian&&unitPrice>0){
    var ratio=Math.round((unitPrice/distMedian-1)*100);
    if(ratio>15)relativeNote=distKey+'區均價約'+distMedian+'萬/坪，高出 '+ratio+'%（地區高端）';
    else if(ratio<-15)relativeNote=distKey+'區均價約'+distMedian+'萬/坪，低於 '+Math.abs(ratio)+'%（地區平價）';
    else relativeNote=distKey+'區均價約'+distMedian+'萬/坪，與周邊相近';
  }
  return {tier:tier,tierLabel:tierLabel,buyers:buyers,catFocus:catFocus,distMedian:distMedian,relativeNote:relativeNote};
}
function showRealPricePanel(distKey,city){
  var anchor=document.getElementById('real-price-anchor');
  if(!anchor)return;
  anchor.innerHTML='';
  var distName=(distKey||'')+'區';
  // Always render a link card first
  var linkCard=document.createElement('div');
  linkCard.className='lbp-card';linkCard.style.marginTop='10px';
  linkCard.innerHTML='<div class="lbp-header"><span class="lbp-title">實價登錄<\/span><span class="lbp-subtitle">'+distName+'<\/span><\/div>'+
    '<div style="font-size:11px;color:var(--sub);padding:6px 0 2px">直接查詢官方資料：<a href="https://plvr.land.moi.gov.tw/" target="_blank" style="color:var(--a);font-weight:600">內政部不動產成交案件查詢<\/a><\/div>'+
    '<div class="lbp-source">資料來源：內政部實價登錄<\/div>';
  anchor.appendChild(linkCard);
  // Attempt live data for New Taipei
  if(city==='新北市'){
    var url='https://data.ntpc.gov.tw/api/datasets/acce802d-58cc-4dff-9e7a-9ecc517f78be/json?page=0&size=10&filter='+encodeURIComponent("district eq '"+distName+"'");
    fetch(url).then(function(r){return r.json();}).then(function(data){
      if(!data||!data.length)return;
      var rows=data.filter(function(d){return parseInt(d['單價元\/平方公尺']||0)>0;}).slice(0,5);
      if(!rows.length)return;
      var card=document.createElement('div');
      card.className='lbp-card';card.style.marginTop='6px';
      var inner='<div class="lbp-header"><span class="lbp-title">近期實價登錄<\/span><span class="lbp-subtitle">'+distName+' 近期成交<\/span><\/div>';
      rows.forEach(function(d){
        var sqm=parseInt(d['單價元\/平方公尺'])||0;
        var ping=Math.round(sqm*3.3058/10000*10)/10;
        var ym=d['交易年月']||'';
        var yr=(parseInt(ym.substring(0,3))||0)+1911;
        var mo=parseInt(ym.substring(3,5))||0;
        var addr=(d['土地區段位置或建物區段門牌']||'').substring(0,18);
        inner+='<div style="display:grid;grid-template-columns:60px 1fr 48px;align-items:center;gap:6px;padding:5px 0;border-bottom:1px solid var(--bd);font-size:11px">';
        inner+='<span style="color:var(--sub)">'+yr+'/'+mo+'<\/span>';
        inner+='<span style="color:var(--tx);overflow:hidden;text-overflow:ellipsis;white-space:nowrap">'+addr+'<\/span>';
        inner+='<span style="text-align:right;font-weight:600;color:var(--a-dark)">'+ping+'萬<\/span><\/div>';
      });
      inner+='<div class="lbp-source">資料來源：新北市政府開放資料 data.ntpc.gov.tw<\/div>';
      card.innerHTML=inner;
      anchor.appendChild(card);
    }).catch(function(){});
  }
}
function updateCriteria(){
  const box=document.getElementById('criteria-box');
  if(!box)return;
  const priceType=document.querySelector('input[name="ptype"]:checked').value;
  const s1=parseFloat(document.getElementById('sz1').value)||0;
  const s2=parseFloat(document.getElementById('sz2').value)||s1;
  const avgSize=(s1+s2)/2;
  let totalAvg=0,unitAvg=0;
  if(priceType==='total'){
    const p1=parseFloat(document.getElementById('pt1').value)||0;
    const p2=parseFloat(document.getElementById('pt2').value)||p1;
    totalAvg=(p1+p2)/2;
    if(avgSize>0)unitAvg=totalAvg/avgSize;
  }else{
    unitAvg=parseFloat(document.getElementById('pu1').value)||0;
    if(avgSize>0)totalAvg=unitAvg*avgSize;
  }
  const adType=getAdType();
  if(totalAvg===0&&unitAvg===0){box.style.display='none';return;}
  const priceLine=totalAvg>0?'總價約'+Math.round(totalAvg)+'萬'+(unitAvg>0?' / 單價約'+Math.round(unitAvg)+'萬/坪':''):unitAvg>0?'單價約'+Math.round(unitAvg)+'萬/坪':'';
  const sizeLine=(avgSize>0&&(totalAvg>0||unitAvg>0))?'坪數約'+Math.round(avgSize)+'坪':'';
  const at=window.mapAreaType||'general';
  const atLabel={tech:'科技園區',luxury:'精華豪宅',resort:'度假觀光',general:'一般住宅'}[at];
  const adDesc={'名單':'名單廣告 — 優先觸及有購屋意願用戶，以留資為轉換目標','訊息':'訊息廣告 — 導流 Messenger 對話，觸及高互動意願用戶','1510':'1510 影音 — 15秒短影片 + 靜態素材，擴大品牌觸及與案件印象'}[adType]||adType;
  const prof=getBuyerProfile(unitAvg||0,window.mapDistKey||'',at);
  const lines=['案件定位：'+prof.tierLabel+(unitAvg>0?' ('+Math.round(unitAvg)+'萬/坪)':'')+(atLabel?' ｜ '+atLabel+'地帶':'')];
  if(priceLine)lines.push('價格條件：'+priceLine);
  if(sizeLine)lines.push('坪數條件：'+sizeLine);
  if(prof.relativeNote)lines.push('地區比對：'+prof.relativeNote);
  lines.push('目標族群：'+prof.buyers.join('、'));
  lines.push('廣告形式：'+adDesc);
  lines.push('AI 優先選取：「'+prof.catFocus+'」，依地點×單價雙因子評分排序');
  box.innerHTML=lines.join('<br>');
  box.style.display='block';
  if(window.mapDistKey)showLejuBldgPanel(window.mapDistKey,computeUserUnitPrice());
}
function calcPkgPerf(p,adType){
  const at=window.mapAreaType||'general';
  // CPL benchmarks calibrated from real Taiwan real estate META ad data
  let cplLo,cplHi;
  if(p.isLuxury){cplLo=700;cplHi=1400;}
  else if(p.isHighEnd){cplLo=400;cplHi=800;}
  else if(p.isMid){cplLo=250;cplHi=550;}
  else{cplLo=180;cplHi=380;}
  if(at==='luxury'){cplLo=Math.round(cplLo*1.15);cplHi=Math.round(cplHi*1.15);}
  if(at==='tech'){cplLo=Math.round(cplLo*0.92);cplHi=Math.round(cplHi*0.92);}
  if(adType==='名單'){
    return '<div class="pkg-perf"><span class="perf-label">預計成效</span><span class="perf-item">預估 CPL：NT$'+cplLo+'～'+cplHi+'</span></div>';
  }else if(adType==='訊息'){
    return '<div class="pkg-perf"><span class="perf-label">預計成效</span><span class="perf-item">預估每次對話：NT$'+cplLo+'～'+cplHi+'</span></div>';
  }else{
    const cpmLo=p.isLuxury?120:p.isHighEnd?90:p.isMid?70:55;
    const cpmHi=p.isLuxury?200:p.isHighEnd?160:p.isMid?130:100;
    return '<div class="pkg-perf"><span class="perf-label">預計成效</span><span class="perf-item">預估 CPM：NT$'+cpmLo+'～'+cpmHi+'</span></div>';
  }
}

