const YOU=[{ta:"30-60
公務員 教職
",proj:"晴山白里",raw:"廚房（家居和園藝用品） 、閱讀（傳播） 、園藝（戶外活動） 、親子教育（兒童和親子教育） 、居家裝修（家居和園藝用品） 、 591房屋交易網、幼兒教育（小學和中學教育） 、教育（社會觀念） 、大自然（科學） 、自行車（體育運動） 、書籍（媒體刊物） 、家庭（社會觀念） 、房地產（產業） 、烹飪（美食和餐飲） 或質感設計"},{ta:"35-65
開店 投資
",proj:"錢連",raw:"被動收入（商業與財務） 、房地產投資（投資） 、財富（經濟） 、不動產（房地產） 、公司、收入（商業與財務） 、企業家（商業與財務） 、商業（商業與財務） 、獨資企業（商業與財務） 、加盟連鎖（行銷） 、新創公司（商業與財務） 或居家事業（商業與財務）"},{ta:"30-65
彰化 國道1沿線
工業 置產
$356、20名單",proj:"新都峰",raw:"加工出口工廠、製造業（產業） 、食品產業、紡織工業、投資（商業與財務） 、房地產（產業） 、投資報酬率（投資） 、批發（零售） 、新聞媒體（新聞服務） 、時事（政治） 、網路購物（零售） 或個人理財（銀行業）"},{ta:"28-60
科技工業 賺錢
$97、58訊息",proj:"大興家園",raw:"1.地點：大里工業區（+3 公里）, 台中大里軟體園區（+3 公里）, 太平工業區（+3 公里）, 大興十九街1巷， 台中市（+3 公里） Taichung
2.興趣：金錢（貨幣） 、財富（經濟） 、投資（商業與財務） 、收入（商業與財務） 、汽車（交通工具） 、電子商務（零售） 、股票（投資） 、羽球 (球拍類運動) 、酒精飲品（美食和餐飲） 、房地產（產業） 、房屋（房地產） 、 591房屋交易網或樂屋網"},{ta:"30-55
教職員 休閒
$118、16訊息",proj:"大興家園",raw:"1.地點：中台科技大學（+3 公里）, 北屯捷運總站（+3 公里）, 祥順運動公園（+3 公里）, 大興十九街1巷， 台中市（+3 公里） Taichung
2.興趣：閱讀（傳播） 、書籍（媒體刊物） 、廚房（家居和園藝用品） 、教育（社會觀念） 、大自然（科學） 、家庭（社會觀念） 、烹飪（美食和餐飲） 、學區、旅遊（產業） 、休閒活動（休閒） 、假期（活動） 、房地產（產業） 、 591房屋交易網或樂屋網"},{ta:"30-64
高知識  財經",proj:"松恩頌子鳥",raw:"1.地點：清華大學（+3 公里） ; 臺大醫院竹北分院（+3 公里）, 明新科技大學（+3 公里）, 台大竹北校區（+3 公里）, 新竹國軍醫院（+3 公里）
2.興趣：學術期刊、學術研討會、研究、展覽館、高等教育（教育） 、教育（社會觀念） 、投資（商業與財務） 、新聞播報（新聞服務） 、大眾媒體（娛樂與媒體） 、財經（商業與財務） 、房屋（房地產） 或 591房屋交易網"},{ta:"30-60 
科技新貴 旅遊",proj:"松恩頌子鳥",raw:"1.地點：新竹科學園區（+3 公里）, 竹北台元科技園區（+3 公里）, 新竹巨城百貨公司廣場（+3 公里）, 竹北高鐵（+3 公里）
2.興趣：高科技（電腦和電子產品） 、智慧科技 (消費電子產品) 、人工智慧（計算） 、大數據 (科學) 、新興技術（科學） 、旅遊（旅遊觀光） 、飯店（住宿） 、 http://booking.com/（旅遊觀光業） 、旅遊網站（網站） 、 http://hotels.com/（住宿） 、 Trivago 、房地產（產業） 、房屋（房地產） 或免稅商店"},{ta:"35-60 / 清水 神岡 潭子 / 藍領+日用品",proj:"中科峇里島17",raw:"35-60 / 清水 神岡 潭子 / 藍領+日用品
1.地點：和睦路一段（+3 公里）, 豐洲科技工業園區（+5 公里）, 潭子加工出口區（+3 公里）
2.興趣：技術員、工廠（製造業） 、加工出口工廠、製造業（產業） 、物流（商業與財務） 、保險（商業與財務） 、保單（保險） 、家庭（社會觀念） 、超市（食品零售業者） 、量販店（食品零售業者） 、家樂福、居家裝修（家居和園藝用品） 、五金行（零售業者） 、房地產（產業） 或 591房屋交易網"},{ta:"28-55
金融+運動",proj:"光華盛璟",raw:"豪華轎車（交通工具） 、收入（商業與財務） 、股票（投資） 、金錢（貨幣） 、數位貨幣（貨幣） 、股票市場（投資） 、體育、運動（體育運動） 、跑步（體育運動） 、財富（經濟） 、外匯市場（貨幣） 、戶外休閒活動（戶外活動） 、房屋（房地產） 或 591房屋交易網"},{ta:"30-55 / 台3 74沿/ 新婚上班族",proj:"大漁樂芙",raw:"30-55 / 台3 74沿/ 新婚上班族
1.地點：台中高工（+3 公里）, 大里軟體園區（+3 公里）, 大里十九甲（+3 公里）, 霧峰區公所（+3 公里）
2.興趣：訂婚（婚禮） 、求婚（婚禮） 、婚禮（社會觀念） 、旅遊（旅遊觀光） 、 Booking.com（旅遊觀光業） 、旅遊網站（網站） 、 Trivago 、 Hotels.com（住宿） 、咖啡（美食和餐飲） 、星巴克（咖啡） 、宜家家居（零售業者） 、家電（消費電子產品） 、 591房屋交易網或房屋廣告和入口網站 (網站)"},{ta:"65-65
教職員+房產興趣",proj:"中科峇里島17",raw:"35-60 / 大雅 神岡 沙鹿 / 教職員+房產興趣
1.地點：大楊國小（+5 公里）, 台中日僑學校（+5 公里）, 神岡國小（+5 公里）, 靜宜大學（+5 公里）
2.興趣：高等教育（教育） 、新聞媒體（新聞服務） 、書籍（媒體刊物） 、文化（社會觀念） 、財經（商業與財務） 、電視台、教育（社會觀念） 、圖書館、房屋（房地產） 、公寓（房地產） 、房地產投資（投資） 、 591房屋交易網或房屋廣告和入口網站 (網站),"},{ta:"30-60
傳產 公務員
$244、11訊息",proj:"新都峰",raw:"30-60 / 和美 國道1 / 傳產 公務員
1.地點：和美高中（+5 公里）, 烏日工業城（+5 公里）, 大肚橋（+5 公里） ; 精誠夜巿（+5 公里）
2.興趣：住家修繕（居家裝修） 、保養、維修和操作（建築業） 、製造業（產業） 、物流（商業與財務） 、工廠（製造業） 、機械加工、工具機 (興建和維修) 、批發（零售） 、機器、經銷（商業） 、房屋（房地產） 、 591房屋交易網、上班族（流行文化） 或社群媒體（網路媒體）"},{ta:"30-60
設計+休閒",proj:"光華盛璟",raw:"30-60 / 竹南 竹北 / 設計+休閒
1.地點：竹南運動公園（+6 公里） ; 新竹科學工業園區（+6 公里）, 北新竹車站（+6 公里）
2.興趣：居家裝修（家居和園藝用品） 、室內設計（設計） 、設計（設計） 、住家修繕（居家裝修） 、平面設計（視覺藝術） 、網站設計（網站） 、時尚設計（設計） 、服裝（服飾） 、時尚配件（飾品配件） 、休閒娛樂（社會觀念） 、休閒遊戲（電玩遊戲） 、網路購物（零售） 、百貨公司（零售） 、房屋（房地產） 或房屋廣告和入口網站 (網站)

27-60
-室內設計（設計） 、房屋（房地產） 、平面設計（視覺藝術） 、百貨公司（零售） 、居家裝修（家居和園藝用品） 、時尚設計（設計） 、網路購物（零售） 、時尚配件（飾品配件） 、休閒娛樂（社會觀念） 、網站設計（網站） 、服裝（服飾） 、設計（設計） 、房屋廣告和入口網站 (網站) 、休閒餐廳 (餐廳) 、美容（社會觀念） 或居家事業（商業與財務）"},{ta:"30-60
純房產興趣",proj:"大漁樂芙",raw:"30-60 / 大里烏日南屯 / 純房產興趣
-烏日工業城（+3 公里）, 大里十九甲（+5 公里）, 台中好巿多（+3 公里）
-房地產（產業） 、房屋（房地產） 、公寓大樓（房地產） 、住宅區（房地產） 、起步房（房地產） 、 591房屋交易網、房屋廣告和入口網站 (網站) 、房地產經濟學 (經濟) 、租賃（房地產） 或由擁有者出售 (房地產)"},{ta:"30-55
軍公教
$131、80",proj:"至善人本",raw:"30-55 / 伸港和美彰化 / 軍公教
-伸港國中第二校區（+3 公里）, 和美高中（+3 公里）, 大道國中（+3 公里）, 彰化車站（+3 公里）
-教育（社會觀念） 、學習（教育） 、書籍（媒體刊物） 、新聞媒體（新聞服務） 、學校（教育） 、社區議題（法律與政府） 、家庭（社會觀念） 、均衡飲食（個人護理） 、健康和保健（個人護理） 、社群媒體（網路媒體） 或政府機關概念和作法 (法律和政府)"},{ta:"28-60
科技質感興趣
$103、117",proj:"至善人本",raw:"28-60 / 伸港鹿港 / 科技質感興趣
-85。c鹿港鹿和店（+5 公里）, 伸港鄉立圖書館（+5 公里）
- iPhone（智慧型手機） 、 Apple Watch（消費電子產品） 、智慧科技 (消費電子產品) 、穿戴式科技（消費電子產品） 、新興技術（科學） 、物聯網、商業智慧 (商業和金融業) 、網路購物（零售） 、時尚設計（設計） 、室內設計（設計） 、時尚配件（飾品配件） 、現代家具（居家裝潢） 、宜家家居（零售業者） 、時事（政治） 、美食（美食和餐飲） 、排屋或連棟住宅（建築）"},{ta:"28-60 / 北屯太平東區 / 年輕自住
$131、61訊息",proj:"大興家園",raw:"28-60 / 北屯太平東區 / 年輕自住
-太平運動公園（+3 公里）, 台中市北屯兒童公園（+3 公里）, 台中秀泰站前s1館（+3 公里）
-上班族（流行文化） 、服裝（服飾） 、購物中心（零售） 、美容（社會觀念） 、時尚配件（飾品配件） 、化妝品（個人護理） 、個人理財（銀行業） 、儲蓄（銀行業） 、熱門話題、網路銀行（銀行業） 、網路購物（零售） 、淘寶網、 momo購物網、行動支付（貨幣） 、 LINE 、行動應用程式（軟體） 、流行音樂（音樂） 、啤酒（酒精飲料） 、 UberEATS 、運動（體育運動） 、 591房屋交易網或房屋廣告和入口網站 (網站)"},{ta:"**30-60 / 中科南屯南區 / 年輕人興趣",proj:"元境大喜",raw:"30-60 / 中科南屯南區 / 年輕人興趣
-中興大學惠蓀堂（+2 公里）, 台中車站（+5 公里）, 文心森林公園（+5 公里）, 中科路， 台中市（+5 公里） Taichung
-UberEATS 、戶外（戶外活動） 、人工智慧（計算） 、室內設計（設計） 、上班族（流行文化） 、程式語言（計算） 、資訊科技（電腦和電子產品） 、藝術展覽（視覺藝術） 、親子教育（兒童和親子教育） 、網站開發（網站） 、網路購物（零售） 、航空公司、投資（商業與財務） 、軟體開發（軟體） 、餐廳（餐飲） 、星巴克（咖啡） 、零售業（產業） 、電腦程式設計（電腦和電子產品） 、科技（電腦和電子產品） 、旅遊（旅遊觀光） 、 Trivago 或 Booking.com（旅遊觀光業）"},{ta:"28-55 / 神岡豐原中科 / 年輕娛樂",proj:"中科峇里島17",raw:"28-55 / 神岡豐原中科 / 年輕娛樂
-中部科學園區（+5 公里）, 后里科技園區（+5 公里）, YCM 永進機械 Yeong Chin Machinery Industries Co., Ltd.（+5 公里）, 豐原太平洋百貨（+5 公里）
-上班族（流行文化） 、服裝（服飾） 、購物中心（零售） 、美容（社會觀念） 、時尚配件（飾品配件） 、快時尚（服飾） 、儲蓄（銀行業） 、個人理財（銀行業） 、熱門話題、網路銀行（銀行業） 、淘寶網、網路購物（零售） 、行動支付（貨幣） 、 LINE 、行動應用程式（軟體） 、釀造（啤酒） 、運動（體育運動） 、休閒娛樂（社會觀念） 、 Netflix（串流服務） 、 Spotify（串流服務） 或 591房屋交易網"},{ta:"30-60 / 豐原潭子后里 / 有小孩寵物",proj:"晴山白里",raw:"30-60 / 豐原潭子后里 / 有小孩寵物
-潭子加工出口區（+5 公里）, 豐原太平洋百貨（+5 公里）, 后科路， 台中市（+3 公里） Taichung
-家庭（社會觀念） 、親子教育（兒童和親子教育） 、廚房（家居和園藝用品） 、室內設計（設計） 、現代家具（居家裝潢） 、家電（消費電子產品） 、幼兒教育（小學和中學教育） 、生活用品（家居和園藝用品） 、運動（體育運動） 、暑假（小學和中學教育） 、草地（園藝） 、任天堂 (遊戲機和相關配件) 、寵物食品（寵物用品） 、狗狗美容（寵物） 、遛狗（狗狗） 、犬隻健康（寵物） 或貓糧（寵物用品）,"},{ta:"30-60 / 太平74沿 / 創業 經營 美業",proj:"錢連全联",raw:"30-60 / 太平74沿 / 創業 經營 美業
-環中東路二段（+5 公里）, 慈眀高中（+5 公里）, 環中東路七段， 台中市（+5 公里） Taichung
-商業模式 (商業和金融業) 、居家事業（商業與財務） 、收入（商業與財務） 、食品和飲品 (食物和飲品) 、指甲彩繪 (美妝) 、美甲（化妝品） 、美甲沙龍（化妝品） 、足部護理 (美容服務) 、角蛋白、髮型（護髮保養） 、自僱（工作機會） 、律師（法律和法律服務） 、自由工作者（工作機會） 、律師事務所 (法律和法律諮詢服務) 、零售業（產業） 、批發（零售） 、經銷（商業） 或早午餐（美食和餐飲）, 行為：小型企業主,"},{ta:"35-65 / 太平 大里 74沿 / 開店 投資",proj:"錢連全联",raw:"35-65 / 太平 大里 74沿 / 開店 投資
-慈眀高中（+5 公里）, 環中東路七段， 台中市（+5 公里）, 環中東路三段， 台中市（+5 公里） Taichung
-金錢（貨幣） 、公司（商業與財務） 、個人理財（銀行業） 、商業模式 (商業和金融業) 、被動收入（商業與財務） 、新創公司（商業與財務） 、企業家（商業與財務） 、獨資企業（商業與財務） 、投資（商業與財務） 、商業（商業與財務） 、房地產投資（投資） 、財富（經濟） 、居家事業（商業與財務） 、不動產（房地產） 、公司或收入（商業與財務）,"},{ta:"30-60 / 太平大里 / 在地高收入",proj:"錢連鋼骨雙併",raw:"30-60 / 太平大里 / 在地高收入
-台中大里軟體園區（+5 公里） ; 樹孝路， Taiwankou, T'Ai-Wan, Taiwan（+5 公里） Changhua
-企業家（商業與財務） 、醫學院 (高等教育) 、律師（法律和法律服務） 、法律（法律和法律服務） 、科學 (期刊) 、軟體開發（軟體） 、程式語言（計算） 、軟體工程（資訊技術） 、電腦科學（資訊技術） 、網站開發（網站） 、健身和保健（健身） 、日本消費電子產品品牌 (電腦和電子產品) 、家庭（社會觀念） 、商業模式 (商業和金融業) 、轎車（汽車） 、房屋（房地產） 、住宅區（房地產） 或別墅（住宿）,"},{ta:"30-60 / 北屯太平 / 年輕娛樂",proj:"",raw:"30-60 / 北屯太平 / 年輕娛樂
-太原車站（+3 公里）, 總站夜市（+3 公里）
-上班族（流行文化） 、服裝（服飾） 、網路購物（零售） 、時尚配件（飾品配件） 、美容沙龍（化妝品） 、髮型（護髮保養） 、快時尚（服飾） 、行動支付（貨幣） 、行動銀行（銀行業） 、 LINE 、 Netflix（串流服務） 、流行音樂（音樂） 、休閒娛樂（社會觀念） 、麥當勞（餐廳） 、街頭時尚（服飾） 、運動場所 (體育運動) 、個人理財（銀行業） 、燒烤（烹飪） 、啤酒（酒精飲料） 、假期（活動） 或 591房屋交易網"},{ta:"28-55 / 頭份竹南竹北 / 職業+房產",proj:"富廣ONNI",raw:"28-55 / 頭份竹南竹北 / 職業+房產
-竹南科技園區（+5 公里）, 竹南獅山親子公園（+5 公里）, 新竹巨城百貨公司廣場（+5 公里）, 竹北台元科技園區（+5 公里）, 竹東工研院（+5 公里）
-美妝網紅 (美妝) 、網路名人、 YouTube（串流服務） 、社群媒體行銷（行銷） 、商業模式 (商業和金融業) 、聯盟行銷（行銷） 、電子商務（零售） 、自由工作者（工作機會） 、自僱（工作機會） 、被動收入（商業與財務） 、直銷、獨資企業（商業與財務） 、創意創業 (商業和金融業) 、居家事業（商業與財務） 、 591房屋交易網或房屋（房地產）、行為：網紅創作者"},{ta:"27-55 / 中科世貿 / 年輕工程師",proj:"惠田映悅",raw:"27-55 / 中科世貿 / 年輕工程師
-中科路（+5 公里）, 台中矽品（+5 公里）, 台中世貿中心（+5 公里）
-半導體、人工智慧（計算） 、大數據 (科學) 、軟體工程（資訊技術） 、軟體開發（軟體） 、電腦程式設計（電腦和電子產品） 、資訊科技（電腦和電子產品） 、電腦工程（工程） 、機器學習（計算） 、任天堂 (遊戲機和相關配件) 、 Python（程式語言） 、 PlayStation（遊戲機） 、 UberEATS 、酒精飲品（美食和餐飲） 、美食（美食和餐飲） 、市場趨勢 (商業和金融業) 或數位貨幣（貨幣）"},{ta:"**27-60/ 西屯中科 /銀行 精算師",proj:"惠田好日子",raw:"**27-60/ 西屯中科 /銀行 精算師
-水崛頭公園（+2 公里）, 統聯中港轉運站 U Bus（+2 公里）
-金錢（貨幣） 、財經（商業與財務） 、會計學（商業與財務） 、個人理財（銀行業） 、財務規劃（投資） 、金融服務（商業與財務） 、銀行業（金融） 、企業家（商業與財務） 、會計系統、投資（商業與財務） 、財務會計（商業與財務） 、商業（商業與財務） 或財富管理（銀行業）, 行為：小型企業主"},{ta:"28-55 / 鹿港和美福興 / 年輕 育兒 首購
$199、27訊息",proj:"青成康堤",raw:"28-55 / 鹿港和美福興 / 年輕 育兒 首購
-和美高中（+5 公里）, 7-11福環門市（+5 公里） ; 鹿港老街（+5 公里）
-媽媽寶寶-懷孕、生產、育兒、新生兒派對（兒童和親子教育） 、家庭（社會觀念） 、上班族（流行文化） 、 LINE 、傢俱（居家裝潢） 、室內設計（設計） 、熱門話題、淘寶網、網路購物網站 (網站) 、流行文化（社會觀念） 、促銷（行銷） 、婚禮（社會觀念） 、美容（社會觀念） 、 iPhone（智慧型手機） 、個人理財（銀行業） 、 591房屋交易網或房地產（產業）"},{ta:"27-60 / 十期 / 行銷 小資族",proj:"惠田好日子",raw:"27-60 / 十期 / 行銷 小資族
-太原車站（+5 公里）, 頭家厝菜市場（+5 公里）
-室內設計（設計） 、行銷企劃 (行銷) 、數位行銷（行銷） 、折扣商店（零售） 、綜藝節目 (表演藝術) 、傢俱（居家裝潢） 、韓國電視劇（電視節目） 、網紅行銷 (行銷) 、網路購物（零售） 、居家裝潢零售商 (零售) 、廣告（行銷） 、設計（設計） 、政府（政府機構） 或網路 (電腦運算)、行業類別：政府員工（全球） 、行政服務或教育和圖書館
1118-永興街（+5 公里）, 太原車站（+5 公里）, 台中車站（+5 公里）, 頭家厝菜市場（+5 公里）
室內設計（設計） 、行銷企劃 (行銷) 、傢俱（居家裝潢） 、折扣商店（零售） 、綜藝節目 (表演藝術) 、韓國電視劇（電視節目） 、網紅行銷 (行銷) 、廣告（行銷） 、設計（設計） 、政府（政府機構） 、網路 (電腦運算) 、宜家家居（零售業者） 、雅高達、銀行帳戶 (銀行業) 、商業模式 (商業和金融業) 或簡餐館（餐廳）"},{ta:"28-55 / 大里霧峰 / 理財 儲蓄",proj:"大漁樂芙",raw:"28-55 / 大里霧峰 / 理財 儲蓄
-大里成功商圈（+5 公里）, 大里中興商圈（+5 公里）, 大里立新國小（+5 公里）
-個人理財服務和組織 (銀行業) 、儲蓄（銀行業） 、儲蓄帳戶（銀行業） 、存款帳戶 (銀行業) 、儲蓄互助社、財務規劃（投資） 、信用額度（借貸） 、金錢（貨幣） 、被動收入（商業與財務） 、投資（商業與財務） 、現金、股票市場（投資） 、上班族（流行文化） 、優惠券（優惠券和折扣） 、折扣和折讓（優惠券和折扣） 、 7-11 、便利商店（零售業者） 、超市（食品零售業者） 、熱門話題或 591房屋交易網"},{ta:"27-55 / 竹科巨城 / 旅遊 年輕工程師
",proj:"美麗華山美",raw:"27-55 / 竹科巨城 / 旅遊 年輕工程師
-新竹科學園區（+3 公里）, 竹北台元科技園區（+3 公里）, 新竹巨城百貨公司廣場（+3 公里）, 竹北高鐵（+3 公里）, 芎林戶政事務所（+5 公里）
-智慧科技 (消費電子產品) 、人工智慧（計算） 、大數據 (科學) 、新興技術（科學） 、半導體、物聯網、商業智慧 (商業和金融業) 、軟體開發（軟體） 、軟體工程（資訊技術） 、 iPhone（智慧型手機） 、 Python（程式語言） 、 GitHub 、美食（美食和餐飲） 、旅遊（旅遊觀光） 、 http://booking.com/（旅遊觀光業） 、旅遊網站（網站） 、免稅商店、室內設計（設計） 、品酒 (葡萄酒) 或數位貨幣（貨幣）"},{ta:"30-60 / 竹科竹東 / 研究 高知識
",proj:"美麗華山美",raw:"30-60 / 竹科竹東 / 研究 高知識
-竹東工研院（+5 公里）, 竹東中央市場（+3 公里）, 國立清華大學（+3 公里）, 台灣大學竹北分校（+3 公里）, 國立陽明交通大學 National Yang Ming Chiao Tung University（+3 公里）
-高等教育（教育） 、研究所教育（高等教育） 、科學 (期刊) 、研究、文學（藝術） 、教育學（教育） 、新興技術（科學） 、實驗室、投資（商業與財務） 、財經（商業與財務） 、新聞播報（新聞服務） 、智慧科技 (消費電子產品) 、工程和理工學院 (教育) 或理工學院"},{ta:"27-55 / 西屯中科水湳 / 會計 金融顧問",proj:"惠田好日子",raw:"27-55 / 西屯中科水湳 / 會計 金融顧問
-水崛頭公園（+3 公里）, 水湳經貿園區（+3 公里）, 統聯中港轉運站 U Bus（+3 公里）
-財經（商業與財務） 、金錢（貨幣） 、被動收入（商業與財務） 、投資管理（投資） 、財務規劃（投資） 、資產管理 (商業和金融業) 、投資銀行業（銀行業） 、經濟學（經濟） 、會計系統、註冊會計師、私人銀行服務、財務顧問 (投資) 、會計學（商業與財務） 、納斯達克100指數、當沖交易（投資） 或私募基金、私募股權投資 (投資)
1016-註冊會計師、投資銀行業（銀行業） 、金錢（貨幣） 、電腦運算、財經（商業與財務） 、會計學（商業與財務） 、財務規劃（投資） 、財務顧問 (投資) 、被動收入（商業與財務） 、投資管理（投資） 、私募基金、私募股權投資 (投資) 、納斯達克100指數、會計系統、財務會計（商業與財務） 、資產管理 (商業和金融業) 、商業（商業與財務） 、房地產投資（投資） 或經濟學（經濟）
1023-註冊會計師、投資銀行業（銀行業） 、電腦運算、會計學（商業與財務） 、財務規劃（投資） 、財務顧問 (投資) 、被動收入（商業與財務） 、投資管理（投資） 、私募基金、私募股權投資 (投資) 、納斯達克100指數、會計系統、財務會計（商業與財務） 、資產管理 (商業和金融業) 、商業（商業與財務） 、房地產投資（投資） 、經濟學（經濟） 、財富管理（銀行業） 、當沖交易（投資） 、道瓊斯工業平均指數、證券交易所（投資） 或股份 (金融)"},{ta:"28-60 / 大林大埔美 / 藍領 休閒
",proj:"中祐雅苑",raw:"28-60 / 大林大埔美 / 藍領 休閒
-大林車站（+3 公里） ; 大埔美佐登妮絲城堡園區（+3 公里）, 大埔美園區（+3 公里）
-能源效率（能源與公用事業） 、儲蓄（銀行業） 、上班族（流行文化） 、超市（食品零售業者） 、配電系統、個人理財（銀行業） 、折扣和折讓（優惠券和折扣） 、保險（商業與財務） 、技術員、數位相機 (相機和相機設備) 、食品產業、玻璃、家庭（社會觀念） 、佳能企業、代工生產、休閒活動（休閒） 、工業工程 (工程) 、科技（電腦和電子產品） 或製造生產服務和組織 (製造業), 行為：通勤者"},{ta:"30-55 / 清水神岡潭子 / 工業 儲蓄 家居",proj:"中科峇里島17",raw:"30-55 / 清水神岡潭子 / 工業 儲蓄 家居
-和睦路一段（+3 公里）, 潭子加工出口區（+3 公里）, 豐洲科技工業園區（+5 公里）, 神林路一段， 台中市（+3 公里） Taichung
-儲蓄（銀行業） 、工廠（製造業） 、保單（保險） 、傢俱（居家裝潢） 、個人理財（銀行業） 、技術員、食品（美食和餐飲） 、家樂福、家電（消費電子產品） 、製造業（產業） 、生活用品（家居和園藝用品） 、機械工程（工程） 或製造生產服務和組織 (製造業)"},{ta:"28-55 / 鹿港和美福興 / 藍領 銀行保險
$203、24訊息",proj:"青成康堤",raw:"28-55 / 鹿港和美福興 / 藍領 銀行保險
-和美高中（+5 公里）, 7-11福環門市（+5 公里） ; 鹿港老街（+5 公里）
-保險（商業與財務） 、保單（保險） 、人壽保險（保險） 、業務（商業與財務） 、零售銀行業務（銀行業） 、投資銀行業（銀行業） 、銀行業（金融） 、金融服務（商業與財務） 、證券交易所（投資） 、股市指數 (投資) 、技術員、製造業（產業） 、製造生產服務和組織 (製造業) 、工廠（製造業） 、股票經紀人 (投資) 、配電系統、代工生產、上班族（流行文化） 或熱門話題"},{ta:"28-55 / 南區東區太平 / 餐廳 串流媒體",proj:"大漁樂芙",raw:"28-55 / 南區東區太平 / 餐廳 串流媒體
-臺中火車站（+3 公里）, 精武路（+3 公里）, 建國北黃昏市場（+5 公里）
-速食休閒餐廳 (餐廳) 、簡餐館（餐廳） 、甜點（美食和餐飲） 、在地美食（美食和餐飲） 、烘培坊（烘焙食品） 、火鍋、燒烤（烹飪） 、韓式料理（美食和餐飲） 、美食家（美食和餐飲） 、壽司（美食和餐飲） 、鮭魚、 Netflix（串流服務） 、 Spotify（串流服務） 、 Apple Music 、 YouTube（串流服務） 、 UberEATS 或行動支付（貨幣）"},{ta:"28-60 / 竹南竹北 / 教育 生活",proj:"富廣ONNI",raw:"28-60 / 竹南竹北 / 教育 生活
-國家衛生研究院（+3 公里）, 尚順購物中心（+3 公里） ; 竹南獅山親子公園（+5 公里）, 新竹巨城百貨公司廣場（+5 公里）, 竹北台元科技園區（+5 公里）, 竹東工研院（+5 公里）, 廣源科技園區（+3 公里）
-高等教育（教育） 、語言教育、外語、航空公司、教育（社會觀念） 、工程和理工學院 (教育) 、旅遊（旅遊觀光） 、旅遊網站（網站） 、網路 (電腦運算) 、慢跑（跑步） 、園藝（家居和園藝用品） 、超市（食品零售業者） 、生活用品（家居和園藝用品） 、網路社區、韓國電視劇（電視節目） 、美容（社會觀念） 、美學（哲學） 、商業模式 (商業和金融業) 或咖啡廳（咖啡）"},{ta:"28-55 / 南區東區太平 / 年輕創業 ",proj:"大漁樂芙",raw:"28-55 / 南區東區太平 / 年輕創業 
-臺中火車站（+3 公里）, 精武路（+3 公里）, 建國北黃昏市場（+5 公里）
-自由工作者（工作機會） 、居家事業（商業與財務） 、被動收入（商業與財務） 、自僱（工作機會） 、女性企業家（商業與財務） 、獨資企業（商業與財務） 、創意創業 (商業和金融業) 、美學（哲學） 、設計（設計） 、美容（社會觀念） 、商業模式 (商業和金融業) 、行銷企劃 (行銷) 、攝影師（攝影） 、角蛋白、髮型（護髮保養） 、室內設計（設計） 、零售業（產業） 或商業計畫 (商業活動)、行為：小型企業主"},{ta:"25-55 / 大台中 /百葉簾 家具",proj:"臻富裕",raw:"25-55 / 大台中 /百葉簾 家具
-台中中央公園（+8 公里）, 台中IKEA旗艦店（+8 公里）, 臺中市港區藝術中心（+8 公里）
-傢俱（居家裝潢） 、居家裝修（家居和園藝用品） 、室內設計（設計） 、現代家具（居家裝潢） 、百葉簾、窗戶（建築） 、宜家家居（零售業者） 、居家飾品 (居家裝潢) 、居家裝潢零售商 (零售) 、美學（哲學） 或住家修繕（居家裝修）
1208
-華山文創（+20 公里） ; 桃園車站（+20 公里） ; 台中中央公園（+20 公里）, 彰化車站（+20 公里） ; 北新竹車站（+20 公里）
+ Procurement 、生活風格 (生活風格內容) 、居家用品零售商 (零售) 、 LifeStyle Home 、室內建築（建築） 、住家翻新 (住家修繕) 或 Architecture & Interior Design"},{ta:"28-55 / 中科西屯 / 工程師興趣
",proj:"永尚樾山丘",raw:"28-55 / 中科西屯 / 工程師興趣
-中科林厝公園（+3 公里）, 台中工業區（+3 公里）, 新光三越 台中中港店（+3 公里）
-資訊科技（電腦和電子產品） 、軟體開發（軟體） 、大數據 (科學) 、人工智慧（計算） 、新興技術（科學） 、智慧科技 (消費電子產品) 、股票（投資） 、網路社區、棒球（體育運動） 、 NBA季後賽、行動支付（貨幣） 、 Google電子錢包或 Uber（公司）、行為：行銷 API 開發人員（過去 90 天）
1121-台中工業區（+3 公里）, 水崛頭公園（+3 公里）, 老虎城購物中心（台中）（+3 公里）
人工智慧（計算） 、棒球（體育運動） 、大數據 (科學) 、資訊科技（電腦和電子產品） 、行動支付（貨幣） 、智慧科技 (消費電子產品) 、股票（投資） 、新興技術（科學） 、軟體開發（軟體） 、網路社區、 Uber（公司） 、 Trivago 、 http://geek.com/ 、旅遊網站（網站） 或 GitHub
1125
-台中工業區（+4 公里）, 水崛頭公園（+4 公里）, 中力健身中心-沙鹿館（+4 公里）
-人工智慧（計算） 、棒球（體育運動） 、 GitHub 、旅遊網站（網站） 、大數據 (科學) 、資訊科技（電腦和電子產品） 、行動支付（貨幣） 、智慧科技 (消費電子產品) 、股票（投資） 、新興技術（科學） 、軟體開發（軟體） 、網路社區、 Uber（公司） 、 Trivago 、 http://geek.com/ 、健身俱樂部（健身） 、重量訓練（舉重） 、智慧裝置（消費電子產品） 、雞肉 (食品) 、羅技或 Razer"},{ta:"28-55 / 大林新港 / 家庭主婦",proj:"中祐雅苑",raw:"28-55 / 大林新港 / 家庭主婦
-新港老街（+5 公里） ; 大埔美園區（+5 公里）, 嘉義縣大林鎮（+5 公里）
-烹飪（美食和餐飲） 、廚房（家居和園藝用品） 、廚具（廚房與餐廚） 、餐具、家電（消費電子產品） 、家務（家居和園藝用品） 、中式料理（美食和餐飲） 、生活用品（家居和園藝用品） 、家庭（社會觀念） 、親子教育（兒童和親子教育） 、個人理財（銀行業） 、優惠券（優惠券和折扣） 、超市（食品零售業者） 、一般保險 (保險) 、 591房屋交易網、財務規劃（投資） 或居家裝修（家居和園藝用品）"},{ta:"28-55 / 十期東區 / 餐廳 串流媒體
$125、90訊息",proj:"大興家園",raw:"28-55 / 十期東區 / 餐廳 串流媒體
-精武路（+2 公里）, 太原車站（+3 公里）, 頭家厝菜市場（+3 公里）
-速食休閒餐廳 (餐廳) 、簡餐館（餐廳） 、甜點（美食和餐飲） 、在地美食（美食和餐飲） 、烘培坊（烘焙食品） 、火鍋、燒烤（烹飪） 、韓式料理（美食和餐飲） 、美食家（美食和餐飲） 、壽司（美食和餐飲） 、鮭魚、 Netflix（串流服務） 、 Spotify（串流服務） 、 Apple Music 、 YouTube（串流服務） 、 UberEATS 或行動支付（貨幣）
1125
-精武路（+3 公里）, 太原車站（+3 公里）, 頭家厝菜市場（+3 公里）
-UberEATS 、 Spotify（串流服務） 、烘培坊（烘焙食品） 、甜點（美食和餐飲） 、行動支付（貨幣） 、簡餐館（餐廳） 、在地美食（美食和餐飲） 、火鍋、鮭魚、韓式料理（美食和餐飲） 、壽司（美食和餐飲） 、 Netflix（串流服務） 、速食休閒餐廳 (餐廳) 、燒烤（烹飪） 、美食家（美食和餐飲） 、 YouTube（串流服務） 、 Apple Music 、速食餐廳（餐飲） 、自助餐或真人實境秀（電影和電視）"},{ta:"28-60 / 伸港鹿港龍井大肚 / 有小孩寵物
$166、23",proj:"至善人本",raw:"28-60 / 伸港鹿港龍井大肚 / 有小孩寵物
-龍井車站（+3 公里）, 大肚車站（+3 公里） ; 85。c鹿港鹿和店（+5 公里）, 伸港鄉立圖書館（+5 公里）
-家庭（社會觀念） 、親子教育（兒童和親子教育） 、廚房（家居和園藝用品） 、室內設計（設計） 、現代家具（居家裝潢） 、家電（消費電子產品） 、幼兒教育（小學和中學教育） 、生活用品（家居和園藝用品） 、運動（體育運動） 、暑假（小學和中學教育） 、草地（園藝） 、任天堂 (遊戲機和相關配件) 、寵物食品（寵物用品） 、狗狗美容（寵物） 、犬隻健康（寵物） 、遛狗（狗狗） 、貓糧（寵物用品） 、排屋、住宅區（房地產） 或別墅（住宿）"},{ta:"27-55 / 十期 / 行銷設計
",proj:"原潮APT",raw:"27-55 / 十期 / 行銷設計
-太原車站（+3 公里）, 頭家厝菜市場（+3 公里）
-室內設計（設計） 、行銷企劃 (行銷) 、數位行銷（行銷） 、折扣商店（零售） 、綜藝節目 (表演藝術) 、傢俱（居家裝潢） 、韓國電視劇（電視節目） 、網紅行銷 (行銷) 、網路購物（零售） 、居家裝潢零售商 (零售) 、廣告（行銷） 、設計（設計） 、政府（政府機構） 、網路 (電腦運算) 、平面設計（視覺藝術） 或服裝（服飾）"},{ta:"28-60 / 伸港鹿港和美 / 零售批發自營
$92、142",proj:"至善人本",raw:"28-60 / 伸港鹿港和美 / 零售批發自營
-台中商銀和美分行（+5 公里） ; 85。c鹿港鹿和店（+5 公里）, 伸港鄉立圖書館（+5 公里）
-商業模式 (商業和金融業) 、零售業（產業） 、批發（零售） 、經銷（商業） 、供應鏈、居家事業（商業與財務） 、小型企業（商業與財務） 、銀行帳戶 (銀行業) 、貿易（經濟） 、電子商務（零售） 、行銷企劃 (行銷) 、社群媒體行銷（行銷） 、網紅行銷 (行銷) 或網路購物（零售）
1126
-台中商銀和美分行（+5 公里） ; 築間幸福鍋物 彰化自強店（+3 公里）, 85。c鹿港鹿和店（+5 公里）, 伸港鄉立圖書館（+5 公里）
-小型企業（商業與財務） 、銀行帳戶 (銀行業) 、行銷企劃 (行銷) 、批發（零售） 、經銷（商業） 、電子商務（零售） 、商業模式 (商業和金融業) 、網路購物（零售） 、社群媒體行銷（行銷） 、網紅行銷 (行銷) 、居家事業（商業與財務） 、零售業（產業） 、物聯網、排屋、連棟住宅（建築） 、火鍋、速食休閒餐廳 (餐廳) 或 Apple Watch（消費電子產品）"},{ta:"28-60 / 秀水埔鹽福興 / 在地產業",proj:"(傑芳) 維瓦第明日City",raw:"28-60 / 秀水埔鹽福興 / 在地產業
-福興工業區（+5 公里）, 秀水_龍騰公園（+5 公里） ; 埔鹽系統交流道， 內埔鄉（+5 公里） Pingtung
-代工生產、食品產業、包裝和標籤（商業與財務） 、製造生產服務和組織 (製造業) 、機械加工、電子工程、保單（保險） 、超市（食品零售業者） 、技術員、汽車（交通工具） 、休閒餐廳 (餐廳) 、網路購物（零售） 、數位媒體（電腦和電子產品） 、家電（消費電子產品） 、居家裝修（家居和園藝用品） 、彩券（博奕） 或自行車（交通工具）"},{ta:"27-55 / 十期 / 財會 公務員",proj:"惠田好日子",raw:"27-55 / 十期 / 財會 公務員
-太原車站（+5 公里）, 頭家厝菜市場（+5 公里）
-財務會計（商業與財務） 、會計系統、政府（政府機構） 、時事（政治） 、新聞媒體（新聞服務） 、傢俱（居家裝潢） 、網路 (電腦運算) 、韓國電視劇（電視節目） 、壽司（美食和餐飲） 、燒牛肉、鮭魚、室內設計（設計） 或科技（電腦和電子產品）、行業類別：教育和圖書館、政府員工（全球） 、保護服務或社區和社會服務
1118-
-和欣客運朝馬轉運站（+3 公里）, 太原車站（+5 公里）, 水湳經貿園區（+3 公里）, 頭家厝菜市場（+5 公里）
-室內設計（設計） 、燒牛肉、傢俱（居家裝潢） 、鮭魚、時事（政治） 、會計系統、壽司（美食和餐飲） 、財務會計（商業與財務） 、韓國電視劇（電視節目） 、政府（政府機構） 、網路 (電腦運算) 、新聞媒體（新聞服務） 、科技（電腦和電子產品） 、雲端運算（計算） 、私人銀行服務、財政預算案、快時尚（服飾） 或簿記"},{ta:"27-55 / 中科南屯烏日 / 食衣住行",proj:"原潮APT",raw:"27-55 / 中科南屯烏日 / 食衣住行
-烏日高鐵站（+5 公里）, 台中工業區（+3 公里）, 中科路（+3 公里）, 精科公園（+3 公里）, 台中世貿中心（+3 公里）
-房屋（房地產） 、住宿加早餐酒店、 http://booking.com/（旅遊觀光業） 、美食（美食和餐飲） 、火鍋、日本料理（美食和餐飲） 、牛肉（美食和餐飲） 、服裝（服飾） 、襯衫（服飾） 、時尚配件（飾品配件） 、電動車（交通工具） 、 BMW（交通工具） 、特斯拉汽車（交通工具） 、購物中心（零售） 、配送（商務） 或 UberEATS"},{ta:"28-55 / 南區東區太平 / 網紅行銷 美食",proj:"大漁樂芙",raw:"28-55 / 南區東區太平 / 網紅行銷 美食
-臺中火車站（+3 公里）, 精武路（+3 公里）, 建國北黃昏市場（+5 公里）
-行銷企劃 (行銷) 、社群媒體行銷（行銷） 、網紅行銷 (行銷) 、病毒營銷、開發潛在顧客 (行銷) 、 Instagram（社群媒體） 、網路廣告（行銷） 、速食休閒餐廳 (餐廳) 、烘培坊（烘焙食品） 、鮭魚、 Apple Music 、 YouTube（串流服務） 、行動支付（貨幣） 、韓式料理（美食和餐飲） 或蛋糕（烘焙食品）"},{ta:"28-55 / 十期東區 / 餐廳 串流媒體",proj:"原潮APT",raw:"28-55 / 十期東區 / 餐廳 串流媒體
-精武路（+3 公里）, 太原車站（+3 公里）, 頭家厝菜市場（+3 公里）
-速食休閒餐廳 (餐廳) 、簡餐館（餐廳） 、甜點（美食和餐飲） 、在地美食（美食和餐飲） 、烘培坊（烘焙食品） 、火鍋、燒烤（烹飪） 、韓式料理（美食和餐飲） 、美食家（美食和餐飲） 、壽司（美食和餐飲） 、鮭魚、 Netflix（串流服務） 、 Spotify（串流服務） 、 Apple Music 、 YouTube（串流服務） 、 UberEATS 或行動支付（貨幣）"},{ta:"28-60 / 北屯太平東區 / 娛樂購物",proj:"原潮APT",raw:"28-60 / 北屯太平東區 / 娛樂購物
-台中市北屯兒童公園（+3 公里）, 台中秀泰站前s1館（+3 公里）, 頭家厝菜市場（+3 公里）
-上班族（流行文化） 、服裝（服飾） 、購物中心（零售） 、美容（社會觀念） 、時尚配件（飾品配件） 、化妝品（個人護理） 、個人理財（銀行業） 、熱門話題、網路銀行（銀行業） 、網路購物（零售） 、淘寶網、行動支付（貨幣） 、 LINE 、行動應用程式（軟體） 、韓國電視劇（電視節目） 、速食休閒餐廳 (餐廳) 、流行音樂（音樂） 、綜藝節目 (表演藝術) 、房屋廣告和入口網站 (網站) 、假期（活動） 或快時尚（服飾）"},{ta:"28-55 / 彰師大+3K / 房地產",proj:"坤辰師大苑",raw:"28-55 / 彰師大+3K / 房地產
-彰化師範大學（+3 公里）
-房地產（產業） 、不動產（房地產） 、房地產投資（投資） 、公寓大樓（房地產） 、租賃（房地產） 或 591房屋交易網"},{ta:"28-55 / 彰師大+5K / 新婚成家",proj:"坤辰師大苑",raw:"28-55 / 彰師大+5K / 新婚成家
-彰化師範大學（+5 公里）
-婚姻（婚禮） 、婚禮（社會觀念） 、婚宴（婚禮） 、訂婚戒指（珠寶） 、媽媽寶寶-懷孕、生產、育兒、喜帖（婚禮） 或餐廳（餐飲）"},{ta:"30-60 / 中北部 / 企業管理",proj:"昇祐ONE PLUS",raw:"30-60 / 中北部 / 企業管理
-南港軟體工業園區(Nankang Software Park)（+20 公里） ; 后里科技園區（+20 公里）, 烏日高鐵站（+20 公里） ; 龍潭科學園區（+20 公里） ; 苗栗線政府（+20 公里） ; 新竹生物醫學園區（+20 公里）
-商業（商業與財務） 、管理（商業與財務） 、品牌管理、企業家（商業與財務） 、廣告行銷活動 (行銷) 、企業管理（商業與財務） 、人力資源管理（商業與財務） 、徵才（工作機會） 、徵才網站（工作機會） 、行銷策略（行銷） 、培訓和開發 (商業活動) 、資金、投資銀行業（銀行業） 、股市指數 (投資) 或房地產投資（投資）"},{ta:"30-60 / 沙鹿龍井伸港 / 上班族 / 家具設計",proj:"璞邑恆樂",raw:"30-60 / 沙鹿龍井伸港 / 上班族 / 家具設計
-台中市沙鹿區（+5 公里）, 伸港工業區（+5 公里）, 台中市龍井區（+5 公里）
-上班族（流行文化） 、管理（商業與財務） 、製造業（產業） 、商業（商業與財務） 、傢俱（居家裝潢） 、室內設計（設計） 、居家裝修（家居和園藝用品） 、現代家具（居家裝潢） 、宜家家居（零售業者） 、政府（政府機構） 、網路購物（零售） 、時尚配件（飾品配件） 、排屋、住宅區（房地產） 、連棟住宅（建築） 、保單（保險） 或業務（商業與財務）, 行為：通勤者, 行業類別：大型企業對企業（B2B）企業員工（500 名以上員工） 、中型企業對企業（B2B）企業員工（200 - 500 名員工） 或小型企業對企業（B2B）企業員工（10-200 名員工）
1125
-台中市沙鹿區（+5 公里）, 大肚區公所（+5 公里）, 伸港工業區（+5 公里）, 中科公園（+5 公里）, 台中市龍井區（+5 公里）
-+羅技"},{ta:"28-60 / 龍井東海中科 / 科技房產興趣
",proj:"璞邑恆樂",raw:"28-60 / 龍井東海中科 / 科技房產興趣
-東海藝術商圈（+5 公里）, 西濱路三段， 台中市（+5 公里）, 中科路， 台中市（+5 公里） Taichung
-智慧科技 (消費電子產品) 、新興技術（科學） 、 AI 、三星電子、羅技、 NVIDIA GeForce 、時尚設計（設計） 、證券（金融） 、個人理財服務和組織 (銀行業) 、商業智慧 (商業和金融業) 、時尚配件（飾品配件） 、宜家家居（零售業者） 、網路購物網站 (網站) 、電子商務網站 (網站) 、排屋、住宅區（房地產） 、連棟住宅（建築） 或 591房屋交易網
1125
-東海藝術商圈（+5 公里）, 萬興路， 台中市（+5 公里）, 中科路， 台中市（+5 公里） Taichung; 西濱路三段， Taiwankou, T'Ai-Wan, Taiwan（+5 公里） Changhua
-燒牛肉、三星電子、 AI 、連棟住宅（建築） 、 NVIDIA GeForce 、證券（金融） 、 591房屋交易網、時尚設計（設計） 、鮭魚、智慧科技 (消費電子產品) 、時尚配件（飾品配件） 、商業智慧 (商業和金融業) 、新興技術（科學） 、酒精飲品（美食和餐飲） 、宜家家居（零售業者） 、住宅區（房地產） 、排屋、羅技、個人理財服務和組織 (銀行業) 、網路購物網站 (網站) 或電子商務網站 (網站)
1201
-燒牛肉、 AI 、連棟住宅（建築） 、 NVIDIA GeForce 、證券（金融） 、 591房屋交易網、時尚設計（設計） 、鮭魚、智慧科技 (消費電子產品) 、時尚配件（飾品配件） 、新興技術（科學） 、酒精飲品（美食和餐飲） 、宜家家居（零售業者） 、住宅區（房地產） 、排屋、羅技、個人理財服務和組織 (銀行業) 、電子商務網站 (網站) 、 LifeStyle Food 或旅行社和預訂 (旅遊觀光業)"},{ta:"30-60 / 西屯七期 / 精品房產
",proj:"門門一合院",raw:"30-60 / 西屯七期 / 精品房產
-台中七期（+3 公里）, 福科路， 台中市（+3 公里） Taichung
-精品店（零售業者） 、高級訂製時裝（服飾） 、排屋、住宅區（房地產） 、連棟住宅（建築） 、別墅（住宿） 、私人銀行服務、愛馬仕（服飾） 或路易威登（時尚品牌）
1125
-台中七期（+3 公里）, 龍富路五段， 台中市（+3 公里）, 福科路， 台中市（+3 公里） Taichung
-連棟住宅（建築） 、私人銀行服務、精品店（零售業者） 、愛馬仕（服飾） 、路易威登（時尚品牌） 、別墅（住宿） 、住宅區（房地產） 、排屋、高級訂製時裝（服飾） 、 Cartier（珠寶商） 、凡賽斯（時尚品牌） 或商務艙（航空旅行）
1201
-黎明路三段， 台中市（+4 公里）, 龍富路五段， 台中市（+4 公里）, 福林路， 台中市（+4 公里） Taichung"},{ta:"28-60 / 竹科園區 / 親子 / 美食",proj:"富廣ONNI",raw:"28-60 / 竹科園區 / 親子 / 美食
-新竹科學園區（+5 公里）
-親子教育（兒童和親子教育） 、家庭（社會觀念） 、教養方式 (兒童和親子教育) 、私立學校（教育） 、基本英語、兒童發展（小學和中學教育） 、宮崎駿、樂高（玩具） 、美食（美食和餐飲） 、食品媒體和內容 (食物和飲品) 、早午餐（美食和餐飲） 、烹飪（美食和餐飲） 、壽司（美食和餐飲） 、燒牛肉、鮭魚、美食家（美食和餐飲） 或氣泡酒 (葡萄酒)"},{ta:"30-65 / 嶺東烏日南區 / 企業主管",proj:"富旺商城",raw:"30-65 / 嶺東烏日南區 / 企業主管
-新烏日車站（+3 公里）, 嶺東科技大學（+3 公里）, 文心森林公園站（+3 公里）, 大慶夜市（+3 公里）
-高階管理人員、管理（商業與財務） 、商業（商業與財務） 、商業計畫 (商業活動) 、中小型企業（商業與財務） 、戰略計劃、商業模式 (商業和金融業) 、社群媒體行銷（行銷） 、行銷企劃 (行銷) 、網紅行銷 (行銷) 或購物中心（零售）、行為：小型企業主
1201
-新烏日車站（+5公里）, 嶺東科技大學（+3 公里）, 文心森林公園站（+3 公里）, 大慶夜市（+3 公里）
1211
+商機 (商業和金融業) 、業務開發 (商業活動) 、價格或節慶（活動）"},{ta:"27-55 / 西屯南屯 / 登山運動工程師",proj:"原潮APT",raw:"**27-55 / 西屯南屯 / 登山運動工程師
-嶺東科技大學（+3 公里）, 台中工業區（+3 公里）, 逢甲大學 Feng Chia University（+4 公里）
-指數基金 (投資) 、程式語言（計算） 、滑雪勝地 (登山和滑雪勝地) 、亞瑟士、羽球 (球拍類運動) 、智慧科技 (消費電子產品) 、 Lexus 汽車（交通工具） 、優乃克、股票（投資） 、滑雪（滑雪和單板滑雪） 、電腦記憶體（電腦硬體） 、信用卡（借貸） 、網球（體育運動） 、美津濃、滑雪板（滑雪和單板滑雪） 、電子工程、電腦程式設計（電腦和電子產品） 、科技（電腦和電子產品） 或 PlayStation 4"},{ta:"35-60 / 南區東區大里 / 子女置產

潭子北屯太平",proj:"原潮APT",raw:"35-60 / 南區東區大里 / 子女置產
-大里中興商圈（+3 公里）, 寶闊健康活水休閒館（+3 公里）, 建國北黃昏市場（+5 公里）
-旅行社和預訂 (旅遊觀光業) 、跟團旅行 (旅遊觀光) 、糕點（烘焙食品） 、文化遺產 (藝術和文化) 、民俗學、古蹟、超市（食品零售業者） 、亞洲文化 (文化) 、肥皂劇 (電視節目) 、綜藝節目 (表演藝術) 、證券交易所（投資） 、房地產（產業） 、婚禮（社會觀念） 、公園與遊憩或 YouTube（串流服務）、家長：父母（全部）
1126
-太平中平路（+3 公里）, 全聯軍太店（+3 公里）, 大坑九號步道（+3 公里）, 潭子國民暨兒童運動中心（+3 公里）"},{ta:"30-60 / 東海逢甲太原 / 企業主管

靜宜東海西屯北屯",proj:"富旺商城",raw:"30-60 / 東海逢甲太原 / 企業主管
-太原車站（+5 公里）, 東海藝術商圈（+5 公里）, 逢甲夜市（+5 公里）
-高階管理人員、行銷企劃 (行銷) 、商業計畫 (商業活動) 、中小型企業（商業與財務） 、商業模式 (商業和金融業) 、戰略計劃、社群媒體行銷（行銷） 、購物中心（零售） 、商業（商業與財務） 、網紅行銷 (行銷) 或管理（商業與財務）、行為：小型企業主
1125
-彰化車站（+6 公里）, 洲際棒球場（+5 公里）, 逢甲夜市（+5 公里）, 靜宜大學 Providence University（+5 公里）, 東海藝術商圈（+5 公里）
1201(超優)
-台中JMALL（+5 公里） ; 洲際棒球場（+5 公里）, 靜宜大學 Providence University（+3 公里）, 東海藝術商圈（+5 公里）, 金典綠園道商場（+3 公里）
1211
+生產率、企業孵化器、會員集點計畫 (優惠券、折扣和購物回饋) 或商務旅遊（旅遊觀光業）"},{ta:"28-60 / 林口三井+3K / 房地產
",proj:"家悦美(主)",raw:"28-60 / 林口三井+3K / 房地產
-林口三井 Outlet（+3 公里）
-房地產（產業） 、不動產（房地產） 、房地產投資（投資） 、房地產開發（房地產） 、房地產投資俱樂部（俱樂部） 、創意房地產投資 (房地產) 或 591房屋交易網"},{ta:" 27-55 / 林口三井+3K / 新婚成家
",proj:"家悦美(副)",raw:"27-55 / 林口三井+3K / 新婚成家
-林口三井 Outlet（+3 公里）
-婚禮（社會觀念） 、婚宴（婚禮） 、喜帖（婚禮） 、婚紗攝影（攝影） 、媽媽寶寶-懷孕、生產、育兒、戒指（珠寶） 或結婚蛋糕（婚禮）
1127主粉專
-結婚蛋糕（婚禮） 、婚宴（婚禮） 、媽媽寶寶-懷孕、生產、育兒、兒童文學（文學） 、戒指（珠寶） 、私立學校（教育） 、婚紗攝影（攝影） 、蒙台梭利教育法、喜帖（婚禮） 、婚禮（社會觀念） 、親子 (雜誌) 或教養方式 (兒童和親子教育)
1203副粉專
-林口三井 Outlet（+5 公里） ; 新光三越 桃園站前店（+5 公里）"},{ta:"28-60 / 伸港鹿港龍井大肚 / 科技家庭自住
$95、108",proj:"至善人本",raw:"28-60 / 伸港鹿港龍井大肚 / 科技家庭自住
-龍井車站（+3 公里）, 大肚車站（+5 公里） ; 85。c鹿港鹿和店（+5 公里）, 伸港鄉立圖書館（+5 公里）
-一般健康 (個人護理) 、（美食和餐飲） 、生活用品（家居和園藝用品） 、家務（家居和園藝用品） 、家電（消費電子產品） 、傢俱（居家裝潢） 、一般保險 (保險) 、房屋（房地產） 、 591房屋交易網、室內設計（設計） 、房屋保險（保險） 、排屋、連棟住宅（建築） 、 iPhone（智慧型手機） 、物聯網或智慧科技 (消費電子產品)"},{ta:"28-60 / 林口三井+3K / 附近職業",proj:"家悦美(主)",raw:"28-60 / 林口三井+3K / 附近職業
-林口三井 Outlet（+3 公里）
-智慧科技 (消費電子產品) 、新興技術（科學） 、半導體、食品產業、能源（科學） 或物流（商業與財務）"},{ta:"30-60 / 西屯南屯 / 企業家高奢興趣",proj:"門門一合院",raw:"30-60 / 西屯南屯 / 企業家高奢興趣
-五權西路（+5 公里）, 黎明路三段， 台中市（+5 公里） Taichung
-度假（社會觀念） 、比爾·蓋茨、私人銀行服務、古馳（時尚品牌） 、席夢思、路易威登（時尚品牌） 、私人公司、水療（個人護理） 、 Tax law 、遊艇（船舶） 、企業家（商業與財務） 、股份 (金融) 、財富（經濟） 、房地產（產業） 、投資者（投資） 、機場貴賓室、高爾夫球（體育運動） 、現代藝術（藝術） 、手錶（飾品配件） 、收藏品 (收藏品) 或豪華轎車（交通工具）
1125
-國立臺灣美術館 National Taiwan Museum of Fine Arts（+3 公里）, 黎明路三段， 台中市（+4 公里）, 龍富路四段， 台中市（+4 公里） Taichung
-現代藝術（藝術） 、度假（社會觀念） 、比爾·蓋茨、私人銀行服務、古馳（時尚品牌） 、席夢思、水療（個人護理） 、私人公司、 Tax law 、遊艇（船舶） 、機場貴賓室、路易威登（時尚品牌） 、企業家（商業與財務） 、收藏品 (收藏品) 、股份 (金融) 、高爾夫球（體育運動） 、財富（經濟） 、房地產（產業） 、投資者（投資） 、手錶（飾品配件） 、豪華轎車（交通工具） 、古董、跑車（交通工具） 或拍賣"},{ta:"28-55 / 沙鹿清水 / 公教職員
",proj:"華偉知見",raw:"28-55 / 沙鹿 / 公教職員
-沙鹿郵局（+3 公里）, 臺中市立圖書館沙鹿深波分館/文昌分館（+3 公里）
-教育（社會觀念） 、學習（教育） 、專業發展（職業訓練） 、書籍（媒體刊物） 、新聞媒體（新聞服務） 、學校（教育） 、社區議題（法律與政府） 、家庭（社會觀念） 、均衡飲食（個人護理） 、健身和保健（健身） 、社群媒體（網路媒體） 、政府機關概念和作法 (法律和政府) 、財政預算案或快時尚（服飾）, 行業類別：保護服務、教育和圖書館、社區和社會服務或軍事（全球）
1201
-沙鹿郵局（+3 公里）, 嘉陽高中（+3 公里）, 臺中市立圖書館沙鹿深波分館/文昌分館（+3 公里）"},{ta:"28-55 / 北區北屯西屯 / 業務媒體餐廳",proj:"大城二月埕",raw:"28-55 / 北區北屯西屯 / 業務媒體餐廳
-敦化路一段（+3 公里）, 國立自然科學博物館（+3 公里）, 頭家厝菜市場（+3 公里）
-iPhone（智慧型手機） 、業務（商業與財務） 、 Apple Watch（消費電子產品） 、時尚配件（飾品配件） 、銀行業（金融） 、房地產（產業） 、社群媒體行銷（行銷） 、社群媒體（網路媒體） 、保險（商業與財務） 、大眾媒體（娛樂與媒體） 、新聞媒體（新聞服務） 、個人發展（個人身分） 、聯盟行銷（行銷） 、休閒餐廳 (餐廳) 、星巴克（咖啡） 、早午餐（美食和餐飲） 或社交媒體優化
1203
+ LifeStyle Food 、 Lifestyle brand 、美食家（美食和餐飲） 、精品咖啡 (咖啡) 或業務開發 (商業活動)"},{ta:"30-60 / 台1沿線 / 科技工業",proj:"華偉知見",raw:"30-60 / 台1沿線 / 科技工業
-龍井車站（+3 公里）, 7-11菁埔門市（+3 公里）, 麥當勞清水店（+3 公里）, 縱貫公路（+4 公里） Taichung
-機械工程（工程） 、工廠（製造業） 、製造業（產業） 、配電系統、代工生產、能源效率（能源與公用事業） 、半導體、 NVIDIA GeForce 、綜合企業、羅技、 Razer 、行動應用程式（軟體） 、聯結車（交通工具） 、材料科學、科技新聞 (新聞服務) 、儲蓄帳戶（銀行業） 、時事（政治） 、科技品牌 (科技) 、物聯網或智慧科技 (消費電子產品)
1204
-麥當勞清水店（+4 公里）, 龍井車站（+4 公里）, 7-11菁埔門市（+4 公里）, 中科公園（+3 公里）, 中華路一段208號， 台中市（+4 公里） Taichung
+ Compensation and benefits 、 Gadget & Gear 、專業發展（職業訓練） 、職涯發展（工作機會） 或 LifeStyle Home
0113
-7-11菁埔門市（+4 公里）, 龍井車站（+4 公里）, 麥當勞清水店（+4 公里）, 大雅中科公園（+5 公里）, 中華路一段208號， 台中市（+4 公里） Taichung
-能源效率（能源與公用事業） 、物聯網、工廠（製造業） 、 NVIDIA GeForce 、配電系統、材料科學、儲蓄帳戶（銀行業） 、智慧科技 (消費電子產品) 、半導體、製造業（產業） 、代工生產、聯結車（交通工具） 、機械工程（工程） 、 Compensation and benefits 、行動應用程式（軟體） 、科技新聞 (新聞服務) 、 Razer 、輪胎品牌和商店 (零售) 、釀造（啤酒） 、充電器、電池、製冷、自動化技術、駕駛（交通工具） 或二手商品 (購物和銷售)"},{ta:"27-55 / 中區北區洲際 / 跑咖追星出國2.0",proj:"原潮APT",raw:"27-55 / 中區北區洲際 / 跑咖追星出國2.0
-洲際棒球場（+3 公里）, 中友百貨（+3 公里）, 科博館（+3 公里）, LaLaport Taichung（+3 公里）
-演唱會（音樂活動） 、網路名人、音樂節（活動） 、咖啡廳（咖啡） 、甜點（美食和餐飲） 、旅遊網站（網站） 、住宿加早餐酒店、免稅商店、蛋糕（烘焙食品） 、韓國流行音樂（音樂） 、航空公司、華語流行音樂、 Instagram（社群媒體） 、星巴克（咖啡） 、旅遊（旅遊觀光） 、 http://booking.com/（旅遊觀光業） 、地點 (地標) 、旅行社和預訂 (旅遊觀光業) 、休閒餐廳 (餐廳) 、數位相機 (相機和相機設備) 、肖像攝影 (攝影) 、購物中心（零售） 或即時成像相機"},{ta:"27-45/ 東區北區洲際 / 小家庭自營商
",proj:"原潮APT",raw:"27-45/ 東區北區洲際 / 小家庭自營商
-精武車站（+3 公里）, 洲際棒球場（+3 公里）, 中友百貨（+3 公里）, 科博館（+3 公里）
-烹飪（美食和餐飲） 、 KitchenAid（家用電器） 、個人理財（銀行業） 、幼兒照護（兒童和親子教育） 、教養方式 (兒童和親子教育) 、居家裝修（家居和園藝用品） 、生活風格和家務內容 (居家和園藝用品) 、居家和園藝媒體 (住家修繕) 、家庭桌遊 (遊戲) 、創意創業 (商業和金融業) 、電子商務（零售） 、新創公司（商業與財務） 、顧客關係管理（公關） 或銷售時點情報系統、行為：小型企業主"},{ta:"28-55 / 北屯太平 / 藍領 公教職
(+隱藏興趣)
$163、31訊息",proj:"大興家園",raw:"28-55 / 北屯太平 / 藍領 公教職
-頭家厝菜市場（+3 公里）, 太原車站（+3 公里）, 中臺科技大學（+3 公里）, 大源十九街， 台中市（+5 公里） Taichung
-師範教育（職業訓練） 、技術員、上班族（流行文化） 、工廠（製造業） 、保單（保險） 、存款帳戶 (銀行業) 、配電系統、代工生產、公共運輸（交通運輸） 、超市（食品零售業者） 或本日優惠（零售）, 行業類別：保護服務、政府員工（全球） 、教育和圖書館或行政服務
1204(普)
+教育資源 (教育) 、節儉生活風格內容 (零售) 、教養方式 (兒童和親子教育) 、專業發展（職業訓練） 、 Retirement Insurance Benefits 、退伍軍人福利（軍事） 或家務管理和整理 (居家和園藝用品)
1209
-Retirement Insurance Benefits 、工廠（製造業） 、師範教育（職業訓練） 、存款帳戶 (銀行業) 、超市（食品零售業者） 、保單（保險） 、配電系統、技術員、退伍軍人福利（軍事） 、代工生產、專業發展（職業訓練） 、節儉生活風格內容 (零售) 、教育資源 (教育) 、旋轉式刮鬍刀、摩托車配件（交通工具） 、市政事務 (法律和政府) 或生活風格 (生活風格內容), 行業類別：行政服務、教育和圖書館、保護服務或政府員工（全球）
0113
+臺中孔廟（+3 公里）"},{ta:"30-60 / 北區北屯西屯 / 生活面向
(多隱藏興趣)",proj:"大城二月埕",raw:"30-60 / 北區北屯西屯 / 生活面向
-敦化路一段（+3 公里）, 國立自然科學博物館（+3 公里）, 頭家厝菜市場（+3 公里）
-行動應用程式（軟體） 、零售銀行業務（銀行業） 、 Podcast (音樂和音訊串流) 、網路廣告（行銷） 、買一送一 (行銷) 、生活風格 (生活風格內容) 、 Lifestyle Travel 、 LifeStyle Food 、 Professional services 、 Business networking 、休閒餐廳 (餐廳) 、女裝品牌 (服飾) 、 Cash on delivery 或男裝品牌 (服飾)
1209
-Cash on delivery 、零售銀行業務（銀行業） 、 Business networking 、買一送一 (行銷) 、 Podcast (音樂和音訊串流) 、 LifeStyle Food 、生活風格 (生活風格內容) 、 Lifestyle Travel 、行動應用程式（軟體） 、休閒餐廳 (餐廳) 、男裝品牌 (服飾) 、女裝品牌 (服飾) 、消費電子展、會員集點計畫 (優惠券、折扣和購物回饋) 、電影愛好者 (電影) 、線上訂餐（美食和餐飲） 或 momo購物網"},{ta:"28-55 / 竹北竹南科 / 科技商務
(多隱藏興趣)",proj:"八德盛景",raw:"28-55 / 竹北竹南科 / 科技商務
-新竹科學園區（+5 公里）, 竹南科學園區（+5 公里）, 新竹系統交流道（+5 公里）
-Business networking 、 Professional services 、 LifeStyle Food 、 Podcast (音樂和音訊串流) 、男裝品牌 (服飾) 、女裝品牌 (服飾) 、消費電子產品媒體和內容 (電腦和電子產品) 、 Travel Deals 、 Apple Music 、財務規劃（投資） 、科技新聞 (新聞服務) 、行動應用程式（軟體） 、健身和保健（健身） 、教育資源 (教育) 、休閒餐廳 (餐廳) 或生產率
1224
+數位媒體（電腦和電子產品） 、信貸服務和組織 (信貸和借貸) 或消費電子產品零售商 (零售)"},{ta:"28-55 / 南區東區太平 / 餐廳 串流媒體
",proj:"大漁樂芙",raw:"28-55 / 南區東區太平 / 餐廳 串流媒體
-臺中火車站（+3 公里）, 精武路（+3 公里）, 建國北黃昏市場（+5 公里）
-速食休閒餐廳 (餐廳) 、簡餐館（餐廳） 、甜點（美食和餐飲） 、在地美食（美食和餐飲） 、烘培坊（烘焙食品） 、火鍋、燒烤（烹飪） 、韓式料理（美食和餐飲） 、美食家（美食和餐飲） 、壽司（美食和餐飲） 、鮭魚、 Netflix（串流服務） 、 Spotify（串流服務） 、 Apple Music 、 YouTube（串流服務） 、 UberEATS 或行動支付（貨幣）
1201
+FineDiningLovers 、 LifeStyle Food 、美食 (食品零售商) 或一般生活風格內容 (生活風格內容)"},{ta:"28-55 / 大林新港 / 傳產家庭
(多隱藏興趣)",proj:"中祐雅苑",raw:"28-55 / 大林新港 / 傳產家庭
-新港老街（+5 公里） ; 大埔美園區（+5 公里）, 嘉義縣大林鎮（+5 公里）
-中式料理（美食和餐飲） 、製造業（產業） 、代工生產、農業機械（農業） 、現金回贈獎勵方案 (信貸和借貸) 、會員集點計畫 (優惠券、折扣和購物回饋) 、 Compensation and benefits 、 Workwear 、生活風格 (生活風格內容) 、教養方式 (兒童和親子教育) 、家庭（關係） 、節儉生活風格內容 (零售) 、排屋或別墅（住宿）, 行為：科技早期採用者,"},{ta:"28-55 / 竹北竹南科 / 教育享樂
(多隱藏興趣)",proj:"八德盛景",raw:"28-55 / 竹北竹南科 / 教育享樂
-新竹科學園區（+5 公里）, 新竹系統交流道（+5 公里）, 竹南科學園區（+5 公里）
-Podcast (音樂和音訊串流) 、 Travel Deals 、 LifeStyle Food 、男裝品牌 (服飾) 、女裝品牌 (服飾) 、教育資源 (教育) 、 Craft Beer and Brewing 、派對策劃 (特殊場合和活動) 、早午餐（美食和餐飲） 、英式早餐、 World Gym 、當代藝術（視覺藝術） 、語言教育、成人教育（職業訓練） 、專業發展（職業訓練） 、數字藝術或自助旅行 (旅遊)"},{ta:"28-55 / 南區中區洲際 / 社交網路娛樂
",proj:"大漁樂芙",raw:"28-55 / 南區中區洲際 / 社交網路娛樂
-洲際棒球場（+3 公里）, 中華路夜市（+3 公里）, 建國北黃昏市場（+5 公里）
-網路電視 (電視和影片) 、網路娛樂 (娛樂和媒體) 、隨選影片 (影片串流服務) 、 socializing 、現場活動 (活動) 、 Entertainment News 、音樂和音訊串流 (音樂) 、歡樂時光（酒精飲料） 、數位媒體（電腦和電子產品） 、爆紅影片 (網路影片) 、派對（活動） 、生活風格 (生活風格內容) 、行動支付（貨幣） 、信用卡（借貸） 或 Christmas Holiday"},{ta:"28-55 / 林口五股 / 教育享樂",proj:"家悦美(副)",raw:"28-55 / 林口五股 / 教育享樂2
-林口 三井（+5 公里）, 新北市工商展覽中心（+5 公里）
-Podcast (音樂和音訊串流) 、當代藝術（視覺藝術） 、教育資源 (教育) 、藝術展覽（視覺藝術） 、 Craft Beer and Brewing 、早午餐（美食和餐飲） 、語言教育、女裝品牌 (服飾) 、男裝品牌 (服飾) 、英式早餐、專業發展（職業訓練） 、派對策劃 (特殊場合和活動) 、自助旅行 (旅遊) 、精品咖啡 (咖啡) 或 HydraFacial
1223
+Spotify（串流服務） 、冒險旅遊（旅遊觀光） 、露營（戶外活動） 、釀造（啤酒）"},{ta:"30-65 / 西屯南屯 / 有錢興趣
(多隱藏興趣)",proj:"門門一合院",raw:"30-65 / 西屯南屯 / 有錢興趣
-龍富路五段， 台中市（+2 公里）, 福林路， 台中市（+4 公里） Taichung
-私人銀行服務、 Business networking 、蘇富比、百達翡麗（手錶） 、度假村（旅遊觀光業） 、品酒 (葡萄酒) 、路易威登（時尚品牌） 、企業家（商業與財務） 、豪奢生活方式（網站） 、慈善和公益（社會公益理念） 、 Country club 、高淨值人士（商業與財務） 、高爾夫球（體育運動） 、登山（爬山） 、健行裝備（運動用品） 、健行和露營 (戶外活動) 、觀鳥或茶（非酒精飲料）"},{ta:"27-55 / 林口+3K / 醫護族群",proj:"家悦美(主)",raw:"27-55 / 林口+3K / 醫護族群
-林口長庚醫院醫學大樓（+3 公里）, 林口三井 Outlet（+3 公里）
-醫學院 (高等教育) 、牙科學院 (高等教育) 、護理教育（醫學教育） 、免稅商店、自助旅行 (旅遊) 、一般保險 (保險) 、高等教育（教育） 、衛生學、生物學（科學） 、美容（社會觀念） 、清潔（個人護理） 、 CeraVe Skincare 或 Cetaphil, 行業類別：健康照護與醫療服務
1223
+衛生政策研究、科學 (期刊) 、 Uber（公司） 、研究
0112
-桃園龜山長庚分院（+5 公里）, 林口長庚醫院醫學大樓（+5 公里）, 新仁醫院（+5 公里）"},{ta:"30-60 / 草屯霧峰大里 / 通勤教育戶外",proj:"水琉璃",raw:"30-60 / 草屯霧峰大里 / 通勤教育戶外
-霧峰健體中心（+5 公里） ; 大里一交流道， Taiwankou, T'Ai-Wan, Taiwan（+5 公里） Changhua; 草屯炎峰國小（+5 公里）
-汽車（交通工具） 、上班族（流行文化） 、教育資源 (教育) 、教養方式 (兒童和親子教育) 、一般健康 (個人護理) 、課外活動、家務管理和整理 (居家和園藝用品) 、速食（美食和餐飲） 、 Outdoor Living 、露營（戶外活動） 、自行車（體育運動） 、新聞媒體（新聞服務） 、商業（商業與財務） 、服裝（服飾） 或時事（政治）, 行為：通勤者, 行業類別：政府員工（全球）
0113
+馬拉松 (跑步) 、戶外休閒活動（戶外活動） 或園藝（戶外活動）"},{ta:"25-45 / 中科大雅 / 科技工業年輕成家",proj:"中科峇里島17",raw:"25-45 / 中科大雅 / 科技工業年輕成家
大雅公園（+3 公里）, 台中科技園區（+5 公里）
-人工智慧（計算） 、物聯網、共同基金 (投資) 、 GitHub 、大數據 (科學) 、智慧科技 (消費電子產品) 、半導體、航空公司、能量飲料（非酒精飲料） 、製造生產服務和組織 (製造業) 、 Compensation and benefits 、 Gadget & Gear 、 LifeStyle Home 、專業發展（職業訓練） 、股票經紀人 (投資) 、隨選影片 (影片串流服務) 、婚禮網站和部落格 (網站) 、婚紗攝影（攝影） 或婚戒（婚禮）"},{ta:"30-60/大台中/出國旅遊",proj:"原潮APT",raw:"30-60/大台中/出國旅遊
-東海大學（+4 公里）, 台中機場（+3 公里）, 神岡國小（+4 公里）, 沙鹿車站（+4 公里）, 豐原車站（+4 公里）, 台中車站（+8 公里）, 中科路（+3 公里）
-外匯市場（貨幣） 、免稅商店、航空公司、商務艙（航空旅行） 、機場、機場貴賓室、 Travel the World 、 Visa Cash 或房地產（產業）"},{ta:"35-36/竹北東區湖口/高階主管",proj:"昌禾大苑首席",raw:"35-36/竹北東區湖口/高階主管
-緯度 24.83 經度 121.01 Shigang District（+6 公里） Taichung; 緯度 24.90 經度 121.04 Wangkaolou, T'Ai-Wan, Taiwan（+3 公里） Hsinchu
-納入：興趣：高階管理人員、商業模式 (商業和金融業) 、企業家（商業與財務） 、獨資企業（商業與財務） 、酒精飲品（美食和餐飲） 、產品經理、豪華轎車（交通工具） 或高級訂製時裝（服飾）, 行為：經常旅行的用戶、小型企業主或國際飛行常客, 職稱：區經理、副總經理、創辦人、總監或董事長
0112
+生產率、企業孵化器、業務開發 (商業活動) 或商機 (商業和金融業)"},{ta:"30-65 / 新竹基地5K / 小家庭+房地產",proj:"LUCE VIVA",raw:"30-64 / 新竹基地5K / 小家庭+房地產
-房屋（房地產） 、傢俱（居家裝潢） 、親子教育（兒童和親子教育） 、新生兒派對（兒童和親子教育） 、家電（消費電子產品） 、兒童（兒童和親子教育） 或不動產（房地產）, 家長：家長（子女最大 12 個月） 、嬰幼兒家長（01-02 歲） 、學齡前兒童的家長（03-05 歲） 、低年級學童（06-08 歲）的家長或青少年學童（09-12 歲）的家長
0108
+嬰幼兒和孕婦用品店 (零售) 、教養方式 (兒童和親子教育) 、超市（食品零售業者） 或啤酒（酒精飲料）"},{ta:"25-50 / 南區東區 / 吃喝玩樂",proj:"大漁樂芙",raw:"25-50 / 南區東區 / 吃喝玩樂
-建國北黃昏市場（+5 公里）, LaLaport Taichung（+3 公里）
-隨選影片 (影片串流服務) 、快時尚（服飾） 、網紅行銷 (行銷) 、火鍋、在地美食（美食和餐飲） 、燒烤（烹飪） 、美食家（美食和餐飲） 、酒精飲品（美食和餐飲） 、可樂、簡餐館（餐廳） 、乳製品 (乳製品) 、羽球 (球拍類運動) 、保齡球、卡拉OK 、韓國電視劇（電視節目） 、刺青（身體藝術） 、 PlayStation（遊戲機） 、淘寶網或美妝店 (零售)"},{ta:"28-55 / 大林斗南斗六 / 通勤傳統文化",proj:"中祐雅苑",raw:"28-55 /大林斗南斗六 / 通勤傳統文化
-大埔美園區（+5 公里） ; 斗南車站（+5 公里）, 斗六車站（+5 公里）
-家庭（關係） 、排屋、代工生產、節儉生活風格內容 (零售) 、別墅（住宿） 、文化遺產 (藝術和文化) 、旅遊景點和活動 (旅遊觀光業) 、行動應用程式（軟體） 、 Google地圖、五金行（零售業者） 、印刷（出版） 、真空包裝或不動產（房地產）, 行為：通勤者, 行業類別：安裝與維修服務、政府員工（全球） 或農、林、漁業
0113
+連棟住宅（建築） 、食品加工、配電系統、民俗學、節慶（活動） 、茶葉品牌 (食物和飲品) 或休閒釣魚（釣魚）"},{ta:"30-50 / 北屯北區太平 / 3金融1房產",proj:"原潮APT",raw:"30-50 / 北屯北區太平 / 3金融1房產
-太原車站（+5 公里）, 中友百貨（+5 公里）, 洲際棒球場（+5 公里）, 和牛涮台中文心崇德店（+5 公里）
-財經（商業與財務） 、金融服務（商業與財務） 、保險（商業與財務） 或房地產（產業）"},{ta:"30-65 / 北屯太平潭子 / 會計金融休閒",proj:"大城二月埕",raw:"30-65 / 北屯太平潭子 / 會計金融休閒
-洲際棒球場（+4 公里）, 潭子觀音媽祖廟（+4 公里）, 肥佬闆複合超市（+4 公里）
-財經（商業與財務） 、個人理財（銀行業） 、儲蓄（銀行業） 、存款帳戶 (銀行業) 、財務規劃（投資） 、財務會計（商業與財務） 、行動銀行（銀行業） 、會計系統、金融服務（商業與財務） 、登山（爬山） 、自行車（體育運動） 、戶外休閒活動（戶外活動） 、露營（戶外活動） 、釣魚（戶外活動） 、自助旅行 (旅遊) 、漁具或迪卡儂"},{ta:"30-60 / 彰市+8K / 批發商業房產",proj:"(傑芳) 維瓦第明日City",raw:"30-60 / 彰市+8K / 批發商業房產
-彰化車站（+8 公里）
-批發（零售） 、經銷（商業） 、零售業（產業） 、進口（郵遞） 、出口貿易、業務（商業與財務） 、直運（零售業者） 、物流（商業與財務） 、商業（商業與財務） 、資金、 591房屋交易網、房地產（產業） 、電動車（交通工具） 或汽車（交通工具）, 行為：Facebook 付款用戶（90 天）"},{ta:"30-60 / 基地+5K / 軍公教",proj:"LUCE VIVA",raw:"30-60 / 基地+5K / 軍公教
-Windy City Pizza 風城披薩（+5 公里）
-教育（社會觀念） 、學習（教育） 、教育技術學（教育） 、專業發展（職業訓練） 、政府機關概念和作法 (法律和政府) 、財政預算案、家庭（社會觀念） 、健身和保健（健身） 、新聞媒體（新聞服務） 、保險（商業與財務） 或時事（政治）、行業類別：保護服務、教育和圖書館、軍事（全球） 、政府員工（全球） 或社區和社會服務
0109
擴大"},{ta:"30-60 / 基地+5K / 投資理財房產",proj:"LUCE VIVA",raw:"30-60 / 基地+5K / 投資理財房產
-Windy City Pizza 風城披薩（+5 公里）
-個人理財（銀行業） 、信用卡（借貸） 、儲蓄（銀行業） 、被動收入（商業與財務） 、財務規劃（投資） 、網路銀行（銀行業） 、納斯達克100指數、股市指數 (投資) 、共同基金 (投資) 、一般保險 (保險) 、房地產（產業） 、房屋廣告和入口網站 (網站) 、室內設計（設計） 、地板或居家裝修（家居和園藝用品）
0109
擴大+591"},{ta:"35-60 / 中部 / 露營興趣",proj:"自然紅屋",raw:"35-60 / 中部 / 露營興趣
-台中中央公園（+20 公里）, FAMWOOD 自然紅屋（+20 公里） ; 彰化員林（+20 公里）
-納入：興趣：Outdoor Living 、戶外休閒活動（戶外活動） 、生態旅遊（旅遊觀光） 、自然攝影 (攝影) 、野餐 (食品和飲料) 、居家裝修（家居和園藝用品） 、露營（戶外活動） 、大自然（科學） 、自助旅行 (旅遊) 、露營車 (旅遊觀光) 、草地（園藝） 、 Lifestyle Travel 或 Weekend Getaway
0108
+休旅車營地（露營）  、自助旅行 (旅遊) 、 Prefabricated home 、居家風格和類型 (房地產)"},{ta:"*28-55 / 地基+5K / 年輕興趣",proj:"坤辰師大苑",raw:"*28-55 / 地基+5K / 年輕興趣
-力行路96巷， Taiwankou, T'Ai-Wan, Taiwan（+6 公里） Changhua
-戶外（戶外活動） 、上班族（流行文化） 、 PC Gamer 、 Spotify（串流服務） 、演唱會（音樂活動） 、戶外休閒活動（戶外活動） 、歌唱（音樂） 、音樂節（活動） 、甜點（美食和餐飲） 、派對（活動） 、網路遊戲（電玩遊戲） 、野餐 (食品和飲料) 、攀岩 (極限運動) 、股票（投資） 、卡拉OK 、露營（戶外活動） 、 Netflix（串流服務） 、拼圖、攀石、登山（爬山） 、房地產投資（投資） 、運動類遊戲 (電玩遊戲) 、電腦遊戲（電玩遊戲） 、不動產（房地產） 、電玩遊戲（遊戲） 、社群媒體（網路媒體） 或 YouTube（串流服務）"},{ta:"28-60 / 和美 沿台19 / 小家庭+上班族
$322、30名單",proj:"新都峰",raw:"591房屋交易網、不動產（房地產）、公寓大樓（房地產）、住宅區（房地產）、金融服務（商業與財務）、金錢（貨幣）、促銷（行銷）、政府（政府機構）、團購、證券（金融）、銀行業（金融）、教育、優惠券"},{ta:"30-64
高知識  財經",proj:"松恩頌子鳥",raw:"1.地點：清華大學（+3 公里） ; 臺大醫院竹北分院（+3 公里）, 明新科技大學（+3 公里）, 台大竹北校區（+3 公里）, 新竹國軍醫院（+3 公里）
2.興趣：學術期刊、學術研討會、研究、展覽館、高等教育（教育） 、教育（社會觀念） 、投資（商業與財務） 、新聞播報（新聞服務） 、大眾媒體（娛樂與媒體） 、財經（商業與財務） 、房屋（房地產） 或 591房屋交易網"},{ta:"30-60 
科技新貴 旅遊",proj:"松恩頌子鳥",raw:"1.地點：新竹科學園區（+3 公里）, 竹北台元科技園區（+3 公里）, 新竹巨城百貨公司廣場（+3 公里）, 竹北高鐵（+3 公里）
2.興趣：高科技（電腦和電子產品） 、智慧科技 (消費電子產品) 、人工智慧（計算） 、大數據 (科學) 、新興技術（科學） 、旅遊（旅遊觀光） 、飯店（住宿） 、 Booking.com（旅遊觀光業） 、旅遊網站（網站） 、 Hotels.com（住宿） 、 Trivago 、房地產（產業） 、房屋（房地產） 或免稅商店"},{ta:"**30-60 / 林口五股新北 / 金融投資",proj:"家悦美(副)",raw:"**30-60 / 林口五股新北 / 金融投資
-緯度 25.07 經度 121.47 新莊區（+5 公里）, 緯度 25 經度 121.43 新莊區（+3 公里） New Taipei City; 緯度 25.06 經度 121.37 Taiwankou, T'Ai-Wan, Taiwan（+4 公里） Changhua
-交易策略（投資） 、金融市場（投資） 、金錢（貨幣） 、金融經濟學、財經（商業與財務） 、金融服務（商業與財務） 、金融分析、被動收入（商業與財務） 、投資管理（投資） 、股票市場（投資） 、投資（商業與財務） 、投資者（投資） 、不動產（房地產） 、收入（商業與財務） 或投資報酬率（投資）"},{ta:"30-65 / 南投中興草屯霧峰 / 長輩興趣",proj:"寬心璽玥",raw:"30-65 / 南投中興草屯霧峰 / 長輩興趣
-霧峰農工（+4 公里）, 旭光高中（+3 公里）, 南投中興高中（+3 公里） ; 南投-南崗工業區（+3 公里）
-在家下廚 (烹飪和食譜) 、天然食品（美食和餐飲） 、農業新聞和內容 (農業) 、教育資源 (教育) 、純素營養（飲食） 、健康的習慣 (生活風格內容) 、觀鳥、旅行社和預訂 (旅遊觀光業) 、魚油、全價值營養、膽固醇（科學） 、中式料理（美食和餐飲） 、簡餐館（餐廳） 或休閒活動（休閒）"},{ta:"30-60 / 龍潭中壢 / 成家科技業",proj:"君品天玥",raw:"30-60 / 龍潭中壢 / 成家科技業
-龍潭渴望園區（+3 公里）, 國家原子能科技研究院（+3 公里） ; 龍潭科學園區（+5 公里）
-能源（科學） 、電腦科學（資訊技術） 、科學 (期刊) 、實驗室、軟體工程（資訊技術） 、 Python（程式語言） 、 GitHub 、科技新聞 (新聞服務) 、高等教育（教育） 、生物化學、發電、婚宴（婚禮） 、喜帖（婚禮） 、社群媒體（網路媒體） 或網紅行銷 (行銷)、行業類別：大型企業對企業（B2B）企業員工（500 名以上員工） 、中型企業對企業（B2B）企業員工（200 - 500 名員工） 、政府員工（全球） 或資訊科技和技術服務
0116
-實驗室、婚宴（婚禮） 、 GitHub 、電腦科學（資訊技術） 、科學 (期刊) 、發電、高等教育（教育） 、軟體工程（資訊技術） 、喜帖（婚禮） 、網紅行銷 (行銷) 、 Python（程式語言） 、社群媒體（網路媒體） 、科技新聞 (新聞服務) 、軟體開發（軟體） 、電腦工程（工程） 、數位貨幣（貨幣） 、納斯達克100指數或被動收入（商業與財務）,"},{ta:"28-60 / 基地+6K / 純房產",proj:"LUCE VIVA",raw:"28-60 / 基地+6K / 純房產
-Windy City Pizza 風城披薩（+6 公里）
-591房屋交易網、房地產（產業） 、房屋廣告和入口網站 (網站) 、住宅房地產 (房地產) 或首次購房者（房地產）"},{ta:"28-50 / 東區竹北 / 教育生活相關",proj:"LUCE VIVA",raw:"28-50 / 東區竹北 / 教育生活相關
-台元科技園區（+3 公里） ; 台積電三廠（+5 公里）, 新竹科學園區（+5 公里）
-語言教育、外語、航空公司、工程和理工學院 (教育) 、旅遊（旅遊觀光） 、網路 (電腦運算) 、慢跑（跑步） 、園藝（家居和園藝用品） 、超市（食品零售業者） 、生活用品（家居和園藝用品） 、網路社區、韓國電視劇（電視節目） 、美容（社會觀念） 、美學（哲學） 、商業模式 (商業和金融業) 、護膚保養（化妝品） 或咖啡廳（咖啡）"},{ta:"28-55 / 中山松山大安 / 科技商務",proj:"家悦美(副)",raw:"28-55 / 中山松山大安 / 科技商務
-松山巨蛋（+3 公里）, 臺北玫瑰園（+3 公里）, 台北萬豪酒店Taipei Marriott Hotel（+3 公里）
-Business networking 、男裝品牌 (服飾) 、女裝品牌 (服飾) 、 Podcast (音樂和音訊串流) 、 LifeStyle Food 、 Professional services 、業務開發 (商業活動) 、 Apple Music 、英式早餐、行動應用程式（軟體） 、健身和保健（健身） 、科技新聞 (新聞服務) 、消費電子產品媒體和內容 (電腦和電子產品) 、生產率或數位媒體（電腦和電子產品）"},{ta:"25-55 / 北部中彰 / 軟裝整建",proj:"臻富裕",raw:"25-55 / 北部中彰 / 軟裝整建
-華山文創（+15 公里） ; 桃園車站（+15 公里） ; 台中中央公園（+15 公里）, 彰化車站（+15 公里）, 大甲車站（+15 公里） ; 竹北高鐵（+15 公里）
-室內設計內容 (設計) 、家務管理和整理 (居家和園藝用品) 、居家用品零售商 (零售) 、生活風格和家務內容 (居家和園藝用品) 、百葉簾、整建（建築業） 、住家翻新 (住家修繕) 、大掃除（清潔服務） 、節慶（活動） 、傢俱（居家裝潢） 或居家飾品 (居家裝潢)"},{ta:"28-55 / 彰市和美 /  育兒寵物",proj:"坤辰師大苑",raw:"28-55 / 彰市和美 /  育兒寵物
-彰化車站（+5 公里）, 大肚橋（+2 公里） ; 五鮮級鍋物專賣-和美白金店（+3 公里）
-家庭（社會觀念） 、親子教育（兒童和親子教育） 、廚房（家居和園藝用品） 、室內設計（設計） 、現代家具（居家裝潢） 、消費電子產品媒體和內容 (電腦和電子產品) 、幼兒教育（小學和中學教育） 、生活用品（家居和園藝用品） 、運動（體育運動） 、暑假（小學和中學教育） 、草地（園藝） 、任天堂 (遊戲機和相關配件) 、寵物食品（寵物用品） 、寵物（動物） 、貓糧（寵物用品） 或狗狗美容（寵物）
0115
-大肚橋（+3 公里）, 彰化車站（+3 公里）, 彰化果菜市場（+3 公里） ; 五鮮級鍋物專賣-和美白金店（+3 公里）"},{ta:"28-55 / 大林新港斗南 / 農企業",proj:"中祐雅苑",raw:"28-55 / 大林新港斗南 / 農企業
-新港老街（+5 公里） ; 大埔美園區（+5 公里）, 嘉義縣大林鎮（+5 公里） ; 斗南車站（+5 公里）
-農業新聞和內容 (農業) 、農業服務和組織 (產業) 、肥料（農業） 、農業機械（農業） 、有機農業（農業） 、農夫市集（食品零售業者） 、出口貿易、批發（零售） 、物流（商業與財務） 、園藝（農業） 、天氣預報、政府機關概念和作法 (法律和政府) 、溫室、食品加工、中式料理（美食和餐飲） 、食品保存、生物技術、住宅區（房地產） 或連棟住宅（建築）
0203
-民雄車站（+3 公里）, 新港老街（+3 公里） ; 嘉義縣大林鎮（+5 公里） ; 南笨港休閒農業區（+3 公里）, 斗南車站（+3 公里）
+田地 (農業) 、農企業（農業） 或園藝（戶外活動）"},{ta:"28-55 / 竹北竹南科 / 程式運動電玩
",proj:"八德盛景",raw:"28-55 / 竹北竹南科 / 程式運動電玩
-新竹科學園區（+5 公里）, 新竹系統交流道（+5 公里）, 竹南科學園區（+5 公里）
-基於組件的軟體工程、程式語言（計算） 、開放原始碼軟體、 PHP 、科技新聞 (新聞服務) 、 Java 、有氧運動 (健身) 、健身（體育運動） 、羽球 (球拍類運動) 、電玩遊戲（遊戲） 、 PlayStation（遊戲機） 、超級馬利奧系列、薩爾達傳說、電玩遊戲網路媒體 (電玩遊戲) 或收藏用玩具 (玩具)
0306
+科技傳播學、馬拉松 (跑步) 、玩命關頭或手機遊戲（電玩遊戲）"},{ta:"35-65 / 中北部 / 退休度假興趣",proj:"自然紅屋",raw:"35-65 / 中北部 / 退休度假興趣
-臺北車站（+20 公里） ; 台中中央公園（+20 公里）, FAMWOOD 自然紅屋（+20 公里） ; 彰化員林（+20 公里） ; 竹北高鐵（+20 公里）
-Outdoor Living 、 Prefabricated home 、居家風格和類型 (房地產) 、度假屋（住宿） 、庭院家具（居家裝潢） 、農家樂、日式旅館、度假屋出租（住宿） 、退休規劃（銀行業） 、退休社區（房地產） 、觀鳥、健行和露營 (戶外活動) 或水族飼養"},{ta:"28-50 / 東區竹北 / 工程師汽車",proj:"LUCE VIVA",raw:"28-50 / 東區竹北 / 工程師汽車
-台元科技園區（+3 公里） ; 台積電三廠（+5 公里）, 新竹科學園區（+5 公里）
-Python（程式語言） 、軟體工程（資訊技術） 、程式語言（計算） 、 C語言、軟體開發（軟體） 、行動應用程式（軟體） 、開放原始碼軟體、電動車（交通工具） 、特斯拉汽車（交通工具） 、油電混合車（交通工具） 、洗車 (汽車零件和服務) 、汽車美容（交通工具） 或汽車保養（交通工具）、行業類別：資訊科技和技術服務
0127
+汽車維修廠（交通工具） 、鍍膜、油電混合動力車（交通工具） 、改裝車（交通工具） 、露營車 (旅遊觀光) 或自訂車款（交通工具）,"},{ta:"28-55 / 中山 / 商務貿易
",proj:"家悦美(副)",raw:"28-55 / 中山 / 商務貿易
-汐止五股高架段（+3 公里）, 台北市進出口商業同業公會（+3 公里）
-Business networking 、業務開發 (商業活動) 、國際貿易、進口（郵遞） 、出口貿易、 B2B（商業與財務） 、銷售管理 (商業活動) 、 Procurement 、商業（商業與財務） 、物流（商業與財務） 、供應鏈、經銷（商業） 、倉儲業（產業） 或企業家（商業與財務）
0130
+民族東路， 台北市（+3 公里） Taipei
+外語、價格、運輸和物流服務和組織 (商業和金融) 、開發潛在顧客 (行銷) 或商機 (商業和金融業)"},{ta:"30-60 / 桃園蘆竹 / 藝術品投資",proj:"家悦美(主)",raw:"30-60 / 桃園蘆竹 / 藝術品投資
-桃園藝文廣場（+3 公里）, 好市多Costco南崁店（+3 公里）
-藝術和音樂（藝術） 、當代藝術（視覺藝術） 、藝術展覽（視覺藝術） 、藝術品（視覺藝術） 、手工藝（工藝品） 、雕刻（藝術） 、寶石（金屬與礦物） 、裝飾風藝術、花卉（植物與花卉） 、投資（商業與財務） 、美國運通、納斯達克100指數、投資管理（投資） 、插花、資產管理 (商業和金融業) 、被動收入（商業與財務） 或收藏（興趣）"},{ta:"35-65 / 龍潭石門 / 投資證券美股",proj:"君品天玥",raw:"35-65 / 龍潭石門 / 投資證券美股
-龍潭渴望園區（+3 公里）, 大平里（+3 公里）, 龍潭交流道（+2 公里）
-證券交易所（投資） 、財務規劃（投資） 、股票市場（投資） 、被動收入（商業與財務） 、股份 (金融) 、投資管理（投資） 、股票經紀人 (投資) 、資產管理 (商業和金融業) 、私募基金、私募股權投資 (投資) 、 Tax preparation 、私人銀行服務、納斯達克100指數、道瓊斯工業平均指數或標準普爾500指數"},{ta:"30-65 / 北屯太平潭子 / 換工作搬遷",proj:"大城二月埕",raw:"30-65 / 北屯太平潭子 / 換工作搬遷
-洲際棒球場（+4 公里）, 潭子觀音媽祖廟（+4 公里）, 肥佬闆複合超市（+4 公里）
-職涯發展（工作機會） 、 Business networking 、領英、領導（社會觀念） 、專業發展（職業訓練） 、職涯（就業） 、商業領袖 (商業和金融) 、新家、房屋（房地產） 、起步房（房地產） 或上班族（流行文化）、行為：通勤者、生活要事：最近搬家或遠離家鄉
0130(加了之後很穩定)
+個人發展（個人身分） 、成人教育（職業訓練） 、在地美食（美食和餐飲） 或生產率, 行為：不與家人同住"},{ta:"35-65 / 龍潭石門 / 度假休閒品酒",proj:"君品天玥",raw:"35-65 / 龍潭石門 / 度假休閒品酒
-龍潭渴望園區（+3 公里）, 大平里（+3 公里）, 龍潭交流道（+2 公里）
-Boutique hotel 、品酒 (葡萄酒) 、酒莊 (葡萄酒) 、 Lifestyle Travel 、 Cultural travel 、葡萄園、度假村（旅遊觀光業） 、跨界休旅車、住宿加早餐酒店、遊輪（旅遊觀光業） 、都會車 (汽車) 、別墅（住宿） 、美國運通、精品咖啡 (咖啡) 、前菜或外匯市場（貨幣）"},{ta:"28-55 / 伸港鹿港龍井大肚 / 科技工業賺錢",proj:"至善人本",raw:"28-55 / 伸港鹿港龍井大肚 / 科技工業賺錢
龍井車站（+3 公里）, 大肚車站（+5 公里） ; 85。c鹿港鹿和店（+5 公里）, 伸港鄉立圖書館（+5 公里）
金錢（貨幣） 、財富（經濟） 、投資（商業與財務） 、收入（商業與財務） 、汽車（交通工具） 、電子商務（零售） 、股票（投資） 、羽球 (球拍類運動) 、酒精飲品（美食和餐飲） 、 591房屋交易網、排屋、連棟住宅（建築） 或 New Home,"},{ta:"35-65 / 苗桃竹 / 長輩休閒
",proj:"自然紅屋",raw:"35-65 / 桃竹苗 / 長輩休閒
-Taoyuan City; Hsinchu; Miaoli; Hsinchu City
-Outdoor Living 、農家樂、度假屋（住宿） 、水族飼養、觀鳥、釣魚（戶外活動） 、登山步道（健行） 、木工（手工藝） 、茶葉品牌 (食物和飲品) 、 RV Travel 、休旅車營地（露營） 、國家公園 (旅遊目的地) 、雕刻（藝術） 、園藝（戶外活動） 、水療（個人護理） 、麻將、中華文化或歷史（歷史）"},{ta:"30-50 / 北區 / 業務性質",proj:"LUCE VIVA",raw:"30-50 / 北區 / 業務性質
-北大路， 新竹市（+3 公里） Hsinchu City
-零售銀行業務（銀行業） 、業務開發 (商業活動) 、人壽保險（保險） 、保單（保險） 、證券（金融） 、信用卡（借貸） 、汽車業（產業） 、 Business networking 、行銷（商業與財務） 、行銷服務和組織 (行銷) 、直效營銷、財務顧問 (投資) 、 B2B（商業與財務） 、汽車經銷（零售業者） 、開發潛在顧客 (行銷) 或設計貿易展和專業組織 (貿易展)"},{ta:"28-55 / 林口 / 外商科技業",proj:"家悦美(副)",raw:"28-55 / 林口 / 外商科技業
-台灣艾司摩爾（+3 公里） ; 美商祥茂光電科技（+3 公里）
-新興技術（科學） 、 AI 、科技傳播學、科技新聞 (新聞服務) 、 http://geek.com/ 、基於組件的軟體工程、機器學習（計算） 、英語（語言） 、跨國公司、 IT諮詢、 International business 、半導體、物聯網、電光源、軟體工程（資訊技術） 或物理學 (物理學)、生活要事：遠離家鄉或不與家人同住
0202
+國際新聞 (新聞服務) 、消費電子展、科學媒體和內容 (科學) 或 Google開發人員, 行為：經常旅行的用戶"},{ta:"28-50 / 伸港鹿港龍井 / 建築生活品質",proj:"至善人本",raw:"28-50 / 伸港鹿港龍井 / 建築生活品質
-龍井車站（+4 公里） ; 85。c鹿港鹿和店（+4 公里）, 伸港鄉立圖書館（+5 公里）
-住宅房地產 (房地產) 、建材（工業材料和設備） 、結構工程、砌體結構、 Sustainable architecture 、整建（建築業） 、新聞媒體（新聞服務） 、建築媒體 (設計) 、家電品牌和零售商 (零售) 、居家裝飾 (室內裝潢) 、生活風格 (生活風格內容) 、生活品質（心理學） 、身心健康（心理學） 或營建管理"},{ta:"28-55 / 彰市和美 /  零售批發自營",proj:"坤辰師大苑",raw:"28-55 / 彰市和美 /  零售批發自營
-彰化果菜市場（+3 公里）, 彰化車站（+3 公里）, 大肚橋（+3 公里） ; 五鮮級鍋物專賣-和美白金店（+3 公里）
-商業模式 (商業和金融業) 、零售業（產業） 、批發（零售） 、供應鏈、獨資企業（商業與財務） 、經銷（商業） 、居家事業（商業與財務） 、小型企業（商業與財務） 、銀行帳戶 (銀行業) 、行銷企劃 (行銷) 、貿易（經濟） 、社群媒體行銷（行銷） 、網紅行銷 (行銷) 、網路購物（零售） 或電子商務（零售）
0211
+價格、配送（商務） 、節慶（活動） 或淘寶網"},{ta:"28-55 / 彰市和美 /  建築生活品質",proj:"坤辰師大苑",raw:"28-55 / 彰市和美 /  建築生活品質
-彰化果菜市場（+3 公里）, 彰化車站（+3 公里）, 大肚橋（+3 公里） ; 五鮮級鍋物專賣-和美白金店（+3 公里）
-住宅房地產 (房地產) 、建材（工業材料和設備） 、結構工程、 Sustainable architecture 、營建管理、砌體結構、整建（建築業） 、新聞媒體（新聞服務） 、建築媒體 (設計) 、居家用品零售商 (零售) 、家電品牌和零售商 (零售) 、生活品質（心理學） 、生活風格 (生活風格內容) 、自我照護（心理學） 或身心健康（心理學）"},{ta:"30-60 / 花壇大村 / 汽車貿易業者",proj:"鉅德富地",raw:"30-60 / 花壇大村 / 汽車貿易業者
-彰化花壇國小（+4 公里）, 大村鄉（+4 公里）
-連棟住宅（建築） 、批發（零售） 、電動車（交通工具） 、經銷（商業） 、出口貿易、二手車（交通工具） 、 Lexus 汽車（交通工具） 、賓士（交通工具） 、汽車業（產業） 、國際貿易、運輸（交通運輸） 、別墅（住宿） 、貿易（經濟） 、物流（商業與財務） 、 Nissan 汽車（交通工具） 、新聞媒體（新聞服務） 、進口（郵遞） 或汽車零件製造和銷售 (汽車)"},{ta:"28-50 / 東區北區 / 年輕買房",proj:"原潮APT",raw:"28-50 / 東區北區 / 年輕買房
-精武路（+3 公里）, 永興街， 台中市（+3 公里） Taichung
-Instagram（社群媒體） 、綜藝電視節目 (電視節目) 、表演藝術（表演藝術） 、演唱會（音樂活動） 、現場活動 (活動) 、節慶（活動） 、派對（活動） 、美妝網紅 (美妝) 、被動收入（商業與財務） 、低成本航空公司、股票市場（投資） 、時事（政治） 、房地產（產業） 或房屋（房地產）、行為：網紅創作者或餐飲創作者"},{ta:"28-55 / 竹南頭份 / 銀行保險業",proj:"八德盛景",raw:"28-55 / 竹南頭份 / 銀行保險業
-公義路， 竹南鎮（+3 公里）, 竹南光復路（+3 公里）, 兆豐國際商業銀行-頭份分行（+3 公里） Miaoli
-銀行業（金融） 、證券（金融） 、財務會計（商業與財務） 、財務規劃（投資） 、金融服務（商業與財務） 、外匯市場（貨幣） 、儲蓄（銀行業） 、業務開發 (商業活動) 、 Professional services 、個人理財（銀行業） 、人壽保險（保險） 、一般保險 (保險) 或開發潛在顧客 (行銷)、行業類別：商業與金融或行政服務
0312
+零售銀行業務（銀行業） 、 Business networking 、投資銀行業（銀行業） 或旅遊平安保險"},{ta:"30-55 / 龍井 / 零售批發自營
",proj:"敘uno",raw:"30-55 / 龍井 / 零售批發自營
-台中市龍井區（+3 公里）, 中彰大橋， 台中市（+3 公里）, 向上路六段， 台中市（+3 公里） Taichung
-零售業（產業） 、批發（零售） 、小型企業（商業與財務） 、居家事業（商業與財務） 、經銷（商業） 、供應鏈、銀行帳戶 (銀行業) 、貿易（經濟） 、電子商務（零售） 、行銷企劃 (行銷) 、社群媒體行銷（行銷） 、網紅行銷 (行銷) 、網路購物（零售） 、價格、商業模式 (商業和金融業) 、開發潛在顧客 (行銷) 或餐飲業（餐飲）、行為：通勤者"},{ta:"28-50 / 后里中科 / 科技業家庭",proj:"后麗18",raw:"28-50 / 后里中科 / 科技業家庭
-后里科技園區（+3 公里）, 神岡交流道， 台中市（+3 公里）, 科雅路， 台中市（+3 公里） Taichung
-物聯網、智慧科技 (消費電子產品) 、 iPhone（智慧型手機） 、房屋保險（保險） 、室內設計（設計） 、 591房屋交易網、排屋、連棟住宅（建築） 、家電（消費電子產品） 、傢俱（居家裝潢） 、一般保險 (保險) 、家務（家居和園藝用品） 、生活用品（家居和園藝用品） 、一般健康 (個人護理) 或美食家（美食和餐飲）
0312
+時尚設計（設計） 、商業智慧 (商業和金融業) 、酒精飲品（美食和餐飲） 或消費電子展"},{ta:"28-55 / 西屯精科 / 親子教育工業",proj:"佳瓚大讚",raw:"28-55 / 西屯精科 / 親子教育工業
-春安國小（+2 公里）, 精科五路， 台中市（+3 公里）, 五權西路三段， 台中市（+3 公里） Taichung
-上班族（流行文化） 、量販店（食品零售業者） 、親子教育（兒童和親子教育） 、家樂福、幼兒教育（小學和中學教育） 、教育（社會觀念） 、幼兒照護（兒童和親子教育） 、製造業（產業） 、婚姻（婚禮） 、代工生產、親子天下或製造生產服務和組織 (製造業)"},{ta:"30-45 / 西屯西區 / 業務性質
",proj:"原潮APT",raw:"30-45 / 西屯西區 / 業務性質
-水湳經貿園區（+3 公里）, 臺中市不動產仲介經紀商業同業公會（+3 公里）
-零售銀行業務（銀行業） 、業務開發 (商業活動) 、人壽保險（保險） 、保單（保險） 、證券（金融） 、信用卡（借貸） 、汽車業（產業） 、 Business networking 、行銷（商業與財務） 、行銷服務和組織 (行銷) 、直效營銷、財務顧問 (投資) 、 B2B（商業與財務） 、汽車經銷（零售業者） 、開發潛在顧客 (行銷) 或設計貿易展和專業組織 (貿易展)"},{ta:"30-60 / 桃園蘆竹 / 親子教育
",proj:"家悦美(主)",raw:"30-60 / 桃園蘆竹 / 親子教育
-桃園藝文廣場（+3 公里）, 好市多Costco南崁店（+3 公里）
-教育資源 (教育) 、教養方式 (兒童和親子教育) 、育兒雜誌 (媒體刊物) 、媽媽寶寶-懷孕、生產、育兒、親子教育（兒童和親子教育） 、新生兒派對（兒童和親子教育） 、嬰幼兒和孕婦用品店 (零售) 、在家教育（小學和中學教育） 、 LifeStyle Home 、繪畫（視覺藝術） 、家庭（社會觀念） 、運動類遊戲 (電玩遊戲) 、家庭桌遊 (遊戲) 或語言教育、家長：嬰幼兒家長（01-02 歲） 、學齡前兒童的家長（03-05 歲） 或低年級學童（06-08 歲）的家長
0310
+蒙台梭利教育法、兒童發展（小學和中學教育） 、樂器（樂器） 或親子 (雜誌)"},{ta:"30-50 / 草屯霧峰大里 / 通勤上班教育",proj:"水琉璃",raw:"30-50 / 草屯霧峰大里 / 通勤上班教育
-草屯鎮公有市場（+5 公里）, 霧峰健體中心（+5 公里）, 中投快速公路， 台中市（+3 公里） Taichung; 中投快速公路， Caotun Township（+16 公里） Nantou
-親子教育（兒童和親子教育） 、教育資源 (教育) 、課外活動、新聞媒體（新聞服務） 、製造生產服務和組織 (製造業) 、商業（商業與財務） 、人力資源管理（商業與財務） 、時事（政治） 、家務管理和整理 (居家和園藝用品) 、一般健康 (個人護理) 、本田汽車（交通工具） 或豐田汽車（交通工具）、行為：通勤者"},{ta:"28-55 / 大肚烏日/  建築生活品質
",proj:"坤辰師大苑",raw:"28-55 / 大肚烏日/  建築生活品質
-彰化果菜市場（+3 公里）, 彰化車站（+3 公里）, 大肚橋（+3 公里） ; 五鮮級鍋物專賣-和美白金店（+3 公里）
-住宅房地產 (房地產) 、建材（工業材料和設備） 、結構工程、 Sustainable architecture 、營建管理、砌體結構、整建（建築業） 、新聞媒體（新聞服務） 、建築媒體 (設計) 、居家用品零售商 (零售) 、家電品牌和零售商 (零售) 、生活品質（心理學） 、生活風格 (生活風格內容) 、自我照護（心理學） 或身心健康（心理學）、行業類別：建築與工程
0304
-烏日工業城（+3 公里）, 大肚橋（+3 公里）, 沙田路二段（+3 公里）
+五金行（零售業者） 、土木工程（工程） 、風險管理或木工 (興建和維修)"},{ta:"28-55 / 太平大里 /  藍領公教職",proj:"大興家園",raw:"28-55 / 太平大里 /  藍領公教職
-大里中興商圈（+2 公里）, 大里工業區（+3 公里）, 大源十九街， 台中市（+3 公里） Taichung
-師範教育（職業訓練） 、上班族（流行文化） 、技術員、工廠（製造業） 、保單（保險） 、存款帳戶 (銀行業) 、配電系統、代工生產、公共運輸（交通運輸） 、超市（食品零售業者） 、本日優惠（零售） 、教育資源 (教育) 、教養方式 (兒童和親子教育) 、節儉生活風格內容 (零售) 、 Retirement Insurance Benefits 、專業發展（職業訓練） 、退伍軍人福利（軍事） 或家務管理和整理 (居家和園藝用品)"},{ta:"30-60/ 中科中清/ 傳產製造食品加工",proj:"原潮APT",raw:"30-60/ 中科中清/ 傳產製造食品加工
-中清交流道-全國加油站（+3 公里）, 中科路， 台中市（+2 公里） Taichung
-上班族（流行文化） 、房屋（房地產） 、汽車美容（交通工具） 、飲食業、 591房屋交易網、工程（科學） 、倉儲業（產業） 、汽車經銷（零售業者） 、食品加工、汽車業（產業） 、製造業（產業） 、運輸（交通運輸） 、零部件市場、物流（商業與財務） 、房地產（產業） 、不動產（房地產） 或科技（電腦和電子產品）, 行為：使用 Facebook 的管道（行動裝置）：所有行動裝置或餐飲創作者"},{ta:"35-65 / 中彰投 / 企業主戶外",proj:"自然紅屋",raw:"35-65 / 中彰投 / 企業主戶外
-Taichung; Changhua; Nantou
-企業家（商業與財務） 、商業計畫 (商業活動) 、市場趨勢 (商業和金融業) 、 Prefabricated home 、建築媒體 (設計) 、居家風格和類型 (房地產) 、 RV Travel 、露營車 (旅遊觀光) 、休旅車營地（露營） 、生態旅遊（旅遊觀光） 或 Outdoor Living"},{ta:"35-65 / 桃竹苗 / 鄉村休閒
",proj:"自然紅屋",raw:"35-65 / 桃竹苗 / 鄉村休閒
-Taoyuan City; Hsinchu; Miaoli; Hsinchu City
Prefabricated home 、居家風格和類型 (房地產) 、生態旅遊（旅遊觀光） 、農家樂、拖掛式房車、農村、旅遊景點和活動 (旅遊觀光業) 、休閒活動（休閒） 、家庭（社會觀念） 、公園與遊憩、 Farm-to-table 或園藝（戶外活動）"},{ta:"30-55 / 后里豐原 /  零售批發自營
",proj:"后麗18",raw:"30-55 / 后里豐原 /  零售批發自營
-豐原商圈（+3 公里）, 甲后路二段， 台中市（+3 公里） Taichung; 龍貓隧道（+3 公里）
-商業模式 (商業和金融業) 、零售業（產業） 、批發（零售） 、經銷（商業） 、供應鏈、居家事業（商業與財務） 、小型企業（商業與財務） 、銀行帳戶 (銀行業) 、貿易（經濟） 、電子商務（零售） 、行銷企劃 (行銷) 、社群媒體行銷（行銷） 、網紅行銷 (行銷) 或網路購物（零售）"},{ta:"30-65 / 南投草屯霧峰 / 休閒園藝

南投中興草屯霧峰",proj:"寬心璽玥",raw:"30-65 / 南投草屯霧峰 / 休閒園藝
-南投中興高中（+3 公里）, 草屯敦和宮財神廟（+3 公里）, 農業部農業試驗所（+3 公里） ; 南投-南崗工業區（+3 公里）, 寶湖宮天地堂地母廟乾元殿（+4 公里）
-茶葉品牌 (食物和飲品) 、遊程承攬業、跟團旅行 (旅遊觀光) 、園藝工具 (花園和園藝造景) 、園藝（家居和園藝用品） 、露營車 (旅遊觀光) 、休旅車營地（露營） 、國家公園 (旅遊目的地) 、中華文化、登山步道（健行） 、節儉生活風格內容 (零售) 、咖啡豆（咖啡） 、均衡飲食（個人護理） 或葡萄酒相關內容 (食物和飲品), 感情狀況：已婚, 家長：父母（全部）
0309
-霧峰農工（+3公里）, 旭光高中（+3 公里）, 南投中興高中（+3 公里） ; 南投-南崗工業區（+3 公里）"},{ta:"28-55 / 苗栗(市區苑裡) / 居家裝飾設計",proj:"臻富裕",raw:"28-55 / 苗栗(市區苑裡) / 居家裝飾設計
-群翼室內裝修設計（+5 公里）, 安百玉室內設計 Anbaiyu Design（+6 公里）, 輕井澤-康勝建設康宏建設（+5 公里）
-居家飾品 (居家裝潢) 、居家裝飾 (室內裝潢) 、居家裝潢構想 (室內裝潢) 、室內裝潢品牌和零售商 (零售) 、百葉簾、現代家具（居家裝潢） 、生活風格 (生活風格內容) 、北歐風設計（建築） 、建築媒體 (設計) 、室內設計（設計） 、窗戶（建築） 或房地產（產業）
0325
-Miaoli County"},{ta:"30-60 / 嶺東烏日南區 / 行銷人力管理",proj:"富旺商城",raw:"30-60 / 嶺東烏日南區 / 行銷人力管理
-新烏日車站（+5 公里）, 嶺東科技大學（+3 公里）, 大慶夜市（+3 公里）, 文心森林公園站（+3 公里）
-高階管理人員、行銷企劃 (行銷) 、商機 (商業和金融業) 、社群媒體行銷（行銷） 、購物中心（零售） 、銷售管理 (商業活動) 、開發潛在顧客 (行銷) 、行銷策略（行銷） 、零售業（產業） 、服裝（服飾） 、共用工作空間、商業領袖 (商業和金融) 、小型企業（商業與財務） 、時尚（流行文化） 或人力資源管理（商業與財務）"},{ta:"30-60 / 林口五股新莊 / 金融投資",proj:"家悦美(主)",raw:"30-60 / 林口五股新莊 / 金融投資
-林口長庚研究大樓（+4 公里） ; 新樹路310巷， 新北市（+3 公里）, 中正北路560巷， 新北市（+5 公里） New Taipei City
-金融市場（投資） 、交易策略（投資） 、金錢（貨幣） 、金融經濟學、財經（商業與財務） 、金融服務（商業與財務） 、金融分析、被動收入（商業與財務） 、投資管理（投資） 、股票市場（投資） 、投資（商業與財務） 、投資者（投資） 、不動產（房地產） 、收入（商業與財務） 或投資報酬率（投資）"},{ta:"30-60 / 草屯南投 / 汽車工業",proj:"水琉璃",raw:"30-60 / 草屯南投 / 汽車工業
-草屯鎮公有市場（+5 公里） ; 南投-南崗工業區（+3 公里）, 中研路， 南投市（+3 公里） Nantou
-汽車業（產業） 、二手車（交通工具） 、汽車經銷（零售業者） 、汽車零件製造和銷售 (汽車) 、卡車（交通工具） 、批發（零售） 、製造生產服務和組織 (製造業) 、建築工程、土木工程（工程） 、居家裝修（家居和園藝用品） 、金屬、一般保險 (保險) 、儲蓄（銀行業） 或酒精飲品（美食和餐飲）"},{ta:"30-50 / 北屯潭子 / 自由業",proj:"原潮APT",raw:"30-50 / 北屯潭子 / 自由業
-洲際棒球場（+3 公里）, 潭子觀音媽祖廟（+3 公里）
-自由工作者（工作機會） 、業務開發 (商業活動) 、 Business networking 、創意創業 (商業和金融業) 、開發潛在顧客 (行銷) 、個人發展（個人身分） 、攝影師（攝影） 、設計（設計） 、居家辦公家具 (居家裝潢) 、 Project management software 、影音俱樂部、 MacBook 、 Canva 、生產率或網路銀行（銀行業）"},{ta:"30-55 / 北斗田尾 / 公務員教育",proj:"羣昱馥昕2",raw:"30-55 / 北斗田尾 / 公務員教育
-田尾國小（+3 公里）, 北斗工業區（+3 公里）
-親子教育（兒童和親子教育） 、人壽保險（保險） 、家庭（社會觀念） 、教養方式 (兒童和親子教育) 、教育技術學（教育） 、政府機關概念和作法 (法律和政府) 、銀行業（金融） 、均衡飲食（個人護理） 、社區議題（法律與政府） 、健身和保健（健身） 或新聞媒體（新聞服務）"},{ta:"28-55 / 台中(北屯豐原) / 家具零售",proj:"臻富裕",raw:"28-55 / 台中(北屯豐原) / 家具零售
-洲際棒球場（+5 公里）, 豐原車站（+5 公里）
-現代家具（居家裝潢） 、百葉簾、居家裝潢構想 (室內裝潢) 、室內裝潢品牌和零售商 (零售) 、宜家家居（零售業者） 、 Workinghouse 生活工場、大創百貨、家樂福、網路購物網站 (網站) 、 momo購物網、居家裝修（家居和園藝用品） 、住家翻新 (住家修繕) 或整建（建築業）"},{ta:"30-55 / 伸港鹿港線西 / 傳產代工家庭",proj:"至善人本",raw:"30-55 / 伸港鹿港線西 / 傳產代工家庭
-85。c鹿港鹿和店（+5 公里）, 鹿工路， 鹿港鎮（+3 公里）, 彰濱工業區 線西區（+3 公里）, 彰新路七段， Shenkang, T'Ai-Wan, Taiwan（+5 公里） Changhua
-連棟住宅（建築） 、批發（零售） 、出口貿易、排屋、進口（郵遞） 、紡織品、化學工業、玻璃、生物可分解塑膠、汽車業（產業） 、居家事業（商業與財務） 、 B2B（商業與財務） 、 Procurement 、代工生產或會計學（商業與財務）"},{ta:"30-55 / 伸港和美 / 五金自營商",proj:"至善人本",raw:"30-55 / 伸港和美 / 五金自營商
-台中商銀和美分行（+5 公里） ; 彰新路七段， Shenkang, T'Ai-Wan, Taiwan（+5 公里） Changhua
-連棟住宅（建築） 、批發（零售） 、排屋、代工生產、 B2B（商業與財務） 、五金行（零售業者） 、零部件市場、製造業（產業） 、不鏽鋼、水管修繕（建築業） 、金屬加工（建築業） 、建材（工業材料和設備） 、居家裝修（家居和園藝用品） 、住家翻新 (住家修繕) 或傢俱（居家裝潢）、行為：小型企業主
0409
+電力、改裝車（交通工具） 或配電系統、行為：小型企業主或通勤者"},{ta:"35-55 / 中清洲際 / 老闆高管",proj:"家羽醇華",raw:"35-55 / 中清洲際 / 老闆高管
-中清路二段（+2 公里）, 洲際棒球場（+2 公里）
-高淨值人士（商業與財務） 、佳士得、 Art auction 、精品 (生活風格內容) 、路易威登（時尚品牌） 、愛馬仕（服飾） 、藝術展覽（視覺藝術） 、勞力士（手錶） 、商業領袖 (商業和金融) 、高階管理人員、保時捷、賓士（交通工具） 、管理（商業與財務） 、投資策略（投資） 、私人銀行服務或企業家（商業與財務）"},{ta:"30-60 / 北屯太平潭子 / 餐廳零售業
",proj:"大城二月埕",raw:"30-60 / 北屯太平潭子 / 餐廳零售業
-洲際棒球場（+3 公里）, 74太平松竹路（+3 公里）, 潭子觀音媽祖廟（+3 公里）
-休閒餐廳 (餐廳) 、管理（商業與財務） 、食品和飲品 (食物和飲品) 、咖啡文化 (咖啡) 、烹飪學（美食和餐飲） 、中式料理（美食和餐飲） 、韓式料理（美食和餐飲） 、日本料理（美食和餐飲） 、零售業（產業） 、業務開發 (商業活動) 、社群媒體行銷（行銷） 、廚具（廚房與餐廚） 或節慶（活動）、行為：Instagram 商業檔案管理員、生活要事：不與家人同住
0324
+台灣菜或 LifeStyle Food, 行為：美食與餐廳類粉絲專頁管理員"},{ta:"35-55 / 西屯水湳 / 金融投資",proj:"家羽醇華",raw:"35-55 / 西屯水湳 / 金融投資
-水湳經貿園區（+2 公里）, 龍富路五段+龍富二十二路路口（+2 公里）
-金融市場（投資） 、金融經濟學、交易策略（投資） 、被動收入（商業與財務） 、投資管理（投資） 、資產管理 (商業和金融業) 、納斯達克100指數、倫敦證券交易所 (投資) 、美國運通、現金、特斯拉汽車（交通工具） 、 NVIDIA GeForce 、住宅房地產 (房地產) 、房地產（產業） 或黃金（金屬與礦物）"},{ta:"30-55 / 竹科關埔 / 精品私校教育
",proj:"元方學府首席1",raw:"30-55 / 竹科關埔 / 精品私校教育
-新竹巨城（+3 公里）, 關埔特區（+3 公里）
-蒙台梭利教育法、私立學校（教育） 、國際學校（小學和中學教育） 、 Bilingual education 、樂器（樂器） 、藝術和音樂（藝術） 、兒童發展（小學和中學教育） 、精品（零售） 、精品 (生活風格內容) 、園藝（家居和園藝用品） 、豪華轎車（交通工具） 、露台（園藝） 、股票市場（投資） 或高淨值人士（商業與財務）"},{ta:"30-50 / 大台中 / 金融投資",proj:"原潮APT",raw:"30-50 / 大台中 / 金融投資
-台中中央公園（+8 公里）
-金融經濟學、投資管理（投資） 、交易策略（投資） 、被動收入（商業與財務） 、外匯市場（貨幣） 、黃金（金屬與礦物） 、石油、股票（投資） 、新聞媒體（新聞服務） 、半導體、精品（零售） 、航空公司、家庭自動化（消費電子產品） 或一般保險 (保險)"},{ta:"30-50 / 鹿港和美 / 零售批發自營",proj:"坤辰師大苑",raw:"30-50 / 鹿港和美 / 零售批發自營
-台中商銀和美分行（+4 公里） ; 85。c鹿港鹿和店（+4 公里）
-小型企業（商業與財務） 、商業模式 (商業和金融業) 、零售業（產業） 、批發（零售） 、產品（公司） 、經銷（商業） 、供應鏈、居家事業（商業與財務） 、電子商務（零售） 、自僱（工作機會） 、貿易（經濟） 、行銷（商業與財務） 、網路廣告（行銷） 、價格或節慶（活動）
0401
-台中商銀和美分行（+4 公里） ; 85。c鹿港鹿和店（+4 公里）, 精誠夜市（+4 公里）
+直運（零售業者） 或會計學（商業與財務）, 行為：商家的粉絲專頁管理員"},{ta:"**30-60 / 新北三重 / 科技業+旅遊
",proj:"家悦美(主)",raw:"**30-60 / 新北三重 / 科技業+旅遊
-新北產業園區（+5 公里）, 三重捷運站（+5 公里）
-人工智慧（計算） 、房屋（房地產） 、旅遊網站（網站） 、大數據 (科學) 、免稅商店、智慧科技 (消費電子產品) 、高科技（電腦和電子產品） 、新興技術（科學） 、飯店（住宿） 、房地產（產業） 、 Hotels.com（住宿） 、旅遊（旅遊觀光） 、 Trivago 或 Booking.com（旅遊觀光業）"},{ta:"30-55 / 大埤斗南 / 食品代工",proj:"中祐雅苑",raw:"30-55 / 大埤斗南 / 食品代工
-豐田工業區（+4 公里）, 斗南車站（+3 公里）
-工廠（製造業） 、連棟住宅（建築） 、自僱（工作機會） 、代工生產、製造生產服務和組織 (製造業) 、食品產業、食品加工、化學、環境科學（科學） 、包裝和標籤（商業與財務） 、急凍食品、飲料（美食和餐飲） 、批發（零售） 、物流（商業與財務） 或一般保險 (保險)"},{ta:"30-60 / 北區東區 / 教育/投資",proj:"元方大景首席",raw:"30-60 / 北區東區 / 教育/投資
-新竹好市多（+4 公里）, 湳雅公園（+4 公里）
-閱讀（傳播） 、教育（社會觀念） 、學習（教育） 、課程（教育） 、學校（教育） 、文學（藝術） 、室內設計（設計） 、電子書（媒體刊物） 、個人理財（銀行業） 、財務規劃（投資） 、股票（投資） 、書籍（媒體刊物） 或房地產投資（投資）"},{ta:"30-60 / 東區竹東 / 研究/高知識/綠生活",proj:"元方大景首席",raw:"30-60 / 東區竹東 / 研究/高知識/綠生活
-新竹好市多（+4 公里）, 竹東工研院（+4 公里）
-研究、科學 (期刊) 、高等教育（教育） 、教育新聞 (教育) 、自然科學、哲學、研究所教育（高等教育） 、財經（商業與財務） 、文學（藝術） 、實驗室、新興技術（科學） 、大眾媒體（娛樂與媒體） 、工程和理工學院 (教育) 、數學、植物園、森林生態學或觀賞植物（植物與花卉）"},{ta:"30-55 / 伸港鹿港線西 / 科技家庭自住",proj:"至善人本",raw:"30-55 / 伸港鹿港線西 / 科技家庭自住
-85。c鹿港鹿和店（+5 公里）, 鹿工路， 鹿港鎮（+3 公里）, 彰濱工業區 線西區（+3 公里）, 彰新路七段， Shenkang, T'Ai-Wan, Taiwan（+5 公里） Changhua
-一般健康 (個人護理) 、生活用品（家居和園藝用品） 、家務（家居和園藝用品） 、家電（消費電子產品） 、傢俱（居家裝潢） 、一般保險 (保險) 、房屋（房地產） 、 591房屋交易網、室內設計（設計） 、房屋保險（保險） 、排屋、連棟住宅（建築） 、 iPhone（智慧型手機） 、物聯網或智慧科技 (消費電子產品)"},{ta:"(test)30-55/中科水湳中清/房地產/股票
",proj:"原潮APT",raw:"(test)30-55/中科水湳中清/房地產/股票
-水湳中央公園（+2 公里）, 中清交流道（+2 公里）, 中科路， 台中市（+3 公里）
-房地產（產業） 、住宅房地產 (房地產) 、 591房屋交易網、不動產（房地產） 、股市指數期貨 (商業金融) 、股票（投資） 、財務規劃（投資） 、證券（金融） 、股票經紀人 (投資) 或交易策略（投資）"},{ta:"(test)30-55/中科水湳中清/房地產/股票
",proj:"原潮APT",raw:"(test)30-55/中科水湳中清/在地餐飲/服務業
-水湳中央公園（+2 公里）, 中清交流道（+2 公里）, 中科路， 台中市（+3 公里） Taichung
-顧客服務（商業與財務） 、餐飲業（餐飲） 、 Restaurant management 、商業模式 (商業和金融業) 、食品保存、飲料（美食和餐飲） 、中式料理（美食和餐飲） 、咖啡文化 (咖啡) 、在地美食（美食和餐飲） 、早午餐（美食和餐飲） 或輪班工作制（商業與財務）"},{ta:"30-60 / 新北三重 / 資訊/金融期貨",proj:"家悦美(主)",raw:"30-60 / 新北三重 / 資訊/金融期貨
-新北產業園區（+5 公里）, 三重捷運站（+5 公里）
-資訊科技（電腦和電子產品） 、資料管理 (軟體) 、資料分析 (商業和金融業) 、資料視覺化 (科學) 、機器學習（計算） 、防毒軟體、金融經濟學、投資管理（投資） 、股票（投資） 、被動收入（商業與財務） 、黃金（金屬與礦物） 、石油、半導體、精品（零售） 、航空公司、家庭自動化（消費電子產品） 或交易策略（投資）"},{ta:"30-60 / 林口蘆竹 / 精品/藝術品/投資",proj:"家悦美(主)",raw:"30-60 / 林口蘆竹 / 精品/藝術品/投資
-林口 三井（+4 公里） ; 蘆竹光明河濱公園（+4 公里）
-藝術和音樂（藝術） 、當代藝術（視覺藝術） 、藝術展覽（視覺藝術） 、藝術品（視覺藝術） 、雕刻（藝術） 、寶石（金屬與礦物） 、裝飾風藝術、花卉（植物與花卉） 、美國運通、納斯達克100指數、投資管理（投資） 、插花、被動收入（商業與財務） 、收藏（興趣） 、石英、黃金（金屬與礦物） 、精品（零售） 或房地產（產業）"},{ta:"30-65/南興公園+6/金融投資",proj:"景立方層峰-主",raw:"30-65/南興公園+6/金融投資
-南興公園（+6 公里）
-金融經濟學、投資管理（投資） 、交易策略（投資） 、被動收入（商業與財務） 、外匯市場（貨幣） 、黃金（金屬與礦物） 、石油、股票（投資） 、新聞媒體（新聞服務） 、半導體、精品（零售） 、航空公司、家庭自動化（消費電子產品） 或一般保險 (保險)"},{ta:"30-60 / 員林埔心 / 軍公教/教育
(參考後台30-65/員林 永靖/軍公教 重教育家長 )",proj:"坤悅原鄰薈",raw:"30-60 / 員林埔心 / 軍公教/教育
-員林市（+5 公里）, 彰化縣埔心鄉公所（+4 公里）
-戶外休閒活動（戶外活動） 、歌唱（音樂） 、退伍軍人福利（軍事） 、表演藝術（表演藝術） 、圖書館、假期（活動） 、教育技術學（教育） 、時事（政治） 、英語（語言） 、婚禮（社會觀念） 、師範教育（職業訓練） 、政府（政府機構） 、 YouTube（串流服務） 、休旅車（交通工具） 或掀背車（交通工具）"},{ta:"30-65/南興公園+6/置產/醫師/高管",proj:"景立方層峰-主",raw:"30-65/南興公園+6/置產/醫師/高管
-南興公園（+6 公里）
-閱讀（傳播） 、中小型企業（商業與財務） 、個人理財（銀行業） 、金融服務（商業與財務） 、生物技術、特斯拉汽車（交通工具） 、股票（投資） 、房地產開發（房地產） 、健身和保健（健身） 、生物學（科學） 、書籍（媒體刊物） 、醫學院 (高等教育) 、房地產（產業） 或管理（商業與財務）"},{ta:"30-65/南興公園+6/政治/置產/科技",proj:"景立方層峰-副",raw:"30-65/南興公園+6/政治/置產/科技
-南興公園（+6 公里）
人工智慧（計算） 、房屋（房地產） 、社會運動（社會公益理念） 、金融市場（投資） 、個人理財（銀行業） 、大數據 (科學) 、機器學習（計算） 、 iPad 、被動收入（商業與財務） 、時事（政治） 、股票（投資） 、 MacBook Pro 、房地產投資（投資） 、政府機關概念和作法 (法律和政府) 、金融經濟學、政治和社會議題 (政治) 或地緣政治學"},{ta:"35-65 / 青埔竹科 / 金融投資",proj:"新大墨",raw:"35-65 / 青埔竹科 / 金融投資
-青埔（+5 公里） ; 竹北台元科技園區（+5 公里）, 竹北高鐵（+2 公里）
-金融市場（投資） 、金融經濟學、交易策略（投資） 、投資管理（投資） 、資產管理 (商業和金融業) 、納斯達克100指數、倫敦證券交易所 (投資) 、美國運通、現金、特斯拉汽車（交通工具） 、英偉達、住宅房地產 (房地產) 、房地產（產業） 或黃金（金屬與礦物）"},{ta:"30-60 / 彰市 / 自營商/醫律/投資",proj:"坤悅原鄰薈",raw:"30-60 / 彰市 / 自營商/醫律/投資
-彰化車站（+5 公里）
-法律分支 (法律和政府) 、室內設計（設計） 、律師事務所 (法律和法律諮詢服務) 、批發（零售） 、供應鏈、個人理財（銀行業） 、經銷（商業） 、出口貿易、電子商務（零售） 、食品產業、生物學（科學） 、投資（商業與財務） 、醫學院 (高等教育) 、房地產（產業） 、居家事業（商業與財務） 、財產保險或零售業（產業）、行為：小型企業主"},{ta:"30-55/中科水湳中清/科技自營商A",proj:"原潮APT",raw:"30-55/中科水湳中清/科技自營商A
-水湳中央公園（+2 公里）, 中清交流道（+2 公里）, 中科路， 台中市（+3 公里） Taichung
-人工智慧（計算） 、自動化技術、資訊科技（電腦和電子產品） 、 591房屋交易網、工程（科學） 、力學、金屬、時事（政治） 、電機工程（工程） 、高科技（電腦和電子產品） 、機械工程（工程） 、電子工程、消費電子產品（電腦和電子產品） 、科技（電腦和電子產品） 或資訊, 行為：科技早期採用者,"},{ta:"30-55/十期+8/科技新貴/旅遊",proj:"原潮APT",raw:"30-55/十期+8/科技新貴/旅遊
-太原車站（+8 公里）, 頭家厝菜市場（+8 公里）
-人工智慧（計算） 、房屋（房地產） 、大數據 (科學) 、圖形處理器、航空公司、高科技（電腦和電子產品） 、旅遊（產業） 、 http://hotels.com/（住宿） 、 http://booking.com/（旅遊觀光業） 或房地產（產業）"},{ta:"",proj:"",raw:"28-55 / 南區東區太平 / 網紅行銷 美食
-臺中火車站（+3 公里）, 精武路（+3 公里）, 建國北黃昏市場（+5 公里）
-行銷企劃 (行銷) 、社群媒體行銷（行銷） 、網紅行銷 (行銷) 、病毒營銷、開發潛在顧客 (行銷) 、 Instagram（社群媒體） 、網路廣告（行銷） 、速食休閒餐廳 (餐廳) 、烘培坊（烘焙食品） 、鮭魚、 Apple Music 、 YouTube（串流服務） 、行動支付（貨幣） 、韓式料理（美食和餐飲） 或蛋糕（烘焙食品）"},{ta:"",proj:"",raw:"27-55 / 十期 / 行銷設計
-太原車站（+3 公里）, 頭家厝菜市場（+3 公里）
-室內設計（設計） 、行銷企劃 (行銷) 、數位行銷（行銷） 、折扣商店（零售） 、綜藝節目 (表演藝術) 、傢俱（居家裝潢） 、韓國電視劇（電視節目） 、網紅行銷 (行銷) 、網路購物（零售） 、居家裝潢零售商 (零售) 、廣告（行銷） 、設計（設計） 、政府（政府機構） 、網路 (電腦運算) 、平面設計（視覺藝術） 或服裝（服飾）"},{ta:"",proj:"",raw:"25-55 / 大台中 /百葉簾 家具
-台中中央公園（+8 公里）, 台中IKEA旗艦店（+8 公里）, 臺中市港區藝術中心（+8 公里）
-傢俱（居家裝潢） 、居家裝修（家居和園藝用品） 、室內設計（設計） 、現代家具（居家裝潢） 、百葉簾、窗戶（建築） 、宜家家居（零售業者） 、居家飾品 (居家裝潢) 、居家裝潢零售商 (零售) 、美學（哲學） 或住家修繕（居家裝修）
1208
-華山文創（+20 公里） ; 桃園車站（+20 公里） ; 台中中央公園（+20 公里）, 彰化車站（+20 公里） ; 北新竹車站（+20 公里）
+ Procurement 、生活風格 (生活風格內容) 、居家用品零售商 (零售) 、 LifeStyle Home 、室內建築（建築） 、住家翻新 (住家修繕) 或 Architecture & Interior Design"},{ta:"",proj:"",raw:"35-60 / 中部 / 露營興趣
-台中中央公園（+20 公里）, FAMWOOD 自然紅屋（+20 公里） ; 彰化員林（+20 公里）
-納入：興趣：Outdoor Living 、戶外休閒活動（戶外活動） 、生態旅遊（旅遊觀光） 、自然攝影 (攝影) 、野餐 (食品和飲料) 、居家裝修（家居和園藝用品） 、露營（戶外活動） 、大自然（科學） 、自助旅行 (旅遊) 、露營車 (旅遊觀光) 、草地（園藝） 、 Lifestyle Travel 或 Weekend Getaway
0108
+休旅車營地（露營）  、自助旅行 (旅遊) 、 Prefabricated home 、居家風格和類型 (房地產)"},{ta:"",proj:"",raw:"30-60 / 和美 國道1 / 傳產 公務員
1.地點：和美高中（+5 公里）, 烏日工業城（+5 公里）, 大肚橋（+5 公里） ; 精誠夜巿（+5 公里）
2.興趣：住家修繕（居家裝修） 、保養、維修和操作（建築業） 、製造業（產業） 、物流（商業與財務） 、工廠（製造業） 、機械加工、工具機 (興建和維修) 、批發（零售） 、機器、經銷（商業） 、房屋（房地產） 、 591房屋交易網、上班族（流行文化） 或社群媒體（網路媒體）"},{ta:"",proj:"",raw:"加工出口工廠、製造業（產業） 、食品產業、紡織工業、投資（商業與財務） 、房地產（產業） 、投資報酬率（投資） 、批發（零售） 、新聞媒體（新聞服務） 、時事（政治） 、網路購物（零售） 或個人理財（銀行業）"},{ta:"",proj:"",raw:"591房屋交易網、不動產（房地產）、公寓大樓（房地產）、住宅區（房地產）、金融服務（商業與財務）、金錢（貨幣）、促銷（行銷）、政府（政府機構）、團購、證券（金融）、銀行業（金融）、教育、優惠券"},{ta:"",proj:"",raw:"28-55 / 鹿港和美福興 / 藍領 銀行保險
-和美高中（+5 公里）, 7-11福環門市（+5 公里） ; 鹿港老街（+5 公里）
-保險（商業與財務） 、保單（保險） 、人壽保險（保險） 、業務（商業與財務） 、零售銀行業務（銀行業） 、投資銀行業（銀行業） 、銀行業（金融） 、金融服務（商業與財務） 、證券交易所（投資） 、股市指數 (投資) 、技術員、製造業（產業） 、製造生產服務和組織 (製造業) 、工廠（製造業） 、股票經紀人 (投資) 、配電系統、代工生產、上班族（流行文化） 或熱門話題"},{ta:"",proj:"",raw:"28-55 / 鹿港和美福興 / 年輕 育兒 首購
-和美高中（+5 公里）, 7-11福環門市（+5 公里） ; 鹿港老街（+5 公里）
-媽媽寶寶-懷孕、生產、育兒、新生兒派對（兒童和親子教育） 、家庭（社會觀念） 、上班族（流行文化） 、 LINE 、傢俱（居家裝潢） 、室內設計（設計） 、熱門話題、淘寶網、網路購物網站 (網站) 、流行文化（社會觀念） 、促銷（行銷） 、婚禮（社會觀念） 、美容（社會觀念） 、 iPhone（智慧型手機） 、個人理財（銀行業） 、 591房屋交易網或房地產（產業）"},{ta:"",proj:"",raw:"28-60 / 伸港鹿港龍井大肚 / 有小孩寵物
-龍井車站（+3 公里）, 大肚車站（+3 公里） ; 85。c鹿港鹿和店（+5 公里）, 伸港鄉立圖書館（+5 公里）
-家庭（社會觀念） 、親子教育（兒童和親子教育） 、廚房（家居和園藝用品） 、室內設計（設計） 、現代家具（居家裝潢） 、家電（消費電子產品） 、幼兒教育（小學和中學教育） 、生活用品（家居和園藝用品） 、運動（體育運動） 、暑假（小學和中學教育） 、草地（園藝） 、任天堂 (遊戲機和相關配件) 、寵物食品（寵物用品） 、狗狗美容（寵物） 、犬隻健康（寵物） 、遛狗（狗狗） 、貓糧（寵物用品） 、排屋、住宅區（房地產） 或別墅（住宿）"},{ta:"",proj:"",raw:"28-55 / 南區東區太平 / 年輕創業 
-臺中火車站（+3 公里）, 精武路（+3 公里）, 建國北黃昏市場（+5 公里）
-自由工作者（工作機會） 、居家事業（商業與財務） 、被動收入（商業與財務） 、自僱（工作機會） 、女性企業家（商業與財務） 、獨資企業（商業與財務） 、創意創業 (商業和金融業) 、美學（哲學） 、設計（設計） 、美容（社會觀念） 、商業模式 (商業和金融業) 、行銷企劃 (行銷) 、攝影師（攝影） 、角蛋白、髮型（護髮保養） 、室內設計（設計） 、零售業（產業） 或商業計畫 (商業活動)、行為：小型企業主"},{ta:"",proj:"",raw:"28-55 / 南區東區太平 / 餐廳 串流媒體
-臺中火車站（+3 公里）, 精武路（+3 公里）, 建國北黃昏市場（+5 公里）
-速食休閒餐廳 (餐廳) 、簡餐館（餐廳） 、甜點（美食和餐飲） 、在地美食（美食和餐飲） 、烘培坊（烘焙食品） 、火鍋、燒烤（烹飪） 、韓式料理（美食和餐飲） 、美食家（美食和餐飲） 、壽司（美食和餐飲） 、鮭魚、 Netflix（串流服務） 、 Spotify（串流服務） 、 Apple Music 、 YouTube（串流服務） 、 UberEATS 或行動支付（貨幣）"},{ta:"",proj:"",raw:"27-55 / 西屯中科水湳 / 會計 金融顧問
-水崛頭公園（+3 公里）, 水湳經貿園區（+3 公里）, 統聯中港轉運站 U Bus（+3 公里）
-財經（商業與財務） 、金錢（貨幣） 、被動收入（商業與財務） 、投資管理（投資） 、財務規劃（投資） 、資產管理 (商業和金融業) 、投資銀行業（銀行業） 、經濟學（經濟） 、會計系統、註冊會計師、私人銀行服務、財務顧問 (投資) 、會計學（商業與財務） 、納斯達克100指數、當沖交易（投資） 或私募基金、私募股權投資 (投資)
1016-註冊會計師、投資銀行業（銀行業） 、金錢（貨幣） 、電腦運算、財經（商業與財務） 、會計學（商業與財務） 、財務規劃（投資） 、財務顧問 (投資) 、被動收入（商業與財務） 、投資管理（投資） 、私募基金、私募股權投資 (投資) 、納斯達克100指數、會計系統、財務會計（商業與財務） 、資產管理 (商業和金融業) 、商業（商業與財務） 、房地產投資（投資） 或經濟學（經濟）
1023-註冊會計師、投資銀行業（銀行業） 、電腦運算、會計學（商業與財務） 、財務規劃（投資） 、財務顧問 (投資) 、被動收入（商業與財務） 、投資管理（投資） 、私募基金、私募股權投資 (投資) 、納斯達克100指數、會計系統、財務會計（商業與財務） 、資產管理 (商業和金融業) 、商業（商業與財務） 、房地產投資（投資） 、經濟學（經濟） 、財富管理（銀行業） 、當沖交易（投資） 、道瓊斯工業平均指數、證券交易所（投資） 或股份 (金融)"},{ta:"",proj:"",raw:"28-60 / 伸港鹿港 / 科技質感興趣
-85。c鹿港鹿和店（+5 公里）, 伸港鄉立圖書館（+5 公里）
- iPhone（智慧型手機） 、 Apple Watch（消費電子產品） 、智慧科技 (消費電子產品) 、穿戴式科技（消費電子產品） 、新興技術（科學） 、物聯網、商業智慧 (商業和金融業) 、網路購物（零售） 、時尚設計（設計） 、室內設計（設計） 、時尚配件（飾品配件） 、現代家具（居家裝潢） 、宜家家居（零售業者） 、時事（政治） 、美食（美食和餐飲） 、排屋或連棟住宅（建築）"},{ta:"",proj:"",raw:"30-55 / 伸港和美彰化 / 軍公教
-伸港國中第二校區（+3 公里）, 和美高中（+3 公里）, 大道國中（+3 公里）, 彰化車站（+3 公里）
-教育（社會觀念） 、學習（教育） 、書籍（媒體刊物） 、新聞媒體（新聞服務） 、學校（教育） 、社區議題（法律與政府） 、家庭（社會觀念） 、均衡飲食（個人護理） 、健康和保健（個人護理） 、社群媒體（網路媒體） 或政府機關概念和作法 (法律和政府)"},{ta:"",proj:"",raw:"28-60 / 伸港鹿港龍井大肚 / 科技家庭自住
-龍井車站（+3 公里）, 大肚車站（+5 公里） ; 85。c鹿港鹿和店（+5 公里）, 伸港鄉立圖書館（+5 公里）
-一般健康 (個人護理) 、（美食和餐飲） 、生活用品（家居和園藝用品） 、家務（家居和園藝用品） 、家電（消費電子產品） 、傢俱（居家裝潢） 、一般保險 (保險) 、房屋（房地產） 、 591房屋交易網、室內設計（設計） 、房屋保險（保險） 、排屋、連棟住宅（建築） 、 iPhone（智慧型手機） 、物聯網或智慧科技 (消費電子產品)"},{ta:"",proj:"",raw:"28-60 / 伸港鹿港和美 / 零售批發自營
-台中商銀和美分行（+5 公里） ; 85。c鹿港鹿和店（+5 公里）, 伸港鄉立圖書館（+5 公里）
-商業模式 (商業和金融業) 、零售業（產業） 、批發（零售） 、經銷（商業） 、供應鏈、居家事業（商業與財務） 、小型企業（商業與財務） 、銀行帳戶 (銀行業) 、貿易（經濟） 、電子商務（零售） 、行銷企劃 (行銷) 、社群媒體行銷（行銷） 、網紅行銷 (行銷) 或網路購物（零售）
1126
-台中商銀和美分行（+5 公里） ; 築間幸福鍋物 彰化自強店（+3 公里）, 85。c鹿港鹿和店（+5 公里）, 伸港鄉立圖書館（+5 公里）
-小型企業（商業與財務） 、銀行帳戶 (銀行業) 、行銷企劃 (行銷) 、批發（零售） 、經銷（商業） 、電子商務（零售） 、商業模式 (商業和金融業) 、網路購物（零售） 、社群媒體行銷（行銷） 、網紅行銷 (行銷) 、居家事業（商業與財務） 、零售業（產業） 、物聯網、排屋、連棟住宅（建築） 、火鍋、速食休閒餐廳 (餐廳) 或 Apple Watch（消費電子產品）"},{ta:"",proj:"",raw:"30-60 / 彰市+8K / 批發商業房產
-彰化車站（+8 公里）
-批發（零售） 、經銷（商業） 、零售業（產業） 、進口（郵遞） 、出口貿易、業務（商業與財務） 、直運（零售業者） 、物流（商業與財務） 、商業（商業與財務） 、資金、 591房屋交易網、房地產（產業） 、電動車（交通工具） 或汽車（交通工具）, 行為：Facebook 付款用戶（90 天）"},{ta:"",proj:"",raw:"28-60 / 秀水埔鹽福興 / 在地產業
-福興工業區（+5 公里）, 秀水_龍騰公園（+5 公里） ; 埔鹽系統交流道， 內埔鄉（+5 公里） Pingtung
-代工生產、食品產業、包裝和標籤（商業與財務） 、製造生產服務和組織 (製造業) 、機械加工、電子工程、保單（保險） 、超市（食品零售業者） 、技術員、汽車（交通工具） 、休閒餐廳 (餐廳) 、網路購物（零售） 、數位媒體（電腦和電子產品） 、家電（消費電子產品） 、居家裝修（家居和園藝用品） 、彩券（博奕） 或自行車（交通工具）"},{ta:"",proj:"",raw:"*28-55 / 地基+5K / 年輕興趣
-力行路96巷， Taiwankou, T'Ai-Wan, Taiwan（+6 公里） Changhua
-戶外（戶外活動） 、上班族（流行文化） 、 PC Gamer 、 Spotify（串流服務） 、演唱會（音樂活動） 、戶外休閒活動（戶外活動） 、歌唱（音樂） 、音樂節（活動） 、甜點（美食和餐飲） 、派對（活動） 、網路遊戲（電玩遊戲） 、野餐 (食品和飲料) 、攀岩 (極限運動) 、股票（投資） 、卡拉OK 、露營（戶外活動） 、 Netflix（串流服務） 、拼圖、攀石、登山（爬山） 、房地產投資（投資） 、運動類遊戲 (電玩遊戲) 、電腦遊戲（電玩遊戲） 、不動產（房地產） 、電玩遊戲（遊戲） 、社群媒體（網路媒體） 或 YouTube（串流服務）"},{ta:"",proj:"",raw:"28-55 / 彰師大+5K / 新婚成家
-彰化師範大學（+5 公里）
-婚姻（婚禮） 、婚禮（社會觀念） 、婚宴（婚禮） 、訂婚戒指（珠寶） 、媽媽寶寶-懷孕、生產、育兒、喜帖（婚禮） 或餐廳（餐飲）"},{ta:"",proj:"",raw:"28-55 / 彰師大+3K / 房地產
-彰化師範大學（+3 公里）
-房地產（產業） 、不動產（房地產） 、房地產投資（投資） 、公寓大樓（房地產） 、租賃（房地產） 或 591房屋交易網"},{ta:"",proj:"",raw:"30-60 / 竹科竹東 / 研究 高知識
-竹東工研院（+5 公里）, 竹東中央市場（+3 公里）, 國立清華大學（+3 公里）, 台灣大學竹北分校（+3 公里）, 國立陽明交通大學 National Yang Ming Chiao Tung University（+3 公里）
-高等教育（教育） 、研究所教育（高等教育） 、科學 (期刊) 、研究、文學（藝術） 、教育學（教育） 、新興技術（科學） 、實驗室、投資（商業與財務） 、財經（商業與財務） 、新聞播報（新聞服務） 、智慧科技 (消費電子產品) 、工程和理工學院 (教育) 或理工學院"},{ta:"",proj:"",raw:"27-55 / 竹科巨城 / 旅遊 年輕工程師
-新竹科學園區（+3 公里）, 竹北台元科技園區（+3 公里）, 新竹巨城百貨公司廣場（+3 公里）, 竹北高鐵（+3 公里）, 芎林戶政事務所（+5 公里）
-智慧科技 (消費電子產品) 、人工智慧（計算） 、大數據 (科學) 、新興技術（科學） 、半導體、物聯網、商業智慧 (商業和金融業) 、軟體開發（軟體） 、軟體工程（資訊技術） 、 iPhone（智慧型手機） 、 Python（程式語言） 、 GitHub 、美食（美食和餐飲） 、旅遊（旅遊觀光） 、 http://booking.com/（旅遊觀光業） 、旅遊網站（網站） 、免稅商店、室內設計（設計） 、品酒 (葡萄酒) 或數位貨幣（貨幣）"},{ta:"",proj:"",raw:"28-55 / 大里霧峰 / 理財 儲蓄
-大里成功商圈（+5 公里）, 大里中興商圈（+5 公里）, 大里立新國小（+5 公里）
-個人理財服務和組織 (銀行業) 、儲蓄（銀行業） 、儲蓄帳戶（銀行業） 、存款帳戶 (銀行業) 、儲蓄互助社、財務規劃（投資） 、信用額度（借貸） 、金錢（貨幣） 、被動收入（商業與財務） 、投資（商業與財務） 、現金、股票市場（投資） 、上班族（流行文化） 、優惠券（優惠券和折扣） 、折扣和折讓（優惠券和折扣） 、 7-11 、便利商店（零售業者） 、超市（食品零售業者） 、熱門話題或 591房屋交易網"},{ta:"",proj:"",raw:"28-50 / 伸港鹿港龍井 / 建築生活品質
-龍井車站（+4 公里） ; 85。c鹿港鹿和店（+4 公里）, 伸港鄉立圖書館（+5 公里）
-住宅房地產 (房地產) 、建材（工業材料和設備） 、結構工程、砌體結構、 Sustainable architecture 、整建（建築業） 、新聞媒體（新聞服務） 、建築媒體 (設計) 、家電品牌和零售商 (零售) 、居家裝飾 (室內裝潢) 、生活風格 (生活風格內容) 、生活品質（心理學） 、身心健康（心理學） 或營建管理"},{ta:"",proj:"",raw:"28-55 / 伸港鹿港龍井大肚 / 科技工業賺錢
龍井車站（+3 公里）, 大肚車站（+5 公里） ; 85。c鹿港鹿和店（+5 公里）, 伸港鄉立圖書館（+5 公里）
金錢（貨幣） 、財富（經濟） 、投資（商業與財務） 、收入（商業與財務） 、汽車（交通工具） 、電子商務（零售） 、股票（投資） 、羽球 (球拍類運動) 、酒精飲品（美食和餐飲） 、 591房屋交易網、排屋、連棟住宅（建築） 或 New Home,"},{ta:"",proj:"",raw:"27-60 / 十期 / 行銷 小資族
-太原車站（+5 公里）, 頭家厝菜市場（+5 公里）
-室內設計（設計） 、行銷企劃 (行銷) 、數位行銷（行銷） 、折扣商店（零售） 、綜藝節目 (表演藝術) 、傢俱（居家裝潢） 、韓國電視劇（電視節目） 、網紅行銷 (行銷) 、網路購物（零售） 、居家裝潢零售商 (零售) 、廣告（行銷） 、設計（設計） 、政府（政府機構） 或網路 (電腦運算)、行業類別：政府員工（全球） 、行政服務或教育和圖書館
1118-永興街（+5 公里）, 太原車站（+5 公里）, 台中車站（+5 公里）, 頭家厝菜市場（+5 公里）
室內設計（設計） 、行銷企劃 (行銷) 、傢俱（居家裝潢） 、折扣商店（零售） 、綜藝節目 (表演藝術) 、韓國電視劇（電視節目） 、網紅行銷 (行銷) 、廣告（行銷） 、設計（設計） 、政府（政府機構） 、網路 (電腦運算) 、宜家家居（零售業者） 、雅高達、銀行帳戶 (銀行業) 、商業模式 (商業和金融業) 或簡餐館（餐廳）"},{ta:"",proj:"",raw:"**27-60/ 西屯中科 /銀行 精算師
-水崛頭公園（+2 公里）, 統聯中港轉運站 U Bus（+2 公里）
-金錢（貨幣） 、財經（商業與財務） 、會計學（商業與財務） 、個人理財（銀行業） 、財務規劃（投資） 、金融服務（商業與財務） 、銀行業（金融） 、企業家（商業與財務） 、會計系統、投資（商業與財務） 、財務會計（商業與財務） 、商業（商業與財務） 或財富管理（銀行業）, 行為：小型企業主"},{ta:"",proj:"",raw:"28-60 / 竹南竹北 / 教育 生活
-國家衛生研究院（+3 公里）, 尚順購物中心（+3 公里） ; 竹南獅山親子公園（+5 公里）, 新竹巨城百貨公司廣場（+5 公里）, 竹北台元科技園區（+5 公里）, 竹東工研院（+5 公里）, 廣源科技園區（+3 公里）
-高等教育（教育） 、語言教育、外語、航空公司、教育（社會觀念） 、工程和理工學院 (教育) 、旅遊（旅遊觀光） 、旅遊網站（網站） 、網路 (電腦運算) 、慢跑（跑步） 、園藝（家居和園藝用品） 、超市（食品零售業者） 、生活用品（家居和園藝用品） 、網路社區、韓國電視劇（電視節目） 、美容（社會觀念） 、美學（哲學） 、商業模式 (商業和金融業) 或咖啡廳（咖啡）"},{ta:"",proj:"",raw:"28-55 / 頭份竹南竹北 / 職業+房產
-竹南科技園區（+5 公里）, 竹南獅山親子公園（+5 公里）, 新竹巨城百貨公司廣場（+5 公里）, 竹北台元科技園區（+5 公里）, 竹東工研院（+5 公里）
-美妝網紅 (美妝) 、網路名人、 YouTube（串流服務） 、社群媒體行銷（行銷） 、商業模式 (商業和金融業) 、聯盟行銷（行銷） 、電子商務（零售） 、自由工作者（工作機會） 、自僱（工作機會） 、被動收入（商業與財務） 、直銷、獨資企業（商業與財務） 、創意創業 (商業和金融業) 、居家事業（商業與財務） 、 591房屋交易網或房屋（房地產）、行為：網紅創作者"},{ta:"",proj:"",raw:"30-60 / 北屯太平 / 年輕娛樂
-太原車站（+3 公里）, 總站夜市（+3 公里）
-上班族（流行文化） 、服裝（服飾） 、網路購物（零售） 、時尚配件（飾品配件） 、美容沙龍（化妝品） 、髮型（護髮保養） 、快時尚（服飾） 、行動支付（貨幣） 、行動銀行（銀行業） 、 LINE 、 Netflix（串流服務） 、流行音樂（音樂） 、休閒娛樂（社會觀念） 、麥當勞（餐廳） 、街頭時尚（服飾） 、運動場所 (體育運動) 、個人理財（銀行業） 、燒烤（烹飪） 、啤酒（酒精飲料） 、假期（活動） 或 591房屋交易網"},{ta:"",proj:"",raw:"28-60 / 竹科園區 / 親子 / 美食
-新竹科學園區（+5 公里）
-親子教育（兒童和親子教育） 、家庭（社會觀念） 、教養方式 (兒童和親子教育) 、私立學校（教育） 、基本英語、兒童發展（小學和中學教育） 、宮崎駿、樂高（玩具） 、美食（美食和餐飲） 、食品媒體和內容 (食物和飲品) 、早午餐（美食和餐飲） 、烹飪（美食和餐飲） 、壽司（美食和餐飲） 、燒牛肉、鮭魚、美食家（美食和餐飲） 或氣泡酒 (葡萄酒)"},{ta:"",proj:"",raw:"1.地點：新竹科學園區（+3 公里）, 竹北台元科技園區（+3 公里）, 新竹巨城百貨公司廣場（+3 公里）, 竹北高鐵（+3 公里）
2.興趣：高科技（電腦和電子產品） 、智慧科技 (消費電子產品) 、人工智慧（計算） 、大數據 (科學) 、新興技術（科學） 、旅遊（旅遊觀光） 、飯店（住宿） 、 http://booking.com/（旅遊觀光業） 、旅遊網站（網站） 、 http://hotels.com/（住宿） 、 Trivago 、房地產（產業） 、房屋（房地產） 或免稅商店"},{ta:"",proj:"",raw:"1.地點：清華大學（+3 公里） ; 臺大醫院竹北分院（+3 公里）, 明新科技大學（+3 公里）, 台大竹北校區（+3 公里）, 新竹國軍醫院（+3 公里）
2.興趣：學術期刊、學術研討會、研究、展覽館、高等教育（教育） 、教育（社會觀念） 、投資（商業與財務） 、新聞播報（新聞服務） 、大眾媒體（娛樂與媒體） 、財經（商業與財務） 、房屋（房地產） 或 591房屋交易網"},{ta:"",proj:"",raw:"1.地點：新竹科學園區（+3 公里）, 竹北台元科技園區（+3 公里）, 新竹巨城百貨公司廣場（+3 公里）, 竹北高鐵（+3 公里）
2.興趣：高科技（電腦和電子產品） 、智慧科技 (消費電子產品) 、人工智慧（計算） 、大數據 (科學) 、新興技術（科學） 、旅遊（旅遊觀光） 、飯店（住宿） 、 Booking.com（旅遊觀光業） 、旅遊網站（網站） 、 Hotels.com（住宿） 、 Trivago 、房地產（產業） 、房屋（房地產） 或免稅商店"},{ta:"",proj:"",raw:"1.地點：清華大學（+3 公里） ; 臺大醫院竹北分院（+3 公里）, 明新科技大學（+3 公里）, 台大竹北校區（+3 公里）, 新竹國軍醫院（+3 公里）
2.興趣：學術期刊、學術研討會、研究、展覽館、高等教育（教育） 、教育（社會觀念） 、投資（商業與財務） 、新聞播報（新聞服務） 、大眾媒體（娛樂與媒體） 、財經（商業與財務） 、房屋（房地產） 或 591房屋交易網"},{ta:"",proj:"",raw:"28-55 / 林口五股 / 教育享樂2
-林口 三井（+5 公里）, 新北市工商展覽中心（+5 公里）
-Podcast (音樂和音訊串流) 、當代藝術（視覺藝術） 、教育資源 (教育) 、藝術展覽（視覺藝術） 、 Craft Beer and Brewing 、早午餐（美食和餐飲） 、語言教育、女裝品牌 (服飾) 、男裝品牌 (服飾) 、英式早餐、專業發展（職業訓練） 、派對策劃 (特殊場合和活動) 、自助旅行 (旅遊) 、精品咖啡 (咖啡) 或 HydraFacial
1223
+Spotify（串流服務） 、冒險旅遊（旅遊觀光） 、露營（戶外活動） 、釀造（啤酒）"},{ta:"",proj:"",raw:"28-60 / 林口三井+3K / 附近職業
-林口三井 Outlet（+3 公里）
-智慧科技 (消費電子產品) 、新興技術（科學） 、半導體、食品產業、能源（科學） 或物流（商業與財務）"},{ta:"",proj:"",raw:"27-55 / 林口三井+3K / 新婚成家
-林口三井 Outlet（+3 公里）
-婚禮（社會觀念） 、婚宴（婚禮） 、喜帖（婚禮） 、婚紗攝影（攝影） 、媽媽寶寶-懷孕、生產、育兒、戒指（珠寶） 或結婚蛋糕（婚禮）
1127主粉專
-結婚蛋糕（婚禮） 、婚宴（婚禮） 、媽媽寶寶-懷孕、生產、育兒、兒童文學（文學） 、戒指（珠寶） 、私立學校（教育） 、婚紗攝影（攝影） 、蒙台梭利教育法、喜帖（婚禮） 、婚禮（社會觀念） 、親子 (雜誌) 或教養方式 (兒童和親子教育)
1203副粉專
-林口三井 Outlet（+5 公里） ; 新光三越 桃園站前店（+5 公里）"},{ta:"",proj:"",raw:"28-60 / 林口三井+3K / 房地產
-林口三井 Outlet（+3 公里）
-房地產（產業） 、不動產（房地產） 、房地產投資（投資） 、房地產開發（房地產） 、房地產投資俱樂部（俱樂部） 、創意房地產投資 (房地產) 或 591房屋交易網"},{ta:"",proj:"",raw:"35-36/竹北東區湖口/高階主管
-緯度 24.83 經度 121.01 Shigang District（+6 公里） Taichung; 緯度 24.90 經度 121.04 Wangkaolou, T'Ai-Wan, Taiwan（+3 公里） Hsinchu
-納入：興趣：高階管理人員、商業模式 (商業和金融業) 、企業家（商業與財務） 、獨資企業（商業與財務） 、酒精飲品（美食和餐飲） 、產品經理、豪華轎車（交通工具） 或高級訂製時裝（服飾）, 行為：經常旅行的用戶、小型企業主或國際飛行常客, 職稱：區經理、副總經理、創辦人、總監或董事長
0112
+生產率、企業孵化器、業務開發 (商業活動) 或商機 (商業和金融業)"},{ta:"",proj:"",raw:"30-60 / 基地+5K / 投資理財房產
-Windy City Pizza 風城披薩（+5 公里）
-個人理財（銀行業） 、信用卡（借貸） 、儲蓄（銀行業） 、被動收入（商業與財務） 、財務規劃（投資） 、網路銀行（銀行業） 、納斯達克100指數、股市指數 (投資) 、共同基金 (投資) 、一般保險 (保險) 、房地產（產業） 、房屋廣告和入口網站 (網站) 、室內設計（設計） 、地板或居家裝修（家居和園藝用品）
0109
擴大+591"},{ta:"",proj:"",raw:"30-60 / 基地+5K / 軍公教
-Windy City Pizza 風城披薩（+5 公里）
-教育（社會觀念） 、學習（教育） 、教育技術學（教育） 、專業發展（職業訓練） 、政府機關概念和作法 (法律和政府) 、財政預算案、家庭（社會觀念） 、健身和保健（健身） 、新聞媒體（新聞服務） 、保險（商業與財務） 或時事（政治）、行業類別：保護服務、教育和圖書館、軍事（全球） 、政府員工（全球） 或社區和社會服務
0109
擴大"},{ta:"",proj:"",raw:"30-64 / 新竹基地5K / 小家庭+房地產
-房屋（房地產） 、傢俱（居家裝潢） 、親子教育（兒童和親子教育） 、新生兒派對（兒童和親子教育） 、家電（消費電子產品） 、兒童（兒童和親子教育） 或不動產（房地產）, 家長：家長（子女最大 12 個月） 、嬰幼兒家長（01-02 歲） 、學齡前兒童的家長（03-05 歲） 、低年級學童（06-08 歲）的家長或青少年學童（09-12 歲）的家長
0108
+嬰幼兒和孕婦用品店 (零售) 、教養方式 (兒童和親子教育) 、超市（食品零售業者） 或啤酒（酒精飲料）"},{ta:"",proj:"",raw:"30-60 / 太平大里 / 在地高收入
-台中大里軟體園區（+5 公里） ; 樹孝路， Taiwankou, T'Ai-Wan, Taiwan（+5 公里） Changhua
-企業家（商業與財務） 、醫學院 (高等教育) 、律師（法律和法律服務） 、法律（法律和法律服務） 、科學 (期刊) 、軟體開發（軟體） 、程式語言（計算） 、軟體工程（資訊技術） 、電腦科學（資訊技術） 、網站開發（網站） 、健身和保健（健身） 、日本消費電子產品品牌 (電腦和電子產品) 、家庭（社會觀念） 、商業模式 (商業和金融業) 、轎車（汽車） 、房屋（房地產） 、住宅區（房地產） 或別墅（住宿）,"},{ta:"",proj:"",raw:"35-65 / 太平 大里 74沿 / 開店 投資
-慈眀高中（+5 公里）, 環中東路七段， 台中市（+5 公里）, 環中東路三段， 台中市（+5 公里） Taichung
-金錢（貨幣） 、公司（商業與財務） 、個人理財（銀行業） 、商業模式 (商業和金融業) 、被動收入（商業與財務） 、新創公司（商業與財務） 、企業家（商業與財務） 、獨資企業（商業與財務） 、投資（商業與財務） 、商業（商業與財務） 、房地產投資（投資） 、財富（經濟） 、居家事業（商業與財務） 、不動產（房地產） 、公司或收入（商業與財務）,"},{ta:"",proj:"",raw:"30-60 / 太平74沿 / 創業 經營 美業
-環中東路二段（+5 公里）, 慈眀高中（+5 公里）, 環中東路七段， 台中市（+5 公里） Taichung
-商業模式 (商業和金融業) 、居家事業（商業與財務） 、收入（商業與財務） 、食品和飲品 (食物和飲品) 、指甲彩繪 (美妝) 、美甲（化妝品） 、美甲沙龍（化妝品） 、足部護理 (美容服務) 、角蛋白、髮型（護髮保養） 、自僱（工作機會） 、律師（法律和法律服務） 、自由工作者（工作機會） 、律師事務所 (法律和法律諮詢服務) 、零售業（產業） 、批發（零售） 、經銷（商業） 或早午餐（美食和餐飲）, 行為：小型企業主,"},{ta:"",proj:"",raw:"30-60 / 豐原潭子后里 / 有小孩寵物
-潭子加工出口區（+5 公里）, 豐原太平洋百貨（+5 公里）, 后科路， 台中市（+3 公里） Taichung
-家庭（社會觀念） 、親子教育（兒童和親子教育） 、廚房（家居和園藝用品） 、室內設計（設計） 、現代家具（居家裝潢） 、家電（消費電子產品） 、幼兒教育（小學和中學教育） 、生活用品（家居和園藝用品） 、運動（體育運動） 、暑假（小學和中學教育） 、草地（園藝） 、任天堂 (遊戲機和相關配件) 、寵物食品（寵物用品） 、狗狗美容（寵物） 、遛狗（狗狗） 、犬隻健康（寵物） 或貓糧（寵物用品）,"},{ta:"",proj:"",raw:"廚房（家居和園藝用品） 、閱讀（傳播） 、園藝（戶外活動） 、親子教育（兒童和親子教育） 、居家裝修（家居和園藝用品） 、 591房屋交易網、幼兒教育（小學和中學教育） 、教育（社會觀念） 、大自然（科學） 、自行車（體育運動） 、書籍（媒體刊物） 、家庭（社會觀念） 、房地產（產業） 、烹飪（美食和餐飲） 或質感設計"},{ta:"",proj:"",raw:"被動收入（商業與財務） 、房地產投資（投資） 、財富（經濟） 、不動產（房地產） 、公司、收入（商業與財務） 、企業家（商業與財務） 、商業（商業與財務） 、獨資企業（商業與財務） 、加盟連鎖（行銷） 、新創公司（商業與財務） 或居家事業（商業與財務）"},{ta:"",proj:"",raw:"28-55 / 竹北竹南科 / 教育享樂
-新竹科學園區（+5 公里）, 新竹系統交流道（+5 公里）, 竹南科學園區（+5 公里）
-Podcast (音樂和音訊串流) 、 Travel Deals 、 LifeStyle Food 、男裝品牌 (服飾) 、女裝品牌 (服飾) 、教育資源 (教育) 、 Craft Beer and Brewing 、派對策劃 (特殊場合和活動) 、早午餐（美食和餐飲） 、英式早餐、 World Gym 、當代藝術（視覺藝術） 、語言教育、成人教育（職業訓練） 、專業發展（職業訓練） 、數字藝術或自助旅行 (旅遊)"},{ta:"",proj:"",raw:"28-55 / 竹北竹南科 / 科技商務
-新竹科學園區（+5 公里）, 竹南科學園區（+5 公里）, 新竹系統交流道（+5 公里）
-Business networking 、 Professional services 、 LifeStyle Food 、 Podcast (音樂和音訊串流) 、男裝品牌 (服飾) 、女裝品牌 (服飾) 、消費電子產品媒體和內容 (電腦和電子產品) 、 Travel Deals 、 Apple Music 、財務規劃（投資） 、科技新聞 (新聞服務) 、行動應用程式（軟體） 、健身和保健（健身） 、教育資源 (教育) 、休閒餐廳 (餐廳) 或生產率
1224
+數位媒體（電腦和電子產品） 、信貸服務和組織 (信貸和借貸) 或消費電子產品零售商 (零售)"},{ta:"",proj:"",raw:"28-60 / 大林大埔美 / 藍領 休閒
-大林車站（+3 公里） ; 大埔美佐登妮絲城堡園區（+3 公里）, 大埔美園區（+3 公里）
-能源效率（能源與公用事業） 、儲蓄（銀行業） 、上班族（流行文化） 、超市（食品零售業者） 、配電系統、個人理財（銀行業） 、折扣和折讓（優惠券和折扣） 、保險（商業與財務） 、技術員、數位相機 (相機和相機設備) 、食品產業、玻璃、家庭（社會觀念） 、佳能企業、代工生產、休閒活動（休閒） 、工業工程 (工程) 、科技（電腦和電子產品） 或製造生產服務和組織 (製造業), 行為：通勤者"},{ta:"",proj:"",raw:"28-55 / 大林新港 / 家庭主婦
-新港老街（+5 公里） ; 大埔美園區（+5 公里）, 嘉義縣大林鎮（+5 公里）
-烹飪（美食和餐飲） 、廚房（家居和園藝用品） 、廚具（廚房與餐廚） 、餐具、家電（消費電子產品） 、家務（家居和園藝用品） 、中式料理（美食和餐飲） 、生活用品（家居和園藝用品） 、家庭（社會觀念） 、親子教育（兒童和親子教育） 、個人理財（銀行業） 、優惠券（優惠券和折扣） 、超市（食品零售業者） 、一般保險 (保險) 、 591房屋交易網、財務規劃（投資） 或居家裝修（家居和園藝用品）"},{ta:"",proj:"",raw:"28-55 /大林斗南斗六 / 通勤傳統文化
-大埔美園區（+5 公里） ; 斗南車站（+5 公里）, 斗六車站（+5 公里）
-家庭（關係） 、排屋、代工生產、節儉生活風格內容 (零售) 、別墅（住宿） 、文化遺產 (藝術和文化) 、旅遊景點和活動 (旅遊觀光業) 、行動應用程式（軟體） 、 Google地圖、五金行（零售業者） 、印刷（出版） 、真空包裝或不動產（房地產）, 行為：通勤者, 行業類別：安裝與維修服務、政府員工（全球） 或農、林、漁業
0113
+連棟住宅（建築） 、食品加工、配電系統、民俗學、節慶（活動） 、茶葉品牌 (食物和飲品) 或休閒釣魚（釣魚）"},{ta:"",proj:"",raw:"28-55 / 大林新港 / 傳產家庭
-新港老街（+5 公里） ; 大埔美園區（+5 公里）, 嘉義縣大林鎮（+5 公里）
-中式料理（美食和餐飲） 、製造業（產業） 、代工生產、農業機械（農業） 、現金回贈獎勵方案 (信貸和借貸) 、會員集點計畫 (優惠券、折扣和購物回饋) 、 Compensation and benefits 、 Workwear 、生活風格 (生活風格內容) 、教養方式 (兒童和親子教育) 、家庭（關係） 、節儉生活風格內容 (零售) 、排屋或別墅（住宿）, 行為：科技早期採用者,"},{ta:"",proj:"",raw:"28-55 / 神岡豐原中科 / 年輕娛樂
-中部科學園區（+5 公里）, 后里科技園區（+5 公里）, YCM 永進機械 Yeong Chin Machinery Industries Co., Ltd.（+5 公里）, 豐原太平洋百貨（+5 公里）
-上班族（流行文化） 、服裝（服飾） 、購物中心（零售） 、美容（社會觀念） 、時尚配件（飾品配件） 、快時尚（服飾） 、儲蓄（銀行業） 、個人理財（銀行業） 、熱門話題、網路銀行（銀行業） 、淘寶網、網路購物（零售） 、行動支付（貨幣） 、 LINE 、行動應用程式（軟體） 、釀造（啤酒） 、運動（體育運動） 、休閒娛樂（社會觀念） 、 Netflix（串流服務） 、 Spotify（串流服務） 或 591房屋交易網"},{ta:"",proj:"",raw:"30-60 / 大里烏日南屯 / 純房產興趣
-烏日工業城（+3 公里）, 大里十九甲（+5 公里）, 台中好巿多（+3 公里）
-房地產（產業） 、房屋（房地產） 、公寓大樓（房地產） 、住宅區（房地產） 、起步房（房地產） 、 591房屋交易網、房屋廣告和入口網站 (網站) 、房地產經濟學 (經濟) 、租賃（房地產） 或由擁有者出售 (房地產)"},{ta:"",proj:"",raw:"30-60 / 竹南 竹北 / 設計+休閒
1.地點：竹南運動公園（+6 公里） ; 新竹科學工業園區（+6 公里）, 北新竹車站（+6 公里）
2.興趣：居家裝修（家居和園藝用品） 、室內設計（設計） 、設計（設計） 、住家修繕（居家裝修） 、平面設計（視覺藝術） 、網站設計（網站） 、時尚設計（設計） 、服裝（服飾） 、時尚配件（飾品配件） 、休閒娛樂（社會觀念） 、休閒遊戲（電玩遊戲） 、網路購物（零售） 、百貨公司（零售） 、房屋（房地產） 或房屋廣告和入口網站 (網站)

27-60
-室內設計（設計） 、房屋（房地產） 、平面設計（視覺藝術） 、百貨公司（零售） 、居家裝修（家居和園藝用品） 、時尚設計（設計） 、網路購物（零售） 、時尚配件（飾品配件） 、休閒娛樂（社會觀念） 、網站設計（網站） 、服裝（服飾） 、設計（設計） 、房屋廣告和入口網站 (網站) 、休閒餐廳 (餐廳) 、美容（社會觀念） 或居家事業（商業與財務）"},{ta:"",proj:"",raw:"35-60 / 大雅 神岡 沙鹿 / 教職員+房產興趣
1.地點：大楊國小（+5 公里）, 台中日僑學校（+5 公里）, 神岡國小（+5 公里）, 靜宜大學（+5 公里）
2.興趣：高等教育（教育） 、新聞媒體（新聞服務） 、書籍（媒體刊物） 、文化（社會觀念） 、財經（商業與財務） 、電視台、教育（社會觀念） 、圖書館、房屋（房地產） 、公寓（房地產） 、房地產投資（投資） 、 591房屋交易網或房屋廣告和入口網站 (網站),"},{ta:"",proj:"",raw:"30-55 / 台3 74沿/ 新婚上班族
1.地點：台中高工（+3 公里）, 大里軟體園區（+3 公里）, 大里十九甲（+3 公里）, 霧峰區公所（+3 公里）
2.興趣：訂婚（婚禮） 、求婚（婚禮） 、婚禮（社會觀念） 、旅遊（旅遊觀光） 、 Booking.com（旅遊觀光業） 、旅遊網站（網站） 、 Trivago 、 Hotels.com（住宿） 、咖啡（美食和餐飲） 、星巴克（咖啡） 、宜家家居（零售業者） 、家電（消費電子產品） 、 591房屋交易網或房屋廣告和入口網站 (網站)"},{ta:"",proj:"",raw:"豪華轎車（交通工具） 、收入（商業與財務） 、股票（投資） 、金錢（貨幣） 、數位貨幣（貨幣） 、股票市場（投資） 、體育、運動（體育運動） 、跑步（體育運動） 、財富（經濟） 、外匯市場（貨幣） 、戶外休閒活動（戶外活動） 、房屋（房地產） 或 591房屋交易網"},{ta:"",proj:"",raw:"35-60 / 清水 神岡 潭子 / 藍領+日用品
1.地點：和睦路一段（+3 公里）, 豐洲科技工業園區（+5 公里）, 潭子加工出口區（+3 公里）
2.興趣：技術員、工廠（製造業） 、加工出口工廠、製造業（產業） 、物流（商業與財務） 、保險（商業與財務） 、保單（保險） 、家庭（社會觀念） 、超市（食品零售業者） 、量販店（食品零售業者） 、家樂福、居家裝修（家居和園藝用品） 、五金行（零售業者） 、房地產（產業） 或 591房屋交易網"},{ta:"",proj:"",raw:"28-55 / 十期東區 / 餐廳 串流媒體
-精武路（+2 公里）, 太原車站（+3 公里）, 頭家厝菜市場（+3 公里）
-速食休閒餐廳 (餐廳) 、簡餐館（餐廳） 、甜點（美食和餐飲） 、在地美食（美食和餐飲） 、烘培坊（烘焙食品） 、火鍋、燒烤（烹飪） 、韓式料理（美食和餐飲） 、美食家（美食和餐飲） 、壽司（美食和餐飲） 、鮭魚、 Netflix（串流服務） 、 Spotify（串流服務） 、 Apple Music 、 YouTube（串流服務） 、 UberEATS 或行動支付（貨幣）
1125
-精武路（+3 公里）, 太原車站（+3 公里）, 頭家厝菜市場（+3 公里）
-UberEATS 、 Spotify（串流服務） 、烘培坊（烘焙食品） 、甜點（美食和餐飲） 、行動支付（貨幣） 、簡餐館（餐廳） 、在地美食（美食和餐飲） 、火鍋、鮭魚、韓式料理（美食和餐飲） 、壽司（美食和餐飲） 、 Netflix（串流服務） 、速食休閒餐廳 (餐廳) 、燒烤（烹飪） 、美食家（美食和餐飲） 、 YouTube（串流服務） 、 Apple Music 、速食餐廳（餐飲） 、自助餐或真人實境秀（電影和電視）"},{ta:"",proj:"",raw:"28-60 / 北屯太平東區 / 年輕自住
-太平運動公園（+3 公里）, 台中市北屯兒童公園（+3 公里）, 台中秀泰站前s1館（+3 公里）
-上班族（流行文化） 、服裝（服飾） 、購物中心（零售） 、美容（社會觀念） 、時尚配件（飾品配件） 、化妝品（個人護理） 、個人理財（銀行業） 、儲蓄（銀行業） 、熱門話題、網路銀行（銀行業） 、網路購物（零售） 、淘寶網、 momo購物網、行動支付（貨幣） 、 LINE 、行動應用程式（軟體） 、流行音樂（音樂） 、啤酒（酒精飲料） 、 UberEATS 、運動（體育運動） 、 591房屋交易網或房屋廣告和入口網站 (網站)"},{ta:"",proj:"",raw:"1.地點：中台科技大學（+3 公里）, 北屯捷運總站（+3 公里）, 祥順運動公園（+3 公里）, 大興十九街1巷， 台中市（+3 公里） Taichung
2.興趣：閱讀（傳播） 、書籍（媒體刊物） 、廚房（家居和園藝用品） 、教育（社會觀念） 、大自然（科學） 、家庭（社會觀念） 、烹飪（美食和餐飲） 、學區、旅遊（產業） 、休閒活動（休閒） 、假期（活動） 、房地產（產業） 、 591房屋交易網或樂屋網"},{ta:"",proj:"",raw:"1.地點：大里工業區（+3 公里）, 台中大里軟體園區（+3 公里）, 太平工業區（+3 公里）, 大興十九街1巷， 台中市（+3 公里） Taichung
2.興趣：金錢（貨幣） 、財富（經濟） 、投資（商業與財務） 、收入（商業與財務） 、汽車（交通工具） 、電子商務（零售） 、股票（投資） 、羽球 (球拍類運動) 、酒精飲品（美食和餐飲） 、房地產（產業） 、房屋（房地產） 、 591房屋交易網或樂屋網"},{ta:"",proj:"",raw:"28-55 / 北屯太平 / 藍領 公教職
-頭家厝菜市場（+3 公里）, 太原車站（+3 公里）, 中臺科技大學（+3 公里）, 大源十九街， 台中市（+5 公里） Taichung
-師範教育（職業訓練） 、技術員、上班族（流行文化） 、工廠（製造業） 、保單（保險） 、存款帳戶 (銀行業) 、配電系統、代工生產、公共運輸（交通運輸） 、超市（食品零售業者） 或本日優惠（零售）, 行業類別：保護服務、政府員工（全球） 、教育和圖書館或行政服務
1204(普)
+教育資源 (教育) 、節儉生活風格內容 (零售) 、教養方式 (兒童和親子教育) 、專業發展（職業訓練） 、 Retirement Insurance Benefits 、退伍軍人福利（軍事） 或家務管理和整理 (居家和園藝用品)
1209
-Retirement Insurance Benefits 、工廠（製造業） 、師範教育（職業訓練） 、存款帳戶 (銀行業) 、超市（食品零售業者） 、保單（保險） 、配電系統、技術員、退伍軍人福利（軍事） 、代工生產、專業發展（職業訓練） 、節儉生活風格內容 (零售) 、教育資源 (教育) 、旋轉式刮鬍刀、摩托車配件（交通工具） 、市政事務 (法律和政府) 或生活風格 (生活風格內容), 行業類別：行政服務、教育和圖書館、保護服務或政府員工（全球）
0113
+臺中孔廟（+3 公里）"},{ta:"",proj:"",raw:"28-55 / 沙鹿 / 公教職員
-沙鹿郵局（+3 公里）, 臺中市立圖書館沙鹿深波分館/文昌分館（+3 公里）
-教育（社會觀念） 、學習（教育） 、專業發展（職業訓練） 、書籍（媒體刊物） 、新聞媒體（新聞服務） 、學校（教育） 、社區議題（法律與政府） 、家庭（社會觀念） 、均衡飲食（個人護理） 、健身和保健（健身） 、社群媒體（網路媒體） 、政府機關概念和作法 (法律和政府) 、財政預算案或快時尚（服飾）, 行業類別：保護服務、教育和圖書館、社區和社會服務或軍事（全球）
1201
-沙鹿郵局（+3 公里）, 嘉陽高中（+3 公里）, 臺中市立圖書館沙鹿深波分館/文昌分館（+3 公里）"},{ta:"",proj:"",raw:"30-60 / 中科南屯南區 / 年輕人興趣
-中興大學惠蓀堂（+2 公里）, 台中車站（+5 公里）, 文心森林公園（+5 公里）, 中科路， 台中市（+5 公里） Taichung
-UberEATS 、戶外（戶外活動） 、人工智慧（計算） 、室內設計（設計） 、上班族（流行文化） 、程式語言（計算） 、資訊科技（電腦和電子產品） 、藝術展覽（視覺藝術） 、親子教育（兒童和親子教育） 、網站開發（網站） 、網路購物（零售） 、航空公司、投資（商業與財務） 、軟體開發（軟體） 、餐廳（餐飲） 、星巴克（咖啡） 、零售業（產業） 、電腦程式設計（電腦和電子產品） 、科技（電腦和電子產品） 、旅遊（旅遊觀光） 、 Trivago 或 Booking.com（旅遊觀光業）"},{ta:"",proj:"",raw:"27-55 / 中科世貿 / 年輕工程師
-中科路（+5 公里）, 台中矽品（+5 公里）, 台中世貿中心（+5 公里）
-半導體、人工智慧（計算） 、大數據 (科學) 、軟體工程（資訊技術） 、軟體開發（軟體） 、電腦程式設計（電腦和電子產品） 、資訊科技（電腦和電子產品） 、電腦工程（工程） 、機器學習（計算） 、任天堂 (遊戲機和相關配件) 、 Python（程式語言） 、 PlayStation（遊戲機） 、 UberEATS 、酒精飲品（美食和餐飲） 、美食（美食和餐飲） 、市場趨勢 (商業和金融業) 或數位貨幣（貨幣）"},{ta:"",proj:"",raw:"30-60 / 東海逢甲太原 / 企業主管
-太原車站（+5 公里）, 東海藝術商圈（+5 公里）, 逢甲夜市（+5 公里）
-高階管理人員、行銷企劃 (行銷) 、商業計畫 (商業活動) 、中小型企業（商業與財務） 、商業模式 (商業和金融業) 、戰略計劃、社群媒體行銷（行銷） 、購物中心（零售） 、商業（商業與財務） 、網紅行銷 (行銷) 或管理（商業與財務）、行為：小型企業主
1125
-彰化車站（+6 公里）, 洲際棒球場（+5 公里）, 逢甲夜市（+5 公里）, 靜宜大學 Providence University（+5 公里）, 東海藝術商圈（+5 公里）
1201(超優)
-台中JMALL（+5 公里） ; 洲際棒球場（+5 公里）, 靜宜大學 Providence University（+3 公里）, 東海藝術商圈（+5 公里）, 金典綠園道商場（+3 公里）
1211
+生產率、企業孵化器、會員集點計畫 (優惠券、折扣和購物回饋) 或商務旅遊（旅遊觀光業）"},{ta:"",proj:"",raw:"30-65 / 嶺東烏日南區 / 企業主管
-新烏日車站（+3 公里）, 嶺東科技大學（+3 公里）, 文心森林公園站（+3 公里）, 大慶夜市（+3 公里）
-高階管理人員、管理（商業與財務） 、商業（商業與財務） 、商業計畫 (商業活動) 、中小型企業（商業與財務） 、戰略計劃、商業模式 (商業和金融業) 、社群媒體行銷（行銷） 、行銷企劃 (行銷) 、網紅行銷 (行銷) 或購物中心（零售）、行為：小型企業主
1201
-新烏日車站（+5公里）, 嶺東科技大學（+3 公里）, 文心森林公園站（+3 公里）, 大慶夜市（+3 公里）
1211
+商機 (商業和金融業) 、業務開發 (商業活動) 、價格或節慶（活動）"},{ta:"",proj:"",raw:"28-60 / 龍井東海中科 / 科技房產興趣
-東海藝術商圈（+5 公里）, 西濱路三段， 台中市（+5 公里）, 中科路， 台中市（+5 公里） Taichung
-智慧科技 (消費電子產品) 、新興技術（科學） 、 AI 、三星電子、羅技、 NVIDIA GeForce 、時尚設計（設計） 、證券（金融） 、個人理財服務和組織 (銀行業) 、商業智慧 (商業和金融業) 、時尚配件（飾品配件） 、宜家家居（零售業者） 、網路購物網站 (網站) 、電子商務網站 (網站) 、排屋、住宅區（房地產） 、連棟住宅（建築） 或 591房屋交易網
1125
-東海藝術商圈（+5 公里）, 萬興路， 台中市（+5 公里）, 中科路， 台中市（+5 公里） Taichung; 西濱路三段， Taiwankou, T'Ai-Wan, Taiwan（+5 公里） Changhua
-燒牛肉、三星電子、 AI 、連棟住宅（建築） 、 NVIDIA GeForce 、證券（金融） 、 591房屋交易網、時尚設計（設計） 、鮭魚、智慧科技 (消費電子產品) 、時尚配件（飾品配件） 、商業智慧 (商業和金融業) 、新興技術（科學） 、酒精飲品（美食和餐飲） 、宜家家居（零售業者） 、住宅區（房地產） 、排屋、羅技、個人理財服務和組織 (銀行業) 、網路購物網站 (網站) 或電子商務網站 (網站)
1201
-燒牛肉、 AI 、連棟住宅（建築） 、 NVIDIA GeForce 、證券（金融） 、 591房屋交易網、時尚設計（設計） 、鮭魚、智慧科技 (消費電子產品) 、時尚配件（飾品配件） 、新興技術（科學） 、酒精飲品（美食和餐飲） 、宜家家居（零售業者） 、住宅區（房地產） 、排屋、羅技、個人理財服務和組織 (銀行業) 、電子商務網站 (網站) 、 LifeStyle Food 或旅行社和預訂 (旅遊觀光業)"},{ta:"",proj:"",raw:"30-60 / 沙鹿龍井伸港 / 上班族 / 家具設計
-台中市沙鹿區（+5 公里）, 伸港工業區（+5 公里）, 台中市龍井區（+5 公里）
-上班族（流行文化） 、管理（商業與財務） 、製造業（產業） 、商業（商業與財務） 、傢俱（居家裝潢） 、室內設計（設計） 、居家裝修（家居和園藝用品） 、現代家具（居家裝潢） 、宜家家居（零售業者） 、政府（政府機構） 、網路購物（零售） 、時尚配件（飾品配件） 、排屋、住宅區（房地產） 、連棟住宅（建築） 、保單（保險） 或業務（商業與財務）, 行為：通勤者, 行業類別：大型企業對企業（B2B）企業員工（500 名以上員工） 、中型企業對企業（B2B）企業員工（200 - 500 名員工） 或小型企業對企業（B2B）企業員工（10-200 名員工）
1125
-台中市沙鹿區（+5 公里）, 大肚區公所（+5 公里）, 伸港工業區（+5 公里）, 中科公園（+5 公里）, 台中市龍井區（+5 公里）
-+羅技"},{ta:"",proj:"",raw:"30-65 / 西屯南屯 / 有錢興趣
-龍富路五段， 台中市（+2 公里）, 福林路， 台中市（+4 公里） Taichung
-私人銀行服務、 Business networking 、蘇富比、百達翡麗（手錶） 、度假村（旅遊觀光業） 、品酒 (葡萄酒) 、路易威登（時尚品牌） 、企業家（商業與財務） 、豪奢生活方式（網站） 、慈善和公益（社會公益理念） 、 Country club 、高淨值人士（商業與財務） 、高爾夫球（體育運動） 、登山（爬山） 、健行裝備（運動用品） 、健行和露營 (戶外活動) 、觀鳥或茶（非酒精飲料）"},{ta:"",proj:"",raw:"30-60 / 西屯南屯 / 企業家高奢興趣
-五權西路（+5 公里）, 黎明路三段， 台中市（+5 公里） Taichung
-度假（社會觀念） 、比爾·蓋茨、私人銀行服務、古馳（時尚品牌） 、席夢思、路易威登（時尚品牌） 、私人公司、水療（個人護理） 、 Tax law 、遊艇（船舶） 、企業家（商業與財務） 、股份 (金融) 、財富（經濟） 、房地產（產業） 、投資者（投資） 、機場貴賓室、高爾夫球（體育運動） 、現代藝術（藝術） 、手錶（飾品配件） 、收藏品 (收藏品) 或豪華轎車（交通工具）
1125
-國立臺灣美術館 National Taiwan Museum of Fine Arts（+3 公里）, 黎明路三段， 台中市（+4 公里）, 龍富路四段， 台中市（+4 公里） Taichung
-現代藝術（藝術） 、度假（社會觀念） 、比爾·蓋茨、私人銀行服務、古馳（時尚品牌） 、席夢思、水療（個人護理） 、私人公司、 Tax law 、遊艇（船舶） 、機場貴賓室、路易威登（時尚品牌） 、企業家（商業與財務） 、收藏品 (收藏品) 、股份 (金融) 、高爾夫球（體育運動） 、財富（經濟） 、房地產（產業） 、投資者（投資） 、手錶（飾品配件） 、豪華轎車（交通工具） 、古董、跑車（交通工具） 或拍賣"},{ta:"",proj:"",raw:"30-60 / 西屯七期 / 精品房產
-台中七期（+3 公里）, 福科路， 台中市（+3 公里） Taichung
-精品店（零售業者） 、高級訂製時裝（服飾） 、排屋、住宅區（房地產） 、連棟住宅（建築） 、別墅（住宿） 、私人銀行服務、愛馬仕（服飾） 或路易威登（時尚品牌）
1125
-台中七期（+3 公里）, 龍富路五段， 台中市（+3 公里）, 福科路， 台中市（+3 公里） Taichung
-連棟住宅（建築） 、私人銀行服務、精品店（零售業者） 、愛馬仕（服飾） 、路易威登（時尚品牌） 、別墅（住宿） 、住宅區（房地產） 、排屋、高級訂製時裝（服飾） 、 Cartier（珠寶商） 、凡賽斯（時尚品牌） 或商務艙（航空旅行）
1201
-黎明路三段， 台中市（+4 公里）, 龍富路五段， 台中市（+4 公里）, 福林路， 台中市（+4 公里） Taichung"},{ta:"",proj:"",raw:"28-55 / 中科西屯 / 工程師興趣
-中科林厝公園（+3 公里）, 台中工業區（+3 公里）, 新光三越 台中中港店（+3 公里）
-資訊科技（電腦和電子產品） 、軟體開發（軟體） 、大數據 (科學) 、人工智慧（計算） 、新興技術（科學） 、智慧科技 (消費電子產品) 、股票（投資） 、網路社區、棒球（體育運動） 、 NBA季後賽、行動支付（貨幣） 、 Google電子錢包或 Uber（公司）、行為：行銷 API 開發人員（過去 90 天）
1121-台中工業區（+3 公里）, 水崛頭公園（+3 公里）, 老虎城購物中心（台中）（+3 公里）
人工智慧（計算） 、棒球（體育運動） 、大數據 (科學) 、資訊科技（電腦和電子產品） 、行動支付（貨幣） 、智慧科技 (消費電子產品) 、股票（投資） 、新興技術（科學） 、軟體開發（軟體） 、網路社區、 Uber（公司） 、 Trivago 、 http://geek.com/ 、旅遊網站（網站） 或 GitHub
1125
-台中工業區（+4 公里）, 水崛頭公園（+4 公里）, 中力健身中心-沙鹿館（+4 公里）
-人工智慧（計算） 、棒球（體育運動） 、 GitHub 、旅遊網站（網站） 、大數據 (科學) 、資訊科技（電腦和電子產品） 、行動支付（貨幣） 、智慧科技 (消費電子產品) 、股票（投資） 、新興技術（科學） 、軟體開發（軟體） 、網路社區、 Uber（公司） 、 Trivago 、 http://geek.com/ 、健身俱樂部（健身） 、重量訓練（舉重） 、智慧裝置（消費電子產品） 、雞肉 (食品) 、羅技或 Razer"},{ta:"",proj:"",raw:"30-60 / 北區北屯西屯 / 生活面向
-敦化路一段（+3 公里）, 國立自然科學博物館（+3 公里）, 頭家厝菜市場（+3 公里）
-行動應用程式（軟體） 、零售銀行業務（銀行業） 、 Podcast (音樂和音訊串流) 、網路廣告（行銷） 、買一送一 (行銷) 、生活風格 (生活風格內容) 、 Lifestyle Travel 、 LifeStyle Food 、 Professional services 、 Business networking 、休閒餐廳 (餐廳) 、女裝品牌 (服飾) 、 Cash on delivery 或男裝品牌 (服飾)
1209
-Cash on delivery 、零售銀行業務（銀行業） 、 Business networking 、買一送一 (行銷) 、 Podcast (音樂和音訊串流) 、 LifeStyle Food 、生活風格 (生活風格內容) 、 Lifestyle Travel 、行動應用程式（軟體） 、休閒餐廳 (餐廳) 、男裝品牌 (服飾) 、女裝品牌 (服飾) 、消費電子展、會員集點計畫 (優惠券、折扣和購物回饋) 、電影愛好者 (電影) 、線上訂餐（美食和餐飲） 或 momo購物網"},{ta:"",proj:"",raw:"30-55 / 清水神岡潭子 / 工業 儲蓄 家居
-和睦路一段（+3 公里）, 潭子加工出口區（+3 公里）, 豐洲科技工業園區（+5 公里）, 神林路一段， 台中市（+3 公里） Taichung
-儲蓄（銀行業） 、工廠（製造業） 、保單（保險） 、傢俱（居家裝潢） 、個人理財（銀行業） 、技術員、食品（美食和餐飲） 、家樂福、家電（消費電子產品） 、製造業（產業） 、生活用品（家居和園藝用品） 、機械工程（工程） 或製造生產服務和組織 (製造業)"},{ta:"",proj:"",raw:"27-55 / 十期 / 財會 公務員
-太原車站（+5 公里）, 頭家厝菜市場（+5 公里）
-財務會計（商業與財務） 、會計系統、政府（政府機構） 、時事（政治） 、新聞媒體（新聞服務） 、傢俱（居家裝潢） 、網路 (電腦運算) 、韓國電視劇（電視節目） 、壽司（美食和餐飲） 、燒牛肉、鮭魚、室內設計（設計） 或科技（電腦和電子產品）、行業類別：教育和圖書館、政府員工（全球） 、保護服務或社區和社會服務
1118-
-和欣客運朝馬轉運站（+3 公里）, 太原車站（+5 公里）, 水湳經貿園區（+3 公里）, 頭家厝菜市場（+5 公里）
-室內設計（設計） 、燒牛肉、傢俱（居家裝潢） 、鮭魚、時事（政治） 、會計系統、壽司（美食和餐飲） 、財務會計（商業與財務） 、韓國電視劇（電視節目） 、政府（政府機構） 、網路 (電腦運算) 、新聞媒體（新聞服務） 、科技（電腦和電子產品） 、雲端運算（計算） 、私人銀行服務、財政預算案、快時尚（服飾） 或簿記"},{ta:"",proj:"",raw:"27-55 / 中科南屯烏日 / 食衣住行
-烏日高鐵站（+5 公里）, 台中工業區（+3 公里）, 中科路（+3 公里）, 精科公園（+3 公里）, 台中世貿中心（+3 公里）
-房屋（房地產） 、住宿加早餐酒店、 http://booking.com/（旅遊觀光業） 、美食（美食和餐飲） 、火鍋、日本料理（美食和餐飲） 、牛肉（美食和餐飲） 、服裝（服飾） 、襯衫（服飾） 、時尚配件（飾品配件） 、電動車（交通工具） 、 BMW（交通工具） 、特斯拉汽車（交通工具） 、購物中心（零售） 、配送（商務） 或 UberEATS"},{ta:"",proj:"",raw:"28-55 / 十期東區 / 餐廳 串流媒體
-精武路（+3 公里）, 太原車站（+3 公里）, 頭家厝菜市場（+3 公里）
-速食休閒餐廳 (餐廳) 、簡餐館（餐廳） 、甜點（美食和餐飲） 、在地美食（美食和餐飲） 、烘培坊（烘焙食品） 、火鍋、燒烤（烹飪） 、韓式料理（美食和餐飲） 、美食家（美食和餐飲） 、壽司（美食和餐飲） 、鮭魚、 Netflix（串流服務） 、 Spotify（串流服務） 、 Apple Music 、 YouTube（串流服務） 、 UberEATS 或行動支付（貨幣）"},{ta:"",proj:"",raw:"28-60 / 北屯太平東區 / 娛樂購物
-台中市北屯兒童公園（+3 公里）, 台中秀泰站前s1館（+3 公里）, 頭家厝菜市場（+3 公里）
-上班族（流行文化） 、服裝（服飾） 、購物中心（零售） 、美容（社會觀念） 、時尚配件（飾品配件） 、化妝品（個人護理） 、個人理財（銀行業） 、熱門話題、網路銀行（銀行業） 、網路購物（零售） 、淘寶網、行動支付（貨幣） 、 LINE 、行動應用程式（軟體） 、韓國電視劇（電視節目） 、速食休閒餐廳 (餐廳) 、流行音樂（音樂） 、綜藝節目 (表演藝術) 、房屋廣告和入口網站 (網站) 、假期（活動） 或快時尚（服飾）"},{ta:"",proj:"",raw:"30-60 / 中北部 / 企業管理
-南港軟體工業園區(Nankang Software Park)（+20 公里） ; 后里科技園區（+20 公里）, 烏日高鐵站（+20 公里） ; 龍潭科學園區（+20 公里） ; 苗栗線政府（+20 公里） ; 新竹生物醫學園區（+20 公里）
-商業（商業與財務） 、管理（商業與財務） 、品牌管理、企業家（商業與財務） 、廣告行銷活動 (行銷) 、企業管理（商業與財務） 、人力資源管理（商業與財務） 、徵才（工作機會） 、徵才網站（工作機會） 、行銷策略（行銷） 、培訓和開發 (商業活動) 、資金、投資銀行業（銀行業） 、股市指數 (投資) 或房地產投資（投資）"},{ta:"",proj:"",raw:"**27-55 / 西屯南屯 / 登山運動工程師
-嶺東科技大學（+3 公里）, 台中工業區（+3 公里）, 逢甲大學 Feng Chia University（+4 公里）
-指數基金 (投資) 、程式語言（計算） 、滑雪勝地 (登山和滑雪勝地) 、亞瑟士、羽球 (球拍類運動) 、智慧科技 (消費電子產品) 、 Lexus 汽車（交通工具） 、優乃克、股票（投資） 、滑雪（滑雪和單板滑雪） 、電腦記憶體（電腦硬體） 、信用卡（借貸） 、網球（體育運動） 、美津濃、滑雪板（滑雪和單板滑雪） 、電子工程、電腦程式設計（電腦和電子產品） 、科技（電腦和電子產品） 或 PlayStation 4"},{ta:"",proj:"",raw:"35-60 / 南區東區大里 / 子女置產
-大里中興商圈（+3 公里）, 寶闊健康活水休閒館（+3 公里）, 建國北黃昏市場（+5 公里）
-旅行社和預訂 (旅遊觀光業) 、跟團旅行 (旅遊觀光) 、糕點（烘焙食品） 、文化遺產 (藝術和文化) 、民俗學、古蹟、超市（食品零售業者） 、亞洲文化 (文化) 、肥皂劇 (電視節目) 、綜藝節目 (表演藝術) 、證券交易所（投資） 、房地產（產業） 、婚禮（社會觀念） 、公園與遊憩或 YouTube（串流服務）、家長：父母（全部）
1126
-太平中平路（+3 公里）, 全聯軍太店（+3 公里）, 大坑九號步道（+3 公里）, 潭子國民暨兒童運動中心（+3 公里）"},{ta:"",proj:"",raw:"28-55 / 北區北屯西屯 / 業務媒體餐廳
-敦化路一段（+3 公里）, 國立自然科學博物館（+3 公里）, 頭家厝菜市場（+3 公里）
-iPhone（智慧型手機） 、業務（商業與財務） 、 Apple Watch（消費電子產品） 、時尚配件（飾品配件） 、銀行業（金融） 、房地產（產業） 、社群媒體行銷（行銷） 、社群媒體（網路媒體） 、保險（商業與財務） 、大眾媒體（娛樂與媒體） 、新聞媒體（新聞服務） 、個人發展（個人身分） 、聯盟行銷（行銷） 、休閒餐廳 (餐廳) 、星巴克（咖啡） 、早午餐（美食和餐飲） 或社交媒體優化
1203
+ LifeStyle Food 、 Lifestyle brand 、美食家（美食和餐飲） 、精品咖啡 (咖啡) 或業務開發 (商業活動)"},{ta:"",proj:"",raw:"30-60 / 台1沿線 / 科技工業
-龍井車站（+3 公里）, 7-11菁埔門市（+3 公里）, 麥當勞清水店（+3 公里）, 縱貫公路（+4 公里） Taichung
-機械工程（工程） 、工廠（製造業） 、製造業（產業） 、配電系統、代工生產、能源效率（能源與公用事業） 、半導體、 NVIDIA GeForce 、綜合企業、羅技、 Razer 、行動應用程式（軟體） 、聯結車（交通工具） 、材料科學、科技新聞 (新聞服務) 、儲蓄帳戶（銀行業） 、時事（政治） 、科技品牌 (科技) 、物聯網或智慧科技 (消費電子產品)
1204
-麥當勞清水店（+4 公里）, 龍井車站（+4 公里）, 7-11菁埔門市（+4 公里）, 中科公園（+3 公里）, 中華路一段208號， 台中市（+4 公里） Taichung
+ Compensation and benefits 、 Gadget & Gear 、專業發展（職業訓練） 、職涯發展（工作機會） 或 LifeStyle Home
0113
-7-11菁埔門市（+4 公里）, 龍井車站（+4 公里）, 麥當勞清水店（+4 公里）, 大雅中科公園（+5 公里）, 中華路一段208號， 台中市（+4 公里） Taichung
-能源效率（能源與公用事業） 、物聯網、工廠（製造業） 、 NVIDIA GeForce 、配電系統、材料科學、儲蓄帳戶（銀行業） 、智慧科技 (消費電子產品) 、半導體、製造業（產業） 、代工生產、聯結車（交通工具） 、機械工程（工程） 、 Compensation and benefits 、行動應用程式（軟體） 、科技新聞 (新聞服務) 、 Razer 、輪胎品牌和商店 (零售) 、釀造（啤酒） 、充電器、電池、製冷、自動化技術、駕駛（交通工具） 或二手商品 (購物和銷售)"},{ta:"",proj:"",raw:"27-55 / 中區北區洲際 / 跑咖追星出國2.0
-洲際棒球場（+3 公里）, 中友百貨（+3 公里）, 科博館（+3 公里）, LaLaport Taichung（+3 公里）
-演唱會（音樂活動） 、網路名人、音樂節（活動） 、咖啡廳（咖啡） 、甜點（美食和餐飲） 、旅遊網站（網站） 、住宿加早餐酒店、免稅商店、蛋糕（烘焙食品） 、韓國流行音樂（音樂） 、航空公司、華語流行音樂、 Instagram（社群媒體） 、星巴克（咖啡） 、旅遊（旅遊觀光） 、 http://booking.com/（旅遊觀光業） 、地點 (地標) 、旅行社和預訂 (旅遊觀光業) 、休閒餐廳 (餐廳) 、數位相機 (相機和相機設備) 、肖像攝影 (攝影) 、購物中心（零售） 或即時成像相機"},{ta:"",proj:"",raw:"27-45/ 東區北區洲際 / 小家庭自營商
-精武車站（+3 公里）, 洲際棒球場（+3 公里）, 中友百貨（+3 公里）, 科博館（+3 公里）
-烹飪（美食和餐飲） 、 KitchenAid（家用電器） 、個人理財（銀行業） 、幼兒照護（兒童和親子教育） 、教養方式 (兒童和親子教育) 、居家裝修（家居和園藝用品） 、生活風格和家務內容 (居家和園藝用品) 、居家和園藝媒體 (住家修繕) 、家庭桌遊 (遊戲) 、創意創業 (商業和金融業) 、電子商務（零售） 、新創公司（商業與財務） 、顧客關係管理（公關） 或銷售時點情報系統、行為：小型企業主"},{ta:"",proj:"",raw:"28-55 / 南區東區太平 / 餐廳 串流媒體
-臺中火車站（+3 公里）, 精武路（+3 公里）, 建國北黃昏市場（+5 公里）
-速食休閒餐廳 (餐廳) 、簡餐館（餐廳） 、甜點（美食和餐飲） 、在地美食（美食和餐飲） 、烘培坊（烘焙食品） 、火鍋、燒烤（烹飪） 、韓式料理（美食和餐飲） 、美食家（美食和餐飲） 、壽司（美食和餐飲） 、鮭魚、 Netflix（串流服務） 、 Spotify（串流服務） 、 Apple Music 、 YouTube（串流服務） 、 UberEATS 或行動支付（貨幣）
1201
+FineDiningLovers 、 LifeStyle Food 、美食 (食品零售商) 或一般生活風格內容 (生活風格內容)"},{ta:"",proj:"",raw:"28-55 / 南區中區洲際 / 社交網路娛樂
-洲際棒球場（+3 公里）, 中華路夜市（+3 公里）, 建國北黃昏市場（+5 公里）
-網路電視 (電視和影片) 、網路娛樂 (娛樂和媒體) 、隨選影片 (影片串流服務) 、 socializing 、現場活動 (活動) 、 Entertainment News 、音樂和音訊串流 (音樂) 、歡樂時光（酒精飲料） 、數位媒體（電腦和電子產品） 、爆紅影片 (網路影片) 、派對（活動） 、生活風格 (生活風格內容) 、行動支付（貨幣） 、信用卡（借貸） 或 Christmas Holiday"},{ta:"",proj:"",raw:"27-55 / 林口+3K / 醫護族群
-林口長庚醫院醫學大樓（+3 公里）, 林口三井 Outlet（+3 公里）
-醫學院 (高等教育) 、牙科學院 (高等教育) 、護理教育（醫學教育） 、免稅商店、自助旅行 (旅遊) 、一般保險 (保險) 、高等教育（教育） 、衛生學、生物學（科學） 、美容（社會觀念） 、清潔（個人護理） 、 CeraVe Skincare 或 Cetaphil, 行業類別：健康照護與醫療服務
1223
+衛生政策研究、科學 (期刊) 、 Uber（公司） 、研究
0112
-桃園龜山長庚分院（+5 公里）, 林口長庚醫院醫學大樓（+5 公里）, 新仁醫院（+5 公里）"},{ta:"",proj:"",raw:"30-60 / 草屯霧峰大里 / 通勤教育戶外
-霧峰健體中心（+5 公里） ; 大里一交流道， Taiwankou, T'Ai-Wan, Taiwan（+5 公里） Changhua; 草屯炎峰國小（+5 公里）
-汽車（交通工具） 、上班族（流行文化） 、教育資源 (教育) 、教養方式 (兒童和親子教育) 、一般健康 (個人護理) 、課外活動、家務管理和整理 (居家和園藝用品) 、速食（美食和餐飲） 、 Outdoor Living 、露營（戶外活動） 、自行車（體育運動） 、新聞媒體（新聞服務） 、商業（商業與財務） 、服裝（服飾） 或時事（政治）, 行為：通勤者, 行業類別：政府員工（全球）
0113
+馬拉松 (跑步) 、戶外休閒活動（戶外活動） 或園藝（戶外活動）"},{ta:"",proj:"",raw:"25-45 / 中科大雅 / 科技工業年輕成家
大雅公園（+3 公里）, 台中科技園區（+5 公里）
-人工智慧（計算） 、物聯網、共同基金 (投資) 、 GitHub 、大數據 (科學) 、智慧科技 (消費電子產品) 、半導體、航空公司、能量飲料（非酒精飲料） 、製造生產服務和組織 (製造業) 、 Compensation and benefits 、 Gadget & Gear 、 LifeStyle Home 、專業發展（職業訓練） 、股票經紀人 (投資) 、隨選影片 (影片串流服務) 、婚禮網站和部落格 (網站) 、婚紗攝影（攝影） 或婚戒（婚禮）"},{ta:"",proj:"",raw:"30-60/大台中/出國旅遊
-東海大學（+4 公里）, 台中機場（+3 公里）, 神岡國小（+4 公里）, 沙鹿車站（+4 公里）, 豐原車站（+4 公里）, 台中車站（+8 公里）, 中科路（+3 公里）
-外匯市場（貨幣） 、免稅商店、航空公司、商務艙（航空旅行） 、機場、機場貴賓室、 Travel the World 、 Visa Cash 或房地產（產業）"},{ta:"",proj:"",raw:"25-50 / 南區東區 / 吃喝玩樂
-建國北黃昏市場（+5 公里）, LaLaport Taichung（+3 公里）
-隨選影片 (影片串流服務) 、快時尚（服飾） 、網紅行銷 (行銷) 、火鍋、在地美食（美食和餐飲） 、燒烤（烹飪） 、美食家（美食和餐飲） 、酒精飲品（美食和餐飲） 、可樂、簡餐館（餐廳） 、乳製品 (乳製品) 、羽球 (球拍類運動) 、保齡球、卡拉OK 、韓國電視劇（電視節目） 、刺青（身體藝術） 、 PlayStation（遊戲機） 、淘寶網或美妝店 (零售)"},{ta:"",proj:"",raw:"30-50 / 北屯北區太平 / 3金融1房產
-太原車站（+5 公里）, 中友百貨（+5 公里）, 洲際棒球場（+5 公里）, 和牛涮台中文心崇德店（+5 公里）
-財經（商業與財務） 、金融服務（商業與財務） 、保險（商業與財務） 或房地產（產業）"},{ta:"",proj:"",raw:"30-65 / 北屯太平潭子 / 會計金融休閒
-洲際棒球場（+4 公里）, 潭子觀音媽祖廟（+4 公里）, 肥佬闆複合超市（+4 公里）
-財經（商業與財務） 、個人理財（銀行業） 、儲蓄（銀行業） 、存款帳戶 (銀行業) 、財務規劃（投資） 、財務會計（商業與財務） 、行動銀行（銀行業） 、會計系統、金融服務（商業與財務） 、登山（爬山） 、自行車（體育運動） 、戶外休閒活動（戶外活動） 、露營（戶外活動） 、釣魚（戶外活動） 、自助旅行 (旅遊) 、漁具或迪卡儂"},{ta:"",proj:"",raw:"**30-60 / 林口五股新北 / 金融投資
-緯度 25.07 經度 121.47 新莊區（+5 公里）, 緯度 25 經度 121.43 新莊區（+3 公里） New Taipei City; 緯度 25.06 經度 121.37 Taiwankou, T'Ai-Wan, Taiwan（+4 公里） Changhua
-交易策略（投資） 、金融市場（投資） 、金錢（貨幣） 、金融經濟學、財經（商業與財務） 、金融服務（商業與財務） 、金融分析、被動收入（商業與財務） 、投資管理（投資） 、股票市場（投資） 、投資（商業與財務） 、投資者（投資） 、不動產（房地產） 、收入（商業與財務） 或投資報酬率（投資）"},{ta:"",proj:"",raw:"30-65 / 南投中興草屯霧峰 / 長輩興趣
-霧峰農工（+4 公里）, 旭光高中（+3 公里）, 南投中興高中（+3 公里） ; 南投-南崗工業區（+3 公里）
-在家下廚 (烹飪和食譜) 、天然食品（美食和餐飲） 、農業新聞和內容 (農業) 、教育資源 (教育) 、純素營養（飲食） 、健康的習慣 (生活風格內容) 、觀鳥、旅行社和預訂 (旅遊觀光業) 、魚油、全價值營養、膽固醇（科學） 、中式料理（美食和餐飲） 、簡餐館（餐廳） 或休閒活動（休閒）"},{ta:"",proj:"",raw:"30-60 / 龍潭中壢 / 成家科技業
-龍潭渴望園區（+3 公里）, 國家原子能科技研究院（+3 公里） ; 龍潭科學園區（+5 公里）
-能源（科學） 、電腦科學（資訊技術） 、科學 (期刊) 、實驗室、軟體工程（資訊技術） 、 Python（程式語言） 、 GitHub 、科技新聞 (新聞服務) 、高等教育（教育） 、生物化學、發電、婚宴（婚禮） 、喜帖（婚禮） 、社群媒體（網路媒體） 或網紅行銷 (行銷)、行業類別：大型企業對企業（B2B）企業員工（500 名以上員工） 、中型企業對企業（B2B）企業員工（200 - 500 名員工） 、政府員工（全球） 或資訊科技和技術服務
0116
-實驗室、婚宴（婚禮） 、 GitHub 、電腦科學（資訊技術） 、科學 (期刊) 、發電、高等教育（教育） 、軟體工程（資訊技術） 、喜帖（婚禮） 、網紅行銷 (行銷) 、 Python（程式語言） 、社群媒體（網路媒體） 、科技新聞 (新聞服務) 、軟體開發（軟體） 、電腦工程（工程） 、數位貨幣（貨幣） 、納斯達克100指數或被動收入（商業與財務）,"},{ta:"",proj:"",raw:"28-60 / 基地+6K / 純房產
-Windy City Pizza 風城披薩（+6 公里）
-591房屋交易網、房地產（產業） 、房屋廣告和入口網站 (網站) 、住宅房地產 (房地產) 或首次購房者（房地產）"},{ta:"",proj:"",raw:"28-50 / 東區竹北 / 教育生活相關
-台元科技園區（+3 公里） ; 台積電三廠（+5 公里）, 新竹科學園區（+5 公里）
-語言教育、外語、航空公司、工程和理工學院 (教育) 、旅遊（旅遊觀光） 、網路 (電腦運算) 、慢跑（跑步） 、園藝（家居和園藝用品） 、超市（食品零售業者） 、生活用品（家居和園藝用品） 、網路社區、韓國電視劇（電視節目） 、美容（社會觀念） 、美學（哲學） 、商業模式 (商業和金融業) 、護膚保養（化妝品） 或咖啡廳（咖啡）"},{ta:"",proj:"",raw:"28-55 / 中山松山大安 / 科技商務
-松山巨蛋（+3 公里）, 臺北玫瑰園（+3 公里）, 台北萬豪酒店Taipei Marriott Hotel（+3 公里）
-Business networking 、男裝品牌 (服飾) 、女裝品牌 (服飾) 、 Podcast (音樂和音訊串流) 、 LifeStyle Food 、 Professional services 、業務開發 (商業活動) 、 Apple Music 、英式早餐、行動應用程式（軟體） 、健身和保健（健身） 、科技新聞 (新聞服務) 、消費電子產品媒體和內容 (電腦和電子產品) 、生產率或數位媒體（電腦和電子產品）"},{ta:"",proj:"",raw:"25-55 / 北部中彰 / 軟裝整建
-華山文創（+15 公里） ; 桃園車站（+15 公里） ; 台中中央公園（+15 公里）, 彰化車站（+15 公里）, 大甲車站（+15 公里） ; 竹北高鐵（+15 公里）
-室內設計內容 (設計) 、家務管理和整理 (居家和園藝用品) 、居家用品零售商 (零售) 、生活風格和家務內容 (居家和園藝用品) 、百葉簾、整建（建築業） 、住家翻新 (住家修繕) 、大掃除（清潔服務） 、節慶（活動） 、傢俱（居家裝潢） 或居家飾品 (居家裝潢)"},{ta:"",proj:"",raw:"28-55 / 彰市和美 /  育兒寵物
-彰化車站（+5 公里）, 大肚橋（+2 公里） ; 五鮮級鍋物專賣-和美白金店（+3 公里）
-家庭（社會觀念） 、親子教育（兒童和親子教育） 、廚房（家居和園藝用品） 、室內設計（設計） 、現代家具（居家裝潢） 、消費電子產品媒體和內容 (電腦和電子產品) 、幼兒教育（小學和中學教育） 、生活用品（家居和園藝用品） 、運動（體育運動） 、暑假（小學和中學教育） 、草地（園藝） 、任天堂 (遊戲機和相關配件) 、寵物食品（寵物用品） 、寵物（動物） 、貓糧（寵物用品） 或狗狗美容（寵物）
0115
-大肚橋（+3 公里）, 彰化車站（+3 公里）, 彰化果菜市場（+3 公里） ; 五鮮級鍋物專賣-和美白金店（+3 公里）"},{ta:"",proj:"",raw:"28-55 / 大林新港斗南 / 農企業
-新港老街（+5 公里） ; 大埔美園區（+5 公里）, 嘉義縣大林鎮（+5 公里） ; 斗南車站（+5 公里）
-農業新聞和內容 (農業) 、農業服務和組織 (產業) 、肥料（農業） 、農業機械（農業） 、有機農業（農業） 、農夫市集（食品零售業者） 、出口貿易、批發（零售） 、物流（商業與財務） 、園藝（農業） 、天氣預報、政府機關概念和作法 (法律和政府) 、溫室、食品加工、中式料理（美食和餐飲） 、食品保存、生物技術、住宅區（房地產） 或連棟住宅（建築）
0203
-民雄車站（+3 公里）, 新港老街（+3 公里） ; 嘉義縣大林鎮（+5 公里） ; 南笨港休閒農業區（+3 公里）, 斗南車站（+3 公里）
+田地 (農業) 、農企業（農業） 或園藝（戶外活動）"},{ta:"",proj:"",raw:"28-55 / 竹北竹南科 / 程式運動電玩
-新竹科學園區（+5 公里）, 新竹系統交流道（+5 公里）, 竹南科學園區（+5 公里）
-基於組件的軟體工程、程式語言（計算） 、開放原始碼軟體、 PHP 、科技新聞 (新聞服務) 、 Java 、有氧運動 (健身) 、健身（體育運動） 、羽球 (球拍類運動) 、電玩遊戲（遊戲） 、 PlayStation（遊戲機） 、超級馬利奧系列、薩爾達傳說、電玩遊戲網路媒體 (電玩遊戲) 或收藏用玩具 (玩具)
0306
+科技傳播學、馬拉松 (跑步) 、玩命關頭或手機遊戲（電玩遊戲）"},{ta:"",proj:"",raw:"35-65 / 中北部 / 退休度假興趣
-臺北車站（+20 公里） ; 台中中央公園（+20 公里）, FAMWOOD 自然紅屋（+20 公里） ; 彰化員林（+20 公里） ; 竹北高鐵（+20 公里）
-Outdoor Living 、 Prefabricated home 、居家風格和類型 (房地產) 、度假屋（住宿） 、庭院家具（居家裝潢） 、農家樂、日式旅館、度假屋出租（住宿） 、退休規劃（銀行業） 、退休社區（房地產） 、觀鳥、健行和露營 (戶外活動) 或水族飼養"},{ta:"",proj:"",raw:"28-50 / 東區竹北 / 工程師汽車
-台元科技園區（+3 公里） ; 台積電三廠（+5 公里）, 新竹科學園區（+5 公里）
-Python（程式語言） 、軟體工程（資訊技術） 、程式語言（計算） 、 C語言、軟體開發（軟體） 、行動應用程式（軟體） 、開放原始碼軟體、電動車（交通工具） 、特斯拉汽車（交通工具） 、油電混合車（交通工具） 、洗車 (汽車零件和服務) 、汽車美容（交通工具） 或汽車保養（交通工具）、行業類別：資訊科技和技術服務
0127
+汽車維修廠（交通工具） 、鍍膜、油電混合動力車（交通工具） 、改裝車（交通工具） 、露營車 (旅遊觀光) 或自訂車款（交通工具）,"},{ta:"",proj:"",raw:"28-55 / 中山 / 商務貿易
-汐止五股高架段（+3 公里）, 台北市進出口商業同業公會（+3 公里）
-Business networking 、業務開發 (商業活動) 、國際貿易、進口（郵遞） 、出口貿易、 B2B（商業與財務） 、銷售管理 (商業活動) 、 Procurement 、商業（商業與財務） 、物流（商業與財務） 、供應鏈、經銷（商業） 、倉儲業（產業） 或企業家（商業與財務）
0130
+民族東路， 台北市（+3 公里） Taipei
+外語、價格、運輸和物流服務和組織 (商業和金融) 、開發潛在顧客 (行銷) 或商機 (商業和金融業)"},{ta:"",proj:"",raw:"30-60 / 桃園蘆竹 / 藝術品投資
-桃園藝文廣場（+3 公里）, 好市多Costco南崁店（+3 公里）
-藝術和音樂（藝術） 、當代藝術（視覺藝術） 、藝術展覽（視覺藝術） 、藝術品（視覺藝術） 、手工藝（工藝品） 、雕刻（藝術） 、寶石（金屬與礦物） 、裝飾風藝術、花卉（植物與花卉） 、投資（商業與財務） 、美國運通、納斯達克100指數、投資管理（投資） 、插花、資產管理 (商業和金融業) 、被動收入（商業與財務） 或收藏（興趣）"},{ta:"",proj:"",raw:"35-65 / 龍潭石門 / 投資證券美股
-龍潭渴望園區（+3 公里）, 大平里（+3 公里）, 龍潭交流道（+2 公里）
-證券交易所（投資） 、財務規劃（投資） 、股票市場（投資） 、被動收入（商業與財務） 、股份 (金融) 、投資管理（投資） 、股票經紀人 (投資) 、資產管理 (商業和金融業) 、私募基金、私募股權投資 (投資) 、 Tax preparation 、私人銀行服務、納斯達克100指數、道瓊斯工業平均指數或標準普爾500指數"},{ta:"",proj:"",raw:"30-65 / 北屯太平潭子 / 換工作搬遷
-洲際棒球場（+4 公里）, 潭子觀音媽祖廟（+4 公里）, 肥佬闆複合超市（+4 公里）
-職涯發展（工作機會） 、 Business networking 、領英、領導（社會觀念） 、專業發展（職業訓練） 、職涯（就業） 、商業領袖 (商業和金融) 、新家、房屋（房地產） 、起步房（房地產） 或上班族（流行文化）、行為：通勤者、生活要事：最近搬家或遠離家鄉
0130(加了之後很穩定)
+個人發展（個人身分） 、成人教育（職業訓練） 、在地美食（美食和餐飲） 或生產率, 行為：不與家人同住"},{ta:"",proj:"",raw:"35-65 / 龍潭石門 / 度假休閒品酒
-龍潭渴望園區（+3 公里）, 大平里（+3 公里）, 龍潭交流道（+2 公里）
-Boutique hotel 、品酒 (葡萄酒) 、酒莊 (葡萄酒) 、 Lifestyle Travel 、 Cultural travel 、葡萄園、度假村（旅遊觀光業） 、跨界休旅車、住宿加早餐酒店、遊輪（旅遊觀光業） 、都會車 (汽車) 、別墅（住宿） 、美國運通、精品咖啡 (咖啡) 、前菜或外匯市場（貨幣）"},{ta:"",proj:"",raw:"35-65 / 桃竹苗 / 長輩休閒
-Taoyuan City; Hsinchu; Miaoli; Hsinchu City
-Outdoor Living 、農家樂、度假屋（住宿） 、水族飼養、觀鳥、釣魚（戶外活動） 、登山步道（健行） 、木工（手工藝） 、茶葉品牌 (食物和飲品) 、 RV Travel 、休旅車營地（露營） 、國家公園 (旅遊目的地) 、雕刻（藝術） 、園藝（戶外活動） 、水療（個人護理） 、麻將、中華文化或歷史（歷史）"},{ta:"",proj:"",raw:"30-50 / 北區 / 業務性質
-北大路， 新竹市（+3 公里） Hsinchu City
-零售銀行業務（銀行業） 、業務開發 (商業活動) 、人壽保險（保險） 、保單（保險） 、證券（金融） 、信用卡（借貸） 、汽車業（產業） 、 Business networking 、行銷（商業與財務） 、行銷服務和組織 (行銷) 、直效營銷、財務顧問 (投資) 、 B2B（商業與財務） 、汽車經銷（零售業者） 、開發潛在顧客 (行銷) 或設計貿易展和專業組織 (貿易展)"},{ta:"",proj:"",raw:"28-55 / 林口 / 外商科技業
-台灣艾司摩爾（+3 公里） ; 美商祥茂光電科技（+3 公里）
-新興技術（科學） 、 AI 、科技傳播學、科技新聞 (新聞服務) 、 http://geek.com/ 、基於組件的軟體工程、機器學習（計算） 、英語（語言） 、跨國公司、 IT諮詢、 International business 、半導體、物聯網、電光源、軟體工程（資訊技術） 或物理學 (物理學)、生活要事：遠離家鄉或不與家人同住
0202
+國際新聞 (新聞服務) 、消費電子展、科學媒體和內容 (科學) 或 Google開發人員, 行為：經常旅行的用戶"},{ta:"",proj:"",raw:"28-55 / 彰市和美 /  零售批發自營
-彰化果菜市場（+3 公里）, 彰化車站（+3 公里）, 大肚橋（+3 公里） ; 五鮮級鍋物專賣-和美白金店（+3 公里）
-商業模式 (商業和金融業) 、零售業（產業） 、批發（零售） 、供應鏈、獨資企業（商業與財務） 、經銷（商業） 、居家事業（商業與財務） 、小型企業（商業與財務） 、銀行帳戶 (銀行業) 、行銷企劃 (行銷) 、貿易（經濟） 、社群媒體行銷（行銷） 、網紅行銷 (行銷) 、網路購物（零售） 或電子商務（零售）
0211
+價格、配送（商務） 、節慶（活動） 或淘寶網"},{ta:"",proj:"",raw:"28-55 / 彰市和美 /  建築生活品質
-彰化果菜市場（+3 公里）, 彰化車站（+3 公里）, 大肚橋（+3 公里） ; 五鮮級鍋物專賣-和美白金店（+3 公里）
-住宅房地產 (房地產) 、建材（工業材料和設備） 、結構工程、 Sustainable architecture 、營建管理、砌體結構、整建（建築業） 、新聞媒體（新聞服務） 、建築媒體 (設計) 、居家用品零售商 (零售) 、家電品牌和零售商 (零售) 、生活品質（心理學） 、生活風格 (生活風格內容) 、自我照護（心理學） 或身心健康（心理學）"},{ta:"",proj:"",raw:"30-60 / 花壇大村 / 汽車貿易業者
-彰化花壇國小（+4 公里）, 大村鄉（+4 公里）
-連棟住宅（建築） 、批發（零售） 、電動車（交通工具） 、經銷（商業） 、出口貿易、二手車（交通工具） 、 Lexus 汽車（交通工具） 、賓士（交通工具） 、汽車業（產業） 、國際貿易、運輸（交通運輸） 、別墅（住宿） 、貿易（經濟） 、物流（商業與財務） 、 Nissan 汽車（交通工具） 、新聞媒體（新聞服務） 、進口（郵遞） 或汽車零件製造和銷售 (汽車)"},{ta:"",proj:"",raw:"28-50 / 東區北區 / 年輕買房
-精武路（+3 公里）, 永興街， 台中市（+3 公里） Taichung
-Instagram（社群媒體） 、綜藝電視節目 (電視節目) 、表演藝術（表演藝術） 、演唱會（音樂活動） 、現場活動 (活動) 、節慶（活動） 、派對（活動） 、美妝網紅 (美妝) 、被動收入（商業與財務） 、低成本航空公司、股票市場（投資） 、時事（政治） 、房地產（產業） 或房屋（房地產）、行為：網紅創作者或餐飲創作者"},{ta:"",proj:"",raw:"28-55 / 竹南頭份 / 銀行保險業
-公義路， 竹南鎮（+3 公里）, 竹南光復路（+3 公里）, 兆豐國際商業銀行-頭份分行（+3 公里） Miaoli
-銀行業（金融） 、證券（金融） 、財務會計（商業與財務） 、財務規劃（投資） 、金融服務（商業與財務） 、外匯市場（貨幣） 、儲蓄（銀行業） 、業務開發 (商業活動) 、 Professional services 、個人理財（銀行業） 、人壽保險（保險） 、一般保險 (保險) 或開發潛在顧客 (行銷)、行業類別：商業與金融或行政服務
0312
+零售銀行業務（銀行業） 、 Business networking 、投資銀行業（銀行業） 或旅遊平安保險"},{ta:"",proj:"",raw:"30-55 / 龍井 / 零售批發自營
-台中市龍井區（+3 公里）, 中彰大橋， 台中市（+3 公里）, 向上路六段， 台中市（+3 公里） Taichung
-零售業（產業） 、批發（零售） 、小型企業（商業與財務） 、居家事業（商業與財務） 、經銷（商業） 、供應鏈、銀行帳戶 (銀行業) 、貿易（經濟） 、電子商務（零售） 、行銷企劃 (行銷) 、社群媒體行銷（行銷） 、網紅行銷 (行銷) 、網路購物（零售） 、價格、商業模式 (商業和金融業) 、開發潛在顧客 (行銷) 或餐飲業（餐飲）、行為：通勤者"},{ta:"",proj:"",raw:"28-50 / 后里中科 / 科技業家庭
-后里科技園區（+3 公里）, 神岡交流道， 台中市（+3 公里）, 科雅路， 台中市（+3 公里） Taichung
-物聯網、智慧科技 (消費電子產品) 、 iPhone（智慧型手機） 、房屋保險（保險） 、室內設計（設計） 、 591房屋交易網、排屋、連棟住宅（建築） 、家電（消費電子產品） 、傢俱（居家裝潢） 、一般保險 (保險) 、家務（家居和園藝用品） 、生活用品（家居和園藝用品） 、一般健康 (個人護理) 或美食家（美食和餐飲）
0312
+時尚設計（設計） 、商業智慧 (商業和金融業) 、酒精飲品（美食和餐飲） 或消費電子展"},{ta:"",proj:"",raw:"28-55 / 西屯精科 / 親子教育工業
-春安國小（+2 公里）, 精科五路， 台中市（+3 公里）, 五權西路三段， 台中市（+3 公里） Taichung
-上班族（流行文化） 、量販店（食品零售業者） 、親子教育（兒童和親子教育） 、家樂福、幼兒教育（小學和中學教育） 、教育（社會觀念） 、幼兒照護（兒童和親子教育） 、製造業（產業） 、婚姻（婚禮） 、代工生產、親子天下或製造生產服務和組織 (製造業)"},{ta:"",proj:"",raw:"30-45 / 西屯西區 / 業務性質
-水湳經貿園區（+3 公里）, 臺中市不動產仲介經紀商業同業公會（+3 公里）
-零售銀行業務（銀行業） 、業務開發 (商業活動) 、人壽保險（保險） 、保單（保險） 、證券（金融） 、信用卡（借貸） 、汽車業（產業） 、 Business networking 、行銷（商業與財務） 、行銷服務和組織 (行銷) 、直效營銷、財務顧問 (投資) 、 B2B（商業與財務） 、汽車經銷（零售業者） 、開發潛在顧客 (行銷) 或設計貿易展和專業組織 (貿易展)"},{ta:"",proj:"",raw:"30-60 / 桃園蘆竹 / 親子教育
-桃園藝文廣場（+3 公里）, 好市多Costco南崁店（+3 公里）
-教育資源 (教育) 、教養方式 (兒童和親子教育) 、育兒雜誌 (媒體刊物) 、媽媽寶寶-懷孕、生產、育兒、親子教育（兒童和親子教育） 、新生兒派對（兒童和親子教育） 、嬰幼兒和孕婦用品店 (零售) 、在家教育（小學和中學教育） 、 LifeStyle Home 、繪畫（視覺藝術） 、家庭（社會觀念） 、運動類遊戲 (電玩遊戲) 、家庭桌遊 (遊戲) 或語言教育、家長：嬰幼兒家長（01-02 歲） 、學齡前兒童的家長（03-05 歲） 或低年級學童（06-08 歲）的家長
0310
+蒙台梭利教育法、兒童發展（小學和中學教育） 、樂器（樂器） 或親子 (雜誌)"},{ta:"",proj:"",raw:"30-50 / 草屯霧峰大里 / 通勤上班教育
-草屯鎮公有市場（+5 公里）, 霧峰健體中心（+5 公里）, 中投快速公路， 台中市（+3 公里） Taichung; 中投快速公路， Caotun Township（+16 公里） Nantou
-親子教育（兒童和親子教育） 、教育資源 (教育) 、課外活動、新聞媒體（新聞服務） 、製造生產服務和組織 (製造業) 、商業（商業與財務） 、人力資源管理（商業與財務） 、時事（政治） 、家務管理和整理 (居家和園藝用品) 、一般健康 (個人護理) 、本田汽車（交通工具） 或豐田汽車（交通工具）、行為：通勤者"},{ta:"",proj:"",raw:"28-55 / 大肚烏日/  建築生活品質
-彰化果菜市場（+3 公里）, 彰化車站（+3 公里）, 大肚橋（+3 公里） ; 五鮮級鍋物專賣-和美白金店（+3 公里）
-住宅房地產 (房地產) 、建材（工業材料和設備） 、結構工程、 Sustainable architecture 、營建管理、砌體結構、整建（建築業） 、新聞媒體（新聞服務） 、建築媒體 (設計) 、居家用品零售商 (零售) 、家電品牌和零售商 (零售) 、生活品質（心理學） 、生活風格 (生活風格內容) 、自我照護（心理學） 或身心健康（心理學）、行業類別：建築與工程
0304
-烏日工業城（+3 公里）, 大肚橋（+3 公里）, 沙田路二段（+3 公里）
+五金行（零售業者） 、土木工程（工程） 、風險管理或木工 (興建和維修)"},{ta:"",proj:"",raw:"28-55 / 太平大里 /  藍領公教職
-大里中興商圈（+2 公里）, 大里工業區（+3 公里）, 大源十九街， 台中市（+3 公里） Taichung
-師範教育（職業訓練） 、上班族（流行文化） 、技術員、工廠（製造業） 、保單（保險） 、存款帳戶 (銀行業) 、配電系統、代工生產、公共運輸（交通運輸） 、超市（食品零售業者） 、本日優惠（零售） 、教育資源 (教育) 、教養方式 (兒童和親子教育) 、節儉生活風格內容 (零售) 、 Retirement Insurance Benefits 、專業發展（職業訓練） 、退伍軍人福利（軍事） 或家務管理和整理 (居家和園藝用品)"},{ta:"",proj:"",raw:"30-60/ 中科中清/ 傳產製造食品加工
-中清交流道-全國加油站（+3 公里）, 中科路， 台中市（+2 公里） Taichung
-上班族（流行文化） 、房屋（房地產） 、汽車美容（交通工具） 、飲食業、 591房屋交易網、工程（科學） 、倉儲業（產業） 、汽車經銷（零售業者） 、食品加工、汽車業（產業） 、製造業（產業） 、運輸（交通運輸） 、零部件市場、物流（商業與財務） 、房地產（產業） 、不動產（房地產） 或科技（電腦和電子產品）, 行為：使用 Facebook 的管道（行動裝置）：所有行動裝置或餐飲創作者"},{ta:"",proj:"",raw:"35-65 / 中彰投 / 企業主戶外
-Taichung; Changhua; Nantou
-企業家（商業與財務） 、商業計畫 (商業活動) 、市場趨勢 (商業和金融業) 、 Prefabricated home 、建築媒體 (設計) 、居家風格和類型 (房地產) 、 RV Travel 、露營車 (旅遊觀光) 、休旅車營地（露營） 、生態旅遊（旅遊觀光） 或 Outdoor Living"},{ta:"",proj:"",raw:"35-65 / 桃竹苗 / 鄉村休閒
-Taoyuan City; Hsinchu; Miaoli; Hsinchu City
Prefabricated home 、居家風格和類型 (房地產) 、生態旅遊（旅遊觀光） 、農家樂、拖掛式房車、農村、旅遊景點和活動 (旅遊觀光業) 、休閒活動（休閒） 、家庭（社會觀念） 、公園與遊憩、 Farm-to-table 或園藝（戶外活動）"},{ta:"",proj:"",raw:"30-55 / 后里豐原 /  零售批發自營
-豐原商圈（+3 公里）, 甲后路二段， 台中市（+3 公里） Taichung; 龍貓隧道（+3 公里）
-商業模式 (商業和金融業) 、零售業（產業） 、批發（零售） 、經銷（商業） 、供應鏈、居家事業（商業與財務） 、小型企業（商業與財務） 、銀行帳戶 (銀行業) 、貿易（經濟） 、電子商務（零售） 、行銷企劃 (行銷) 、社群媒體行銷（行銷） 、網紅行銷 (行銷) 或網路購物（零售）"},{ta:"",proj:"",raw:"30-65 / 南投草屯霧峰 / 休閒園藝
-南投中興高中（+3 公里）, 草屯敦和宮財神廟（+3 公里）, 農業部農業試驗所（+3 公里） ; 南投-南崗工業區（+3 公里）, 寶湖宮天地堂地母廟乾元殿（+4 公里）
-茶葉品牌 (食物和飲品) 、遊程承攬業、跟團旅行 (旅遊觀光) 、園藝工具 (花園和園藝造景) 、園藝（家居和園藝用品） 、露營車 (旅遊觀光) 、休旅車營地（露營） 、國家公園 (旅遊目的地) 、中華文化、登山步道（健行） 、節儉生活風格內容 (零售) 、咖啡豆（咖啡） 、均衡飲食（個人護理） 或葡萄酒相關內容 (食物和飲品), 感情狀況：已婚, 家長：父母（全部）
0309
-霧峰農工（+3公里）, 旭光高中（+3 公里）, 南投中興高中（+3 公里） ; 南投-南崗工業區（+3 公里）"},{ta:"",proj:"",raw:"28-55 / 苗栗(市區苑裡) / 居家裝飾設計
-群翼室內裝修設計（+5 公里）, 安百玉室內設計 Anbaiyu Design（+6 公里）, 輕井澤-康勝建設康宏建設（+5 公里）
-居家飾品 (居家裝潢) 、居家裝飾 (室內裝潢) 、居家裝潢構想 (室內裝潢) 、室內裝潢品牌和零售商 (零售) 、百葉簾、現代家具（居家裝潢） 、生活風格 (生活風格內容) 、北歐風設計（建築） 、建築媒體 (設計) 、室內設計（設計） 、窗戶（建築） 或房地產（產業）
0325
-Miaoli County"},{ta:"",proj:"",raw:"30-60 / 嶺東烏日南區 / 行銷人力管理
-新烏日車站（+5 公里）, 嶺東科技大學（+3 公里）, 大慶夜市（+3 公里）, 文心森林公園站（+3 公里）
-高階管理人員、行銷企劃 (行銷) 、商機 (商業和金融業) 、社群媒體行銷（行銷） 、購物中心（零售） 、銷售管理 (商業活動) 、開發潛在顧客 (行銷) 、行銷策略（行銷） 、零售業（產業） 、服裝（服飾） 、共用工作空間、商業領袖 (商業和金融) 、小型企業（商業與財務） 、時尚（流行文化） 或人力資源管理（商業與財務）"},{ta:"",proj:"",raw:"30-60 / 林口五股新莊 / 金融投資
-林口長庚研究大樓（+4 公里） ; 新樹路310巷， 新北市（+3 公里）, 中正北路560巷， 新北市（+5 公里） New Taipei City
-金融市場（投資） 、交易策略（投資） 、金錢（貨幣） 、金融經濟學、財經（商業與財務） 、金融服務（商業與財務） 、金融分析、被動收入（商業與財務） 、投資管理（投資） 、股票市場（投資） 、投資（商業與財務） 、投資者（投資） 、不動產（房地產） 、收入（商業與財務） 或投資報酬率（投資）"},{ta:"",proj:"",raw:"30-60 / 草屯南投 / 汽車工業
-草屯鎮公有市場（+5 公里） ; 南投-南崗工業區（+3 公里）, 中研路， 南投市（+3 公里） Nantou
-汽車業（產業） 、二手車（交通工具） 、汽車經銷（零售業者） 、汽車零件製造和銷售 (汽車) 、卡車（交通工具） 、批發（零售） 、製造生產服務和組織 (製造業) 、建築工程、土木工程（工程） 、居家裝修（家居和園藝用品） 、金屬、一般保險 (保險) 、儲蓄（銀行業） 或酒精飲品（美食和餐飲）"},{ta:"",proj:"",raw:"30-50 / 北屯潭子 / 自由業
-洲際棒球場（+3 公里）, 潭子觀音媽祖廟（+3 公里）
-自由工作者（工作機會） 、業務開發 (商業活動) 、 Business networking 、創意創業 (商業和金融業) 、開發潛在顧客 (行銷) 、個人發展（個人身分） 、攝影師（攝影） 、設計（設計） 、居家辦公家具 (居家裝潢) 、 Project management software 、影音俱樂部、 MacBook 、 Canva 、生產率或網路銀行（銀行業）"},{ta:"",proj:"",raw:"30-55 / 北斗田尾 / 公務員教育
-田尾國小（+3 公里）, 北斗工業區（+3 公里）
-親子教育（兒童和親子教育） 、人壽保險（保險） 、家庭（社會觀念） 、教養方式 (兒童和親子教育) 、教育技術學（教育） 、政府機關概念和作法 (法律和政府) 、銀行業（金融） 、均衡飲食（個人護理） 、社區議題（法律與政府） 、健身和保健（健身） 或新聞媒體（新聞服務）"},{ta:"",proj:"",raw:"28-55 / 台中(北屯豐原) / 家具零售
-洲際棒球場（+5 公里）, 豐原車站（+5 公里）
-現代家具（居家裝潢） 、百葉簾、居家裝潢構想 (室內裝潢) 、室內裝潢品牌和零售商 (零售) 、宜家家居（零售業者） 、 Workinghouse 生活工場、大創百貨、家樂福、網路購物網站 (網站) 、 momo購物網、居家裝修（家居和園藝用品） 、住家翻新 (住家修繕) 或整建（建築業）"},{ta:"",proj:"",raw:"30-55 / 伸港鹿港線西 / 傳產代工家庭
-85。c鹿港鹿和店（+5 公里）, 鹿工路， 鹿港鎮（+3 公里）, 彰濱工業區 線西區（+3 公里）, 彰新路七段， Shenkang, T'Ai-Wan, Taiwan（+5 公里） Changhua
-連棟住宅（建築） 、批發（零售） 、出口貿易、排屋、進口（郵遞） 、紡織品、化學工業、玻璃、生物可分解塑膠、汽車業（產業） 、居家事業（商業與財務） 、 B2B（商業與財務） 、 Procurement 、代工生產或會計學（商業與財務）"},{ta:"",proj:"",raw:"30-55 / 伸港和美 / 五金自營商
-台中商銀和美分行（+5 公里） ; 彰新路七段， Shenkang, T'Ai-Wan, Taiwan（+5 公里） Changhua
-連棟住宅（建築） 、批發（零售） 、排屋、代工生產、 B2B（商業與財務） 、五金行（零售業者） 、零部件市場、製造業（產業） 、不鏽鋼、水管修繕（建築業） 、金屬加工（建築業） 、建材（工業材料和設備） 、居家裝修（家居和園藝用品） 、住家翻新 (住家修繕) 或傢俱（居家裝潢）、行為：小型企業主
0409
+電力、改裝車（交通工具） 或配電系統、行為：小型企業主或通勤者"},{ta:"",proj:"",raw:"35-55 / 中清洲際 / 老闆高管
-中清路二段（+2 公里）, 洲際棒球場（+2 公里）
-高淨值人士（商業與財務） 、佳士得、 Art auction 、精品 (生活風格內容) 、路易威登（時尚品牌） 、愛馬仕（服飾） 、藝術展覽（視覺藝術） 、勞力士（手錶） 、商業領袖 (商業和金融) 、高階管理人員、保時捷、賓士（交通工具） 、管理（商業與財務） 、投資策略（投資） 、私人銀行服務或企業家（商業與財務）"},{ta:"",proj:"",raw:"30-60 / 北屯太平潭子 / 餐廳零售業
-洲際棒球場（+3 公里）, 74太平松竹路（+3 公里）, 潭子觀音媽祖廟（+3 公里）
-休閒餐廳 (餐廳) 、管理（商業與財務） 、食品和飲品 (食物和飲品) 、咖啡文化 (咖啡) 、烹飪學（美食和餐飲） 、中式料理（美食和餐飲） 、韓式料理（美食和餐飲） 、日本料理（美食和餐飲） 、零售業（產業） 、業務開發 (商業活動) 、社群媒體行銷（行銷） 、廚具（廚房與餐廚） 或節慶（活動）、行為：Instagram 商業檔案管理員、生活要事：不與家人同住
0324
+台灣菜或 LifeStyle Food, 行為：美食與餐廳類粉絲專頁管理員"},{ta:"",proj:"",raw:"35-55 / 西屯水湳 / 金融投資
-水湳經貿園區（+2 公里）, 龍富路五段+龍富二十二路路口（+2 公里）
-金融市場（投資） 、金融經濟學、交易策略（投資） 、被動收入（商業與財務） 、投資管理（投資） 、資產管理 (商業和金融業) 、納斯達克100指數、倫敦證券交易所 (投資) 、美國運通、現金、特斯拉汽車（交通工具） 、 NVIDIA GeForce 、住宅房地產 (房地產) 、房地產（產業） 或黃金（金屬與礦物）"},{ta:"",proj:"",raw:"30-55 / 竹科關埔 / 精品私校教育
-新竹巨城（+3 公里）, 關埔特區（+3 公里）
-蒙台梭利教育法、私立學校（教育） 、國際學校（小學和中學教育） 、 Bilingual education 、樂器（樂器） 、藝術和音樂（藝術） 、兒童發展（小學和中學教育） 、精品（零售） 、精品 (生活風格內容) 、園藝（家居和園藝用品） 、豪華轎車（交通工具） 、露台（園藝） 、股票市場（投資） 或高淨值人士（商業與財務）"},{ta:"",proj:"",raw:"30-50 / 大台中 / 金融投資
-台中中央公園（+8 公里）
-金融經濟學、投資管理（投資） 、交易策略（投資） 、被動收入（商業與財務） 、外匯市場（貨幣） 、黃金（金屬與礦物） 、石油、股票（投資） 、新聞媒體（新聞服務） 、半導體、精品（零售） 、航空公司、家庭自動化（消費電子產品） 或一般保險 (保險)"},{ta:"",proj:"",raw:"30-50 / 鹿港和美 / 零售批發自營
-台中商銀和美分行（+4 公里） ; 85。c鹿港鹿和店（+4 公里）
-小型企業（商業與財務） 、商業模式 (商業和金融業) 、零售業（產業） 、批發（零售） 、產品（公司） 、經銷（商業） 、供應鏈、居家事業（商業與財務） 、電子商務（零售） 、自僱（工作機會） 、貿易（經濟） 、行銷（商業與財務） 、網路廣告（行銷） 、價格或節慶（活動）
0401
-台中商銀和美分行（+4 公里） ; 85。c鹿港鹿和店（+4 公里）, 精誠夜市（+4 公里）
+直運（零售業者） 或會計學（商業與財務）, 行為：商家的粉絲專頁管理員"},{ta:"",proj:"",raw:"**30-60 / 新北三重 / 科技業+旅遊
-新北產業園區（+5 公里）, 三重捷運站（+5 公里）
-人工智慧（計算） 、房屋（房地產） 、旅遊網站（網站） 、大數據 (科學) 、免稅商店、智慧科技 (消費電子產品) 、高科技（電腦和電子產品） 、新興技術（科學） 、飯店（住宿） 、房地產（產業） 、 Hotels.com（住宿） 、旅遊（旅遊觀光） 、 Trivago 或 Booking.com（旅遊觀光業）"},{ta:"",proj:"",raw:"30-55 / 大埤斗南 / 食品代工
-豐田工業區（+4 公里）, 斗南車站（+3 公里）
-工廠（製造業） 、連棟住宅（建築） 、自僱（工作機會） 、代工生產、製造生產服務和組織 (製造業) 、食品產業、食品加工、化學、環境科學（科學） 、包裝和標籤（商業與財務） 、急凍食品、飲料（美食和餐飲） 、批發（零售） 、物流（商業與財務） 或一般保險 (保險)"},{ta:"",proj:"",raw:"30-60 / 北區東區 / 教育/投資
-新竹好市多（+4 公里）, 湳雅公園（+4 公里）
-閱讀（傳播） 、教育（社會觀念） 、學習（教育） 、課程（教育） 、學校（教育） 、文學（藝術） 、室內設計（設計） 、電子書（媒體刊物） 、個人理財（銀行業） 、財務規劃（投資） 、股票（投資） 、書籍（媒體刊物） 或房地產投資（投資）"},{ta:"",proj:"",raw:"30-60 / 東區竹東 / 研究/高知識/綠生活
-新竹好市多（+4 公里）, 竹東工研院（+4 公里）
-研究、科學 (期刊) 、高等教育（教育） 、教育新聞 (教育) 、自然科學、哲學、研究所教育（高等教育） 、財經（商業與財務） 、文學（藝術） 、實驗室、新興技術（科學） 、大眾媒體（娛樂與媒體） 、工程和理工學院 (教育) 、數學、植物園、森林生態學或觀賞植物（植物與花卉）"},{ta:"",proj:"",raw:"30-55 / 伸港鹿港線西 / 科技家庭自住
-85。c鹿港鹿和店（+5 公里）, 鹿工路， 鹿港鎮（+3 公里）, 彰濱工業區 線西區（+3 公里）, 彰新路七段， Shenkang, T'Ai-Wan, Taiwan（+5 公里） Changhua
-一般健康 (個人護理) 、生活用品（家居和園藝用品） 、家務（家居和園藝用品） 、家電（消費電子產品） 、傢俱（居家裝潢） 、一般保險 (保險) 、房屋（房地產） 、 591房屋交易網、室內設計（設計） 、房屋保險（保險） 、排屋、連棟住宅（建築） 、 iPhone（智慧型手機） 、物聯網或智慧科技 (消費電子產品)"},{ta:"",proj:"",raw:"(test)30-55/中科水湳中清/房地產/股票
-水湳中央公園（+2 公里）, 中清交流道（+2 公里）, 中科路， 台中市（+3 公里）
-房地產（產業） 、住宅房地產 (房地產) 、 591房屋交易網、不動產（房地產） 、股市指數期貨 (商業金融) 、股票（投資） 、財務規劃（投資） 、證券（金融） 、股票經紀人 (投資) 或交易策略（投資）"},{ta:"",proj:"",raw:"(test)30-55/中科水湳中清/在地餐飲/服務業
-水湳中央公園（+2 公里）, 中清交流道（+2 公里）, 中科路， 台中市（+3 公里） Taichung
-顧客服務（商業與財務） 、餐飲業（餐飲） 、 Restaurant management 、商業模式 (商業和金融業) 、食品保存、飲料（美食和餐飲） 、中式料理（美食和餐飲） 、咖啡文化 (咖啡) 、在地美食（美食和餐飲） 、早午餐（美食和餐飲） 或輪班工作制（商業與財務）"},{ta:"",proj:"",raw:"30-60 / 新北三重 / 資訊/金融期貨
-新北產業園區（+5 公里）, 三重捷運站（+5 公里）
-資訊科技（電腦和電子產品） 、資料管理 (軟體) 、資料分析 (商業和金融業) 、資料視覺化 (科學) 、機器學習（計算） 、防毒軟體、金融經濟學、投資管理（投資） 、股票（投資） 、被動收入（商業與財務） 、黃金（金屬與礦物） 、石油、半導體、精品（零售） 、航空公司、家庭自動化（消費電子產品） 或交易策略（投資）"},{ta:"",proj:"",raw:"30-60 / 林口蘆竹 / 精品/藝術品/投資
-林口 三井（+4 公里） ; 蘆竹光明河濱公園（+4 公里）
-藝術和音樂（藝術） 、當代藝術（視覺藝術） 、藝術展覽（視覺藝術） 、藝術品（視覺藝術） 、雕刻（藝術） 、寶石（金屬與礦物） 、裝飾風藝術、花卉（植物與花卉） 、美國運通、納斯達克100指數、投資管理（投資） 、插花、被動收入（商業與財務） 、收藏（興趣） 、石英、黃金（金屬與礦物） 、精品（零售） 或房地產（產業）"},{ta:"",proj:"",raw:"30-65/南興公園+6/金融投資
-南興公園（+6 公里）
-金融經濟學、投資管理（投資） 、交易策略（投資） 、被動收入（商業與財務） 、外匯市場（貨幣） 、黃金（金屬與礦物） 、石油、股票（投資） 、新聞媒體（新聞服務） 、半導體、精品（零售） 、航空公司、家庭自動化（消費電子產品） 或一般保險 (保險)"},{ta:"",proj:"",raw:"30-60 / 員林埔心 / 軍公教/教育
-員林市（+5 公里）, 彰化縣埔心鄉公所（+4 公里）
-戶外休閒活動（戶外活動） 、歌唱（音樂） 、退伍軍人福利（軍事） 、表演藝術（表演藝術） 、圖書館、假期（活動） 、教育技術學（教育） 、時事（政治） 、英語（語言） 、婚禮（社會觀念） 、師範教育（職業訓練） 、政府（政府機構） 、 YouTube（串流服務） 、休旅車（交通工具） 或掀背車（交通工具）"},{ta:"",proj:"",raw:"30-65/南興公園+6/置產/醫師/高管
-南興公園（+6 公里）
-閱讀（傳播） 、中小型企業（商業與財務） 、個人理財（銀行業） 、金融服務（商業與財務） 、生物技術、特斯拉汽車（交通工具） 、股票（投資） 、房地產開發（房地產） 、健身和保健（健身） 、生物學（科學） 、書籍（媒體刊物） 、醫學院 (高等教育) 、房地產（產業） 或管理（商業與財務）"},{ta:"",proj:"",raw:"30-65/南興公園+6/政治/置產/科技
-南興公園（+6 公里）
人工智慧（計算） 、房屋（房地產） 、社會運動（社會公益理念） 、金融市場（投資） 、個人理財（銀行業） 、大數據 (科學) 、機器學習（計算） 、 iPad 、被動收入（商業與財務） 、時事（政治） 、股票（投資） 、 MacBook Pro 、房地產投資（投資） 、政府機關概念和作法 (法律和政府) 、金融經濟學、政治和社會議題 (政治) 或地緣政治學"},{ta:"",proj:"",raw:"35-65 / 青埔竹科 / 金融投資
-青埔（+5 公里） ; 竹北台元科技園區（+5 公里）, 竹北高鐵（+2 公里）
-金融市場（投資） 、金融經濟學、交易策略（投資） 、投資管理（投資） 、資產管理 (商業和金融業) 、納斯達克100指數、倫敦證券交易所 (投資) 、美國運通、現金、特斯拉汽車（交通工具） 、英偉達、住宅房地產 (房地產) 、房地產（產業） 或黃金（金屬與礦物）"},{ta:"",proj:"",raw:"30-60 / 彰市 / 自營商/醫律/投資
-彰化車站（+5 公里）
-法律分支 (法律和政府) 、室內設計（設計） 、律師事務所 (法律和法律諮詢服務) 、批發（零售） 、供應鏈、個人理財（銀行業） 、經銷（商業） 、出口貿易、電子商務（零售） 、食品產業、生物學（科學） 、投資（商業與財務） 、醫學院 (高等教育) 、房地產（產業） 、居家事業（商業與財務） 、財產保險或零售業（產業）、行為：小型企業主"},{ta:"",proj:"",raw:"30-55/中科水湳中清/科技自營商A
-水湳中央公園（+2 公里）, 中清交流道（+2 公里）, 中科路， 台中市（+3 公里） Taichung
-人工智慧（計算） 、自動化技術、資訊科技（電腦和電子產品） 、 591房屋交易網、工程（科學） 、力學、金屬、時事（政治） 、電機工程（工程） 、高科技（電腦和電子產品） 、機械工程（工程） 、電子工程、消費電子產品（電腦和電子產品） 、科技（電腦和電子產品） 或資訊, 行為：科技早期採用者,"}];
